Перем М;

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", "АРМЗаказовИнтернетМагазина");
	ПараметрыРегистрации.Вставить("Версия", ЭтотОбъект.Метаданные().Комментарий);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "АРМ заказов интернет-магазина");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	"АРМ заказов интернет-магазина",
	"АРМЗаказовИнтернетмагазина",
	"ОткрытиеФормы",
	Истина);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, 
	Представление,
	Идентификатор, 
	Использование, 
	ПоказыватьОповещение = Ложь, 
	Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьМетод(ИмяМетода, Параметры = Неопределено) Экспорт
		
	ОбменССайтом.ПолучитьСтруктуруПараметровПоУмолчанию(Параметры);
	
	Попытка
		Возврат Вычислить(ИмяМетода + "(Параметры)");
	Исключение
		Параметры.Отказ = Истина;
		Параметры.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = "Ошибка выпонения "+ИмяМетода+":"+Символы.ПС+Параметры.ОписаниеОшибки;
		ОтправитьНаПочту("АРМ ИМ", ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

//*** ПОДКЛЮЧАЕМЫЕ МЕТОДЫ 
Функция МетодыВнешнегоМодуля(Параметры) Экспорт
	
	Соответствие = Новый Соответствие;
//	Соответствие.Вставить("ОчиститьМаршрутыПриЗакрытииЗаказа", Истина);
//	Соответствие.Вставить("ОтправитьУведомлениеОбИзмененииСтатусаЗаказа", Истина);
	
	Метод = Неопределено;
	Если Параметры.Свойство("Метод", Метод) Тогда
		Параметры.Результат = Не Соответствие.Получить(Метод) = Неопределено;
	Иначе
		Параметры.Результат = Соответствие;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВернутьТелоПисьма(ТекстПротокола) Экспорт
	
	Попытка
		ТекстПисьма = 
		"<html>
		|<head>
		|	<meta http-equiv=Content-Type content=""text/html; charset=utf-8"">
		|	<style type=""text/css"">
		|		.log {
		|			font-family:Verdana; 		
		|			text-align: left;
		|		 	font-size: 10pt; 						
		|			color : #003366;
		|			background-color : #F9F9F9;
		|		}
		|	</style>
		|</head>
		|<body>
		|	<p class=""log"">"+СтрЗаменить(ТекстПротокола,Символы.ПС,"<br>")+"</p>
		|</body>
		|</html>";		
		Возврат ТекстПисьма;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

Процедура ОтправитьНаПочту(ТемаСообщения, Текст, Вложение = "") Экспорт
		
	Текст = "Время: " + Формат(ТекущаяДата(),"ДФ=дд.ММ.гггг ЧЧ:мм") + Символы.ПС +
		"Модуль: " + ЭтотОбъект.Метаданные().Синоним + Символы.ПС + 
		"Версия: " + ЭтотОбъект.Метаданные().Комментарий + Символы.ПС + Текст;
	Текст = ВернутьТелоПисьма(Текст);
	
	Если НЕ Вложение = "" Тогда
		
		ИмяТД = ПолучитьИмяВременногоФайла("txt");
		ТД = Новый ТекстовыйДокумент;
		ТД.УстановитьТекст(Вложение);
		ТД.Записать(ИмяТД);
		Вложения = Новый Массив;
		Вложения.Добавить(ИмяТД);
	
		ИнтеграцияСервер.ОтправитьУведомлениеНаПочту(Текст, ТемаСообщения, М, , , , Вложения, , , , ТипТекстаПочтовогоСообщения.HTML);
	
		УдалитьФайлы(ИмяТД);
		
	Иначе
		
		ИнтеграцияСервер.ОтправитьУведомлениеНаПочту(Текст, ТемаСообщения, М, , , , , , , , ТипТекстаПочтовогоСообщения.HTML);
		
	КонецЕсли;		
	
КонецПроцедуры

Функция ОтправитьСМС(Абоненты, Сообщение) Экспорт 
	
	МассивАбонентов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Абоненты);
	
	МассивРезультатов = Новый Массив;
	
	//*** Отправка СМС через МТС Маркетолог ***
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("Сервер"			, "https://omnichannel.mts.ru/http-api/v1/messages");
	СтруктураНастроек.Вставить("Имя"			, "gw_rwTKNj2S7OFY");
	СтруктураНастроек.Вставить("Пароль"			, "Hsg1Pkis");
	СтруктураНастроек.Вставить("Токен"			, "273cd385-910d-388d-9181-ce3ce8057d87");
	СтруктураНастроек.Вставить("Нейминг"		, "Yarche");
	
	//если более 10 сообщений в 1 запросе, рекомендуется отправка в буфер
	Если МассивАбонентов.Количество() > 10 Тогда
		СтруктураНастроек.Сервер = "https://omnichannel.mts.ru/http-api/v1/b/messages/";
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization","Basic " + ПреобразоватьСтрокуВBase64(СтруктураНастроек.Имя+":"+СтруктураНастроек.Пароль));
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Если Час(ТекущаяДата()) < 7 Тогда
		Для Каждого Абонент Из МассивАбонентов Цикл
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("Абонент", Абонент);
			СтруктураВозврата.Вставить("Результат"	, Ложь);
			СтруктураВозврата.Вставить("Комментарий", "Запрет отправки СМС с 00:00 до 07:00");
			МассивРезультатов.Добавить(СтруктураВозврата);
		КонецЦикла;
		Возврат МассивРезультатов;		
	КонецЕсли;
	
	СтруктураОтправки = Новый Структура;
	МассивСообщений = Новый Массив;
	
	Для Каждого Абонент Из МассивАбонентов Цикл
		
		ОчередноеСообщение = Новый Структура;
		ОчередноеСообщение.Вставить("content", Новый Структура("short_text", Сообщение));
		ОчередноеСообщение.Вставить("from", Новый Структура("sms_address", СтруктураНастроек.Нейминг));
		МассивАдресата = Новый Массив;
		МассивАдресата.Добавить(Новый Структура("msisdn, message_id", Абонент, Строка(Новый УникальныйИдентификатор)));
		ОчередноеСообщение.Вставить("to", МассивАдресата);
		МассивСообщений.Добавить(ОчередноеСообщение);
	
	КонецЦикла;
	
	СтруктураОтправки.Вставить("messages", МассивСообщений);
	СтрокаJSON = JSON_1C.ЗаписатьJSON82(СтруктураОтправки);
	
	HTTPОтвет = Неопределено;
	ОписаниеОшибкиОтправкиЗапроса = "";
	
	Таймаут = 0;
	//Таймаут = 10000;
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	Если Таймаут > 0 Тогда
		WinHttp.SetTimeouts(Таймаут, Таймаут, Таймаут, Таймаут);
	КонецЕсли;
	
	WinHttp.Open("POST", СтруктураНастроек.Сервер);
		
	Для Каждого КлючЗначение Из Заголовки Цикл
		WinHttp.SetRequestHeader(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	сч = 1;
	ЧислоПопыток = 3;
	Пока сч < ЧислоПопыток Цикл
		Попытка
			WinHttp.Send(СтрокаJSON);
			HTTPОтвет = Новый Структура;
			HTTPОтвет.Вставить("КодСостояния", WinHttp.Status);
			HTTPОтвет.Вставить("ТекстОтвета", WinHttp.ResponseText());
			Прервать;
		Исключение
			ОписаниеОшибкиОтправкиЗапроса = ОписаниеОшибки();
			сч = сч + 1;
		КонецПопытки;
	КонецЦикла;

	ОтправленоАбонентам = новый Массив;
	РезультатОтправки = Истина;
	Комментарий = "";
	
	Если HTTPОтвет = Неопределено Тогда
		
		РезультатОтправки = Ложь;
		
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(МассивАбонентов);
		ОтправленоАбонентам = СЗ.ВыгрузитьЗначения();
		
		Комментарий = ОписаниеОшибкиОтправкиЗапроса;
		
	ИначеЕсли HTTPОтвет.КодСостояния <> 200 Тогда
		
		РезультатОтправки = Ложь;
		
		СЗ = Новый СписокЗначений;
		СЗ.ЗагрузитьЗначения(МассивАбонентов);
		ОтправленоАбонентам = СЗ.ВыгрузитьЗначения();
		
		ОтветСервера = JSON_1C.ПрочитатьJSON82(HTTPОтвет.ТекстОтвета);
		Если ТипЗнч(ОтветСервера) = Тип("Соответствие") Тогда
			Комментарий = ОтветСервера.Получить("message");
		ИначеЕсли ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
			ОтветСервера.Свойство("message", Комментарий);
		Иначе
			Комментарий = "Ошибка отправки СМС";
		КонецЕсли;
		
	Иначе
		
		ОтветСервера = JSON_1C.ПрочитатьJSON82(HTTPОтвет.ТекстОтвета);
		ОтправленоАбонентам = новый Массив;
		МассивОтветов = Новый Массив;
		Если ТипЗнч(ОтветСервера) = Тип("Соответствие") Тогда
			МассивОтветов = ОтветСервера.Получить("messages");
		ИначеЕсли ТипЗнч(ОтветСервера) = Тип("Структура") Тогда
			ОтветСервера.Свойство("messages", МассивОтветов);
		КонецЕсли;
		Если ТипЗнч(МассивОтветов) = Тип("Массив") Тогда
			Для Каждого ЭлементОтвет Из МассивОтветов Цикл
				Если ТипЗнч(ЭлементОтвет) = Тип("Соответствие") Тогда
					ОтправленоАбонентам.Добавить(ЭлементОтвет.Получить("msisdn"));
				ИначеЕсли ТипЗнч(ЭлементОтвет) = Тип("Структура") Тогда
					msisdn = "";
					ЭлементОтвет.Свойство("msisdn", msisdn);
					ОтправленоАбонентам.Добавить(msisdn);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Комментарий = "Отправлено";
		
	КонецЕсли;
	
	Для Каждого Абонент Из ОтправленоАбонентам Цикл
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Абонент", Абонент);
		СтруктураВозврата.Вставить("Результат", РезультатОтправки);
		СтруктураВозврата.Вставить("Комментарий", Комментарий);
		МассивРезультатов.Добавить(СтруктураВозврата);
	КонецЦикла;
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция ПреобразоватьСтрокуВBase64(ИсходнаяСтрока)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
    Запись = Новый ЗаписьТекста(ВременныйФайл);
    Запись.Записать(ИсходнаяСтрока);
    Запись.Закрыть();
    
    ДвДанные = Новый ДвоичныеДанные(ВременныйФайл);
    СтрокаBase64 = Base64Строка(ДвДанные);
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, "77u/", "");
	СтрокаBase64 = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	
	Попытка
    	УдалитьФайлы(ВременныйФайл);	
	Исключение
	КонецПопытки;
	
	Возврат СтрокаBase64;
	
КонецФункции

&НаСервере
Процедура РазрешитьОтгрузкуНаСервере(НомерДокумента, Отгрузка, ДокументСсылка, Результат, ТекстОшибки) Экспорт
	
	Попытка
		COMcomApplication = new COMОбъект("AXSalesAllowShipmentService.AXServiceClass");
	Исключение
		Результат = Ложь;
		ТекстОшибки = "НЕ установлена компанента связи с АХ2012!";
		Возврат;
	КонецПопытки;
	
	КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
	Если КодУзла = "000" Тогда
		//COMcomApplication.url = "net.tcp://nsk-aos12-15:8202/DynamicsAx/Services/KDVSalesAllowShipmentServiceGroup";  //Толмачево2-Камелот.		
		COMcomApplication.url = "net.tcp://AX2012-TOLM:8201/DynamicsAx/Services/KDVSalesAllowShipmentServiceGroup";  //Толмачево2-Камелот.		
	ИначеЕсли КодУзла = "010" Тогда
//		COMcomApplication.url = "net.tcp://msk-aos12-01:8201/DynamicsAx/Services/KDVSalesAllowShipmentServiceGroup";
		//COMcomApplication.url = "net.tcp://msks-aos12-01:8201/DynamicsAx/Services/KDVSalesAllowShipmentServiceGroup";
		COMcomApplication.url = "net.tcp://AX2012-OBUH2:8201/DynamicsAx/Services/KDVSalesAllowShipmentServiceGroup";
	Иначе 
		ТекстОшибки = "Не определен путь выгрузки данных в аксапту!" + Символы.ПС + ТекстОшибки;
		Результат = Ложь;
		Возврат;
	КонецЕсли; 
	
	//COMcomApplication.userName = "tsk_1C_Ax";
	//COMcomApplication.password = "Qwerty123!@#";
	COMcomApplication.userName = "tsk-1c-ax";
	COMcomApplication.password = "22a0m~vS0TTK2imhzkdr98fsxYr1vB%5";
	COMcomApplication.domain   = "kdvm";
	
	ТекстОшибки = COMcomApplication.updateNow(НомерДокумента, Отгрузка);
	Если ПустаяСтрока(ТекстОшибки) Тогда
		Если Отгрузка = 2 Тогда
			УдалитьРеализациюПоЗаказу(ДокументСсылка);
		КонецЕсли;
		ДокОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокОбъект.СтатусПроверки = Отгрузка + 2;
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Результат = Истина;		
		ТекстОшибки = "";
	Иначе
		Результат = Ложь;
		ТекстОшибки = "При выполнении возникла ошибка!" + Символы.ПС + ТекстОшибки;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРеализациюПоЗаказу(ЗаказСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТекст = "
		|ВЫБРАТЬ
		|	ДокЗаказКлиента.Ссылка КАК Заказ,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
		|ИЗ
		|	Документ.ЗаказКлиента КАК ДокЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДокЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
		|			И НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|ГДЕ
		|	ДокЗаказКлиента.Ссылка = &ЗаказКлиента
		|";
		
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.УстановитьПараметр("ЗаказКлиента", ЗаказСсылка);
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл
		РеализацияСсылка = лВыборка.Реализация;
		Если РеализацияСсылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		РеализацияОбъект = РеализацияСсылка.ПолучитьОбъект();
		РеализацияОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
		РеализацияОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
		РеализацияОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		РеализацияОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекущийНомерВерсии(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВерсииОбъектов.НомерВерсии), 0) КАК НомерВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект = &Заказ
		|	И ВерсииОбъектов.Объект ССЫЛКА Документ.ЗаказКлиента";

	Запрос.УстановитьПараметр("Заказ", Заказ);
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НомерВерсии;
	КонецЦикла;

	Возврат 0;
	
КонецФункции

//Методы возврат

//Отмечаются товары из СписокТоваровВозврат как отмененные
//	ДокументОбъект - Объект документа (заказ клиента)
//	СписокТоваровВозврат - вход: ТЗ (Номенклатура, Количество, КоличествоШтук, ПричинаОтмены)
//	СписокТоваровВозврат - выход: ТЗ (Номенклатура, Количество, КоличествоШтук, ПричинаОтмены, Упаковка, Цена, КоличествоУпаковок, Сумма, СтавкаНДС, СуммаНДС)
//	ОписаниеРезультата - Текстовое представление ошибки
//Возврат: Булево
&НаСервере
Функция СкорректироватьТоварыЗаказа(ДокументОбъект, СписокТоваровВозврат, ОписаниеРезультата, СсылкаНаДокументПродажи = Неопределено) Экспорт

	Если СсылкаНаДокументПродажи = Неопределено Тогда
		СсылкаНаДокументПродажи = Документы.ЧекККМ.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказКлиента") Тогда
		
		СписокТоваровВозврат.Колонки.Добавить("Упаковка");
		СписокТоваровВозврат.Колонки.Добавить("КоличествоУпаковок");
		СписокТоваровВозврат.Колонки.Добавить("Сумма");
		СписокТоваровВозврат.Колонки.Добавить("СтавкаНДС");
		СписокТоваровВозврат.Колонки.Добавить("СуммаНДС");
		
		//Товары
		Для Каждого СтрокаТовар Из ДокументОбъект.Товары Цикл
			
			Если СтрокаТовар.Отменено ИЛИ СтрокаТовар.ПричинаОтмены <> Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка() Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТовар.КоличествоУпаковок = 0 ИЛИ СтрокаТовар.Количество = 0 Тогда
				КоэфУпаковки = 1;
			Иначе
				КоэфУпаковки = СтрокаТовар.Количество / СтрокаТовар.КоличествоУпаковок;
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", СтрокаТовар.Номенклатура);
			НайденныеСтроки = СписокТоваровВозврат.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				КоличествоУпаковокВозврат = НайденнаяСтрока.Количество;
				КоличествоВозврат = НайденнаяСтрока.Количество * КоэфУпаковки;
				КоличествоШтукВозврат = НайденнаяСтрока.КоличествоШтук;
				
				Если КоличествоВозврат > СтрокаТовар.Количество Тогда
					
					ОписаниеРезультата = "Для " + СтрокаТовар.Номенклатура + " количество к возврату больше чем продано";
					Возврат Ложь;
					
				ИначеЕсли КоличествоВозврат = СтрокаТовар.Количество Тогда
				
					СтрокаТовар.Отменено = Истина;
					СтрокаТовар.ПричинаОтмены = НайденнаяСтрока.ПричинаОтмены;
					
				Иначе
					
					НС = ДокументОбъект.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НС, СтрокаТовар);
					
					НовоеКоличество = СтрокаТовар.Количество - КоличествоВозврат;
					НовоеКоличествоУпаковок = СтрокаТовар.КоличествоУпаковок - КоличествоУпаковокВозврат;
					НовоеКоличествоШтук = СтрокаТовар.КоличествоШтук - КоличествоШтукВозврат;
					
					СтрокаТовар.Количество 			= НовоеКоличество;
					СтрокаТовар.КоличествоШтук 		= НовоеКоличествоШтук;
					СтрокаТовар.КоличествоУпаковок 	= НовоеКоличествоУпаковок;
					СтрокаТовар.Сумма 				= СтрокаТовар.Цена * НовоеКоличествоУпаковок;
					СтрокаТовар.СуммаНДС 			= Ценообразование.РассчитатьСуммуНДС(СтрокаТовар.Сумма, СтрокаТовар.СтавкаНДС, Истина);
					
					НС.Количество 					= КоличествоВозврат;
					НС.КоличествоШтук 				= КоличествоШтукВозврат;
					НС.КоличествоУпаковок 			= КоличествоУпаковокВозврат;
					НС.Сумма		 				= НС.Цена * КоличествоУпаковокВозврат;
					НС.СуммаНДС 					= Ценообразование.РассчитатьСуммуНДС(НС.Сумма, НС.СтавкаНДС, Истина);
					НС.Отменено 					= Истина;
					НС.ПричинаОтмены 				= НайденнаяСтрока.ПричинаОтмены;
					
				КонецЕсли;
				
				НайденнаяСтрока.Упаковка			= СтрокаТовар.Упаковка;
				НайденнаяСтрока.Цена 				= СтрокаТовар.Цена;
				НайденнаяСтрока.КоличествоУпаковок 	= КоличествоУпаковокВозврат;
				НайденнаяСтрока.Количество			= КоличествоВозврат;
				НайденнаяСтрока.Сумма			 	= СтрокаТовар.Цена * КоличествоУпаковокВозврат;
				НайденнаяСтрока.СтавкаНДС		 	= СтрокаТовар.СтавкаНДС;
				НайденнаяСтрока.СуммаНДС		 	= Ценообразование.РассчитатьСуммуНДС(НайденнаяСтрока.Сумма, СтрокаТовар.СтавкаНДС, Истина);
				
				//удаление марок
				НайденныеАкцизныеМарки = ДокументОбъект.АкцизныеМарки.НайтиСтроки(Новый Структура("Марка", НайденнаяСтрока.Марка));
				Для Каждого НайденнаяАкцизнаяМарка Из НайденныеАкцизныеМарки Цикл
					НайденнаяАкцизнаяМарка.Отменено = Истина;
					НайденнаяАкцизнаяМарка.ДокументПродажи = СсылкаНаДокументПродажи;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + ?(ЗначениеЗаполнено(ДокументОбъект.Комментарий), Символы.ПС, "") 
												+ Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm:ss'") + " " + Строка(ПараметрыСеанса.ТекущийПользователь) + " - " + "Оформление возврата от клиента";  
		ДокументОбъект.СуммаДокумента = ДокументОбъект.ПолучитьСуммуЗаказанныхСтрок();
		ДокументОбъект.ЗаполнитьЭтапыГрафикаОплаты();     
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);	
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

//Формирует возврат от клиента на товары СписокТоваровВозврат
//	ДокументОбъект - документ Возврат от клиента объект
//	ЗаказСсылка - ссылка на заказ
//	ОРПСсылка - ссылка на ОРП (можно пустую)
//	СписокТоваровВозврат - ТЗ (Номенклатура, Количество, КоличествоШтук, ПричинаОтмены, Упаковка, Цена, КоличествоУпаковок, Сумма, СтавкаНДС, СуммаНДС)
&НаСервере
Процедура СформироватьВозвратОтКлиента(ДокументОбъект, ЗаказСсылка, ОРПСсылка, СписокТоваровВозврат) Экспорт
	
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Организация			= ЗаказСсылка.Организация;
	ДокументОбъект.Партнер				= ЗаказСсылка.Партнер;
	ДокументОбъект.Контрагент			= ЗаказСсылка.Контрагент;
	ДокументОбъект.Соглашение			= ЗаказСсылка.Соглашение;
	ДокументОбъект.Сделка				= ЗаказСсылка.Сделка;
	ДокументОбъект.Валюта				= ЗаказСсылка.Валюта;
	ДокументОбъект.Склад				= ЗаказСсылка.Склад;
	ДокументОбъект.ЦенаВключаетНДС		= ЗаказСсылка.ЦенаВключаетНДС;
	ДокументОбъект.Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Камелот – А");
	ДокументОбъект.Менеджер 			= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Комментарий			= "Возврат по заказу ИМ: " + ЗаказСсылка;
	ДокументОбъект.ДокументРеализации 	= ОРПСсылка;
	ДокументОбъект.НалогообложениеНДС	= ЗаказСсылка.НалогообложениеНДС;
	ДокументОбъект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя;
	ДокументОбъект.ЧекККМ				= ЗаказСсылка.ЧекПродажа;
	
	Для Каждого СтрокаТЗ Из СписокТоваровВозврат Цикл
		
		НСТовары = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НСТовары, СтрокаТЗ);
		
		НСВидыЗапасов = ДокументОбъект.ВидыЗапасов.Добавить();
		ЗаполнитьЗначенияСвойств(НСВидыЗапасов, СтрокаТЗ);
		
		НСВидыЗапасов.СкладОтгрузки = ЗаказСсылка.Склад;
		НСВидыЗапасов.ВидЗапасов = Справочники.ВидыЗапасов.ПустаяСсылка();
		НСВидыЗапасов.СуммаСНДС = СтрокаТЗ.Сумма;
		
		ТекстЗапроса = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВидыЗапасов.Ссылка
			|ИЗ
			|	Справочник.ВидыЗапасов КАК ВидыЗапасов
			|ГДЕ
			|	ВидыЗапасов.Организация = &Организация
			|	И ВидыЗапасов.ТипЗапасов = &ТипЗапасов
			|";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Организация", ЗаказСсылка.Организация);
		Запрос.УстановитьПараметр("ТипЗапасов", Перечисления.ТипыЗапасов.Товар);
		РезультатВыборка = Запрос.Выполнить().Выбрать();
		Пока РезультатВыборка.Следующий() Цикл
        	НСВидыЗапасов.ВидЗапасов = РезультатВыборка.Ссылка;
			Прервать;
		КонецЦикла;
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента		= ДокументОбъект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьВозвратОтКлиентаПоРеализации(ДокументОбъект, ЗаказСсылка, ДокументРеализации, СписокТоваровВозврат, ДатаВозврата) Экспорт
	ДокументОбъект.Заполнить(ДокументРеализации);
	ДокументОбъект.Товары.Очистить();
	Для Каждого СтрокаВозврат Из СписокТоваровВозврат Цикл
		НС = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаВозврат);
	КонецЦикла;    
	ДокументОбъект.СуммаДокумента 		= ДокументОбъект.Товары.Итог("Сумма");
	ДокументОбъект.НеОтражатьВБУ		= Истина;
	ДокументОбъект.Дата 				= ДатаВозврата;
	ДокументОбъект.Комментарий			= "Возврат по заказу клиента: " + ЗаказСсылка;
	ДокументОбъект.ХозяйственнаяОперация= Перечисления.ХозяйственныеОперации.ВозвратТоваровОтКлиента; 
КонецПроцедуры

//Формирует эквайринговую операцию на сумму возврата
//	ДокументОбъект - документ Операция по платежной карте
//	ЗаказСсылка - ссылка на заказ
//	СуммаОперации - СуммаДокумента
&НаСервере
Процедура СформироватьЭквайринговуюОперацию(ДокументОбъект, ЗаказСсылка, СуммаОперации) Экспорт
	
	ДокументОбъект.Дата 						= ТекущаяДата();
	ДокументОбъект.Организация 					= ЗаказСсылка.Организация;
	ДокументОбъект.СуммаДокумента 				= СуммаОперации;
	ДокументОбъект.ЭквайринговыйТерминал	 	= ЭквайринговыйТерминал(ЗаказСсылка.ЧекПродажа.КассаККМ);
	ДокументОбъект.ДоговорЭквайринга 			= ДокументОбъект.ЭквайринговыйТерминал.Владелец;
	ДокументОбъект.ВидПлатежнойКарты 			= "Платежная карта"; 
	ДокументОбъект.НомерПлатежнойКарты 			= "123456789012";
	ДокументОбъект.Валюта 						= ЗаказСсылка.Валюта;
	ДокументОбъект.ХозяйственнаяОперация 		= Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
	ДокументОбъект.Контрагент 					= ЗаказСсылка.Контрагент;
	ДокументОбъект.СтатьяДвиженияДенежныхСредств= Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000004");
	
	НС = ДокументОбъект.РасшифровкаПлатежа.Добавить();
	НС.Партнер		= ЗаказСсылка.Партнер;
	НС.Заказ		= ЗаказСсылка;
	НС.Сумма		= СуммаОперации;
	
КонецПроцедуры

//Формирует требование накладную на товары СписокТоваровВозврат
//	ДокументОбъект - документ требование накладная
//	ЗаказСсылка - ссылка на заказ
//	СписокТоваровВозврат - ТЗ (Номенклатура, Количество, КоличествоШтук, ПричинаОтмены, Упаковка, Цена, КоличествоУпаковок, Сумма, СтавкаНДС, СуммаНДС)
&НаСервере
Процедура СформироватьТребованиеНакладную(ДокументОбъект, ЗаказСсылка, СписокТоваровВозврат) Экспорт
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "ВитринаИнтернетМагазина");
	
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Организация			= ЗаказСсылка.Организация;
	ДокументОбъект.Склад				= ЗаказСсылка.Склад;
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		ДокументОбъект.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000010"); //Списание бой/брак
	Иначе
		ДокументОбъект.СтатьяРасходов		= ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("01-000024"); //Истекший срок годности
	КонецЕсли;
	ДокументОбъект.АналитикаРасходов 	= ЗаказСсылка.Организация;
	ДокументОбъект.Подразделение		= Справочники.СтруктураПредприятия.НайтиПоНаименованию("Камелот – А");
	ДокументОбъект.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Комментарий			= "Списание брака из возврата покупателя по заказу ИМ: " + ЗаказСсылка;
	ДокументОбъект.СтатусОтгрузки		= Перечисления.СтатусыОтгрузки.Отгружено;
	ДокументОбъект.ВидЦены				= ДокументОбъект.Склад.УчетныйВидЦены;
	
	Для Каждого СтрокаТЗ Из СписокТоваровВозврат Цикл
		
		НСТовары = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НСТовары, СтрокаТЗ);
		НСТовары.КоличествоУпаковок = НСТовары.Количество;
		
	КонецЦикла;
	
КонецПроцедуры

//Формирует чек ккм возврат на товары СписокТоваровВозврат
//	ДокументОбъект - документ ЧекККМВозврат
//	ЗаказСсылка - ссылка на заказ
//	СписокТоваровВозврат - ТЗ (Номенклатура, Количество, КоличествоШтук, ПричинаОтмены, Упаковка, Цена, КоличествоУпаковок, Сумма, СтавкаНДС, СуммаНДС)
&НаСервере
Процедура СформироватьЧекККМВозврат(ДокументОбъект, ЗаказСсылка, СписокТоваровВозврат) Экспорт
	
	ЧекККМСсылка = ЗаказСсылка.ЧекПродажа;
	
	РеквизитыЧека = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЧекККМСсылка, "Валюта, ВидЦены, КассаККМ, Кассир, НалогообложениеНДС, Организация, Склад, ЦенаВключаетНДС, ОплатаПлатежнымиКартами, ФормаОплаты");
	
	ДокументОбъект.Дата 				= ТекущаяДата();
	ДокументОбъект.Архивный				= Ложь;
	ДокументОбъект.Валюта				= РеквизитыЧека.Валюта;
	ДокументОбъект.ВидЦены				= РеквизитыЧека.ВидЦены;
	ДокументОбъект.КассаККМ				= РеквизитыЧека.КассаККМ;
	ДокументОбъект.Кассир				= РеквизитыЧека.Кассир;
	ДокументОбъект.Комментарий			= "Возврата по заказу ИМ: " + ЗаказСсылка + " (Чек: " + ЧекККМСсылка + ")";
	ДокументОбъект.НалогообложениеНДС	= РеквизитыЧека.НалогообложениеНДС;
	ДокументОбъект.НомерЧекаККМ			= 0;
	ДокументОбъект.Организация			= РеквизитыЧека.Организация;
	ДокументОбъект.Склад				= РеквизитыЧека.Склад;
	ДокументОбъект.ЦенаВключаетНДС		= РеквизитыЧека.ЦенаВключаетНДС;
	ДокументОбъект.ЧекККМ				= ЧекККМСсылка;
	ДокументОбъект.Статус				= Перечисления.СтатусыЧековККМ.Пробит;
	ДокументОбъект.ФормаОплаты			= РеквизитыЧека.ФормаОплаты;
	
	Для Каждого СтрокаТЗ Из СписокТоваровВозврат Цикл
		
		НСТовары = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НСТовары, СтрокаТЗ);
		
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
	ДокументОбъект.СуммаНаличными = 0;
	ДокументОбъект.СуммаБезналичными = ДокументОбъект.СуммаДокумента;
	
	ВыборкаОплатЧека = РеквизитыЧека.ОплатаПлатежнымиКартами.Выбрать();
	Если ВыборкаОплатЧека.Количество() = 0 Тогда
		НСОплата = ДокументОбъект.ОплатаПлатежнымиКартами.Добавить();
		НСОплата.ВидПлатежнойКарты			= "Платежная карта";
		НСОплата.НомерПлатежнойКарты		= "123456789012";
		НСОплата.Сумма						= ДокументОбъект.СуммаДокумента;
		НСОплата.ЭквайринговыйТерминал		= ЭквайринговыйТерминал(ЧекККМСсылка.КассаККМ);
	Иначе
		ВыборкаОплатЧека.Следующий();
		НСОплата = ДокументОбъект.ОплатаПлатежнымиКартами.Добавить();
		НСОплата.ВидПлатежнойКарты			= ВыборкаОплатЧека.ВидПлатежнойКарты;
		НСОплата.НомерПлатежнойКарты		= ВыборкаОплатЧека.НомерПлатежнойКарты;
		НСОплата.Сумма						= ДокументОбъект.СуммаДокумента;
		НСОплата.ЭквайринговыйТерминал		= ВыборкаОплатЧека.ЭквайринговыйТерминал;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СкорректироватьТоварыРТУ(ДокументОбъект, Товары, ЭтоВозврат, ОписаниеРезультата) Экспорт
	
	МассивУдаляемых = Новый Массив;
	МассивУдаляемыхДатыВыпуска = Новый Массив;
		
	Для Каждого СтрТовар Из ДокументОбъект.Товары Цикл
			
		СтрокаПродажи = Товары.Найти(СтрТовар.Номенклатура, "Номенклатура");
		Если СтрокаПродажи = Неопределено Тогда
			Если ЭтоВозврат Тогда
				Продолжить;
			Иначе
				МассивУдаляемых.Добавить(СтрТовар);
				Продолжить;
			КонецЕсли;
		КонецЕсли;
			
		Если Не ЭтоВозврат И СтрТовар.Количество <> СтрокаПродажи.Количество Тогда
				
			СтрТовар.Количество = СтрокаПродажи.Количество;
			СтрТовар.КоличествоУпаковок = СтрТовар.Количество;
				
			СтрТовар.Сумма = СтрТовар.Цена * СтрТовар.КоличествоУпаковок;
			СтрТовар.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(СтрТовар.Сумма, СтрТовар.СтавкаНДС, Истина);
				
		ИначеЕсли ЭтоВозврат И СтрТовар.Количество <> СтрокаПродажи.Количество Тогда
				
			СтрТовар.Количество = СтрТовар.Количество - СтрокаПродажи.Количество;
			СтрТовар.КоличествоУпаковок = СтрТовар.Количество;
				
			СтрТовар.Сумма = СтрТовар.Цена * СтрТовар.КоличествоУпаковок;
			СтрТовар.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(СтрТовар.Сумма, СтрТовар.СтавкаНДС, Истина);
				
		ИначеЕсли ЭтоВозврат И СтрТовар.Количество = СтрокаПродажи.Количество Тогда	
			
			МассивУдаляемых.Добавить(СтрТовар);
			Продолжить;
			
		ИначеЕсли Не ЭтоВозврат И СтрТовар.Количество = СтрокаПродажи.Количество Тогда	
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокиНоменклатура = ДокументОбъект.ДатыВыпуска.НайтиСтроки(Новый Структура("Номенклатура", СтрТовар.Номенклатура));
		
		Если СтрокиНоменклатура.Количество() > 1 Тогда
			
			ОстатокРаспределить = СтрТовар.Количество;
			
			Для Каждого Стр Из СтрокиНоменклатура ЦИкл
				
				Если ОстатокРаспределить <= 0 Тогда
					МассивУдаляемыхДатыВыпуска.Добавить(Стр);
					Продолжить;
				КонецЕсли;
				
				Стр.Количество = Мин(Стр.Количество, ОстатокРаспределить);
				ОстатокРаспределить = ОстатокРаспределить - Мин(Стр.Количество, ОстатокРаспределить);				
				
			КонецЦикла;
				
		ИначеЕсли СтрокиНоменклатура.Количество() = 1 Тогда
				
			СтрокиНоменклатура[0].Количество = СтрТовар.Количество;
				
		КонецЕсли;
			
	КонецЦикла;
		
	Для Каждого Удаляемая Из МассивУдаляемых Цикл
		ДокументОбъект.Товары.Удалить(Удаляемая);
	КонецЦикла;
	Для Каждого Удаляемая Из МассивУдаляемыхДатыВыпуска Цикл
		ДокументОбъект.ДатыВыпуска.Удалить(Удаляемая);
	КонецЦикла;
		
	МассивУдаляемых.Очистить();
	МассивУдаляемыхДатыВыпуска.Очистить();
		
	Для Каждого СтрокаДВ Из ДокументОбъект.ДатыВыпуска Цикл
			
		СтрокиНоменклатура = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДВ.Номенклатура));
		Если Не СтрокиНоменклатура.Количество() Тогда
			МассивУдаляемыхДатыВыпуска.Добавить(СтрокаДВ);
		КонецЕсли;
		
	КонецЦикла;
		
	Для Каждого Удаляемая Из МассивУдаляемыхДатыВыпуска Цикл
		ДокументОбъект.ДатыВыпуска.Удалить(Удаляемая);
	КонецЦикла;
	
	ДокументОбъект.СуммаДокумента = ДокументОбъект.Товары.Итог("Сумма");
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура СформироватьРезервПоВозвращеннымТоварам(ДокументОбъект, ДокументДляСторно, ТЗ_Возврат, СообщениеОбОшибке) Экспорт
	
	ДатаВыполнения = ТекущаяДата();
	
	ДокументОбъект.Дата = ДатаВыполнения;
	ДокументОбъект.Ответственный  = ПараметрыСеанса.ТекущийПользователь;
	ДокументОбъект.Комментарий  = "# Закрыто роботом # Возврат по заказу клиенту, формирование резерва по свободным остаткам";
	ДокументОбъект.Основание = ДокументДляСторно;
	
	НаборДвижений = ДокументОбъект.Движения.СвободныеОстатки;
	Для Каждого СтрокаВозврат Из ТЗ_Возврат Цикл
		
		ДвижениеСторно = НаборДвижений.Добавить();
		ДвижениеСторно.Активность = Истина;
		ДвижениеСторно.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеСторно.Период = ДатаВыполнения;
		ДвижениеСторно.Номенклатура = СтрокаВозврат.Номенклатура;
		ДвижениеСторно.Склад = ДокументДляСторно.Склад;
		ДвижениеСторно.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ДвижениеСторно.ВНаличии = 0;
		ДвижениеСторно.ВРезерве = СтрокаВозврат.Количество;
		
	КонецЦикла;
	
	СтрокаТабДвижения = ДокументОбъект.ТаблицаРегистров.Добавить();
	СтрокаТабДвижения.Имя = "СвободныеОстатки";
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЭквайринговуюОперациюВозврата(ДокументОбъект, ДокументДляВозврата, СуммаВозврата) Экспорт
	
	ДокументОбъект = ДокументДляВозврата.Скопировать();
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
	ДокументОбъект.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("01-000004");
	ДокументОбъект.СуммаДокумента = СуммаВозврата;
	Для Каждого СтрокаРасшифровкиПлатежа Из ДокументОбъект.РасшифровкаПлатежа Цикл
		СтрокаРасшифровкиПлатежа.Сумма = СуммаВозврата;
	КонецЦикла;
	
КонецПроцедуры

//возвращает ссылку на ближайший к чеку ОРП
//или пустаю ссылку Документ.ОтчетОРозничныхПродажах
&НаСервере
Функция ПолучитьОРПЧека(СсылкаЧек) Экспорт
	
	ОРП = Документы.ОтчетОРозничныхПродажах.ПустаяСсылка();
	
	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтчетОРозничныхПродажах.Ссылка КАК ОРП
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|		ПО ЧекККМ.Дата <= ОтчетОРозничныхПродажах.Дата
		|			И ЧекККМ.КассаККМ = ОтчетОРозничныхПродажах.КассаККМ
		|			И ЧекККМ.Склад = ОтчетОРозничныхПродажах.Склад
		|ГДЕ
		|	ЧекККМ.Ссылка = &ЧекККМ
		|	И НЕ ОтчетОРозничныхПродажах.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОРП
		|АВТОУПОРЯДОЧИВАНИЕ
		|";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЧекККМ", СсылкаЧек);
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		ОРП = РезультатВыборка.ОРП;
	КонецЦикла;
	
	Возврат ОРП;
	
КонецФункции

Функция ЭквайринговыйТерминал(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ЭквайринговыеТерминалы.Ссылка
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
		|ГДЕ
		|	ЭквайринговыеТерминалы.Касса = &Касса
		|	И ЭквайринговыеТерминалы.ПометкаУдаления = ЛОЖЬ";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ЭквайринговыйТерминалИМ");
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьРТУЗаказа(Заказ) Экспорт
	
	РТУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	ТекстЗапроса = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РеализацияТоваровУслуг.Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	РеализацияТоваровУслуг.ЗаказКлиента = &Заказ
	               |	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	               |АВТОУПОРЯДОЧИВАНИЕ";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		РТУ = РезультатВыборка.Ссылка;
	КонецЦикла;
	
	Возврат РТУ;
	
КонецФункции

&НаСервере
Функция ИзменениеЗапрещеноПоДатеЗапрета(ИдентификаторДанных) Экспорт
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ИдентификаторДанных));
	ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	СообщитьОЗапрете = Ложь;
	
	РезультатПроверки = ДатыЗапретаИзменения.ИзменениеЗапрещено(ПолноеИмя, ИдентификаторДанных, СообщитьОЗапрете);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Функция ПроверкаВыполненияЗакрытияСменИМ() Экспорт
	НаименованиеФЗ = "ЗакрытьСменыСоздатьОРП_ИМ";
	МассивФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние", СостояниеФоновогоЗадания.Активно));
	Для Каждого ФЗ Из МассивФЗ Цикл
		Если Найти(ФЗ.Наименование, НаименованиеФЗ) <> 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;	
КонецФункции

//МагПей
Функция ЗагрузитьОперацииМагПей(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.MagPayID
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Порция = СтруктураОплаты();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Порция.Data.Добавить(Новый Структура("id", ВыборкаДетальныеЗаписи.MagPayID));
	КонецЦикла;
	
	Если Порция.Data.Количество() Тогда  
		ТекстЗапроса = JSONСерверВызовСервера.СформироватьСтрокуJSON(Порция);
		тРез = "";
		Результат = ВыполнитьЗапрос(РесурсыЗапроса().Оплата, ТекстЗапроса, "Оплата", тРез); 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СтруктураОплаты()
	Возврат СтруктураИзСпискаПолей("data", Новый Массив);	
КонецФункции 

Функция СтруктураИзСпискаПолей(СпискоПолейСтрока, Значение = Неопределено) Экспорт
	
	Структура = Новый СТруктура;
	МассивПОлей = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СпискоПолейСтрока, ",");
	ДЛя Каждого ИмяПоля Из МассивПОлей Цикл
		
		Структура.Вставить(СокрЛП(ИмяПоля), Значение);
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция РесурсыЗапроса() Экспорт
	
	Ресурсы = Новый Структура;
	
	
	Ресурсы.Вставить("УдалитьКассиров", "cashiers/delete");
	//Команда на удаление списка кассиров
	
	Ресурсы.Вставить("СоздатьЗаказы", "orders");
	//Команда на сохранение списка заказов
	
	Ресурсы.Вставить("УдалитьЗаказы", "orders/delete");
	//Команда на удаление списка заказов
	
	Ресурсы.Вставить("Оплата", "orders/report");
	//Команда на получение отчета по оплате
	
	Ресурсы.Вставить("СоздатьОрганизации", "organizations");
	//Команда на сохранение списка организаций.
	
	Ресурсы.Вставить("УдалитьОрганизации", "organizations/delete");
	//Команда на удаление списка организаций.
	
	Ресурсы.Вставить("Маршрут", "schedule");
	//Команда на сохранение расписания
	
	Ресурсы.Вставить("УдалитьМаршрут", "schedule/delete");
	//Команда на удаление расписания
	
	Ресурсы.Вставить("УдалитьОрганизации", "organizations/delete");
	
	Ресурсы.Вставить("ЗаблокироватьЗаказы", "orders/lock");
	//Команда заблокировать заказы
	
	Ресурсы.Вставить("РазблокироватьЗаказы", "orders/unlock");
	//Команда разблокировать заказы
	
	Возврат Ресурсы;
	
КонецФункции

Функция ВыполнитьЗапрос(Ресурс, ТекстЗапроса, ИмяЗапроса = "", тРез = "") Экспорт
	
	//тестовый сервер магпей "https://pay2.k.dev.magdv.com"
	//тестовый токен camelot-1c-0123456789
	//боевой сервер магпей "https://pay2.magonline.ru"     
	//боевой токен gab5933MrtVHDyVHXWMK9g5ttZqSqx32Vzd6UxvvMWrqN63uY5xBhzBcWyJ9C74U

	ИспользоватьWinHTTP = Ложь;
	Ресурс = "/api/v2/" + Ресурс;
	СерверМП = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("СерверМагпей");
	
	ЗаписьЖурналаРегистрации("ИМ.MagPay.HTTPОтправка", УровеньЖурналаРегистрации.Информация, , , Ресурс + Символы.ПС + ТекстЗапроса);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("x-access-token", ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("АпиКлючMagPay"));
	ЗаголовокHTTP.Вставить("Content-Charset", "utf-8");
	
	Если ИспользоватьWinHTTP Тогда
	
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		WinHttp.Open("POST", СерверМП + Ресурс);
		Для Каждого КлючЗначение Из ЗаголовокHTTP Цикл
			WinHttp.SetRequestHeader(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;

		Попытка
			WinHttp.Send(ТекстЗапроса);//ФайлОтправки);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	
		тРез = WinHttp.ResponseText();
		СтатусВыполненияЗапроса = WinHttp.Status;
		
	Иначе
		
		HTTPОтвет = Неопределено;
		Таймаут = 0;

		HTTPЗапрос 	= Новый HTTPЗапрос();
		HTTPЗапрос.АдресРесурса = Ресурс;
		HTTPЗапрос.Заголовки = ЗаголовокHTTP; 
		HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, "CESU-8");
		
		ИспользоватьSSL = Ложь;
		Если Лев(НРег(СерверМП), 5) = "https" Тогда
			ИспользоватьSSL = Истина; 
			СерверМП = СтрЗаменить(НРег(СерверМП), "https://", "");
		Иначе
			СерверМП = СтрЗаменить(НРег(СерверМП), "http://", "");
		КонецЕсли;
		
		Прокси = Новый ИнтернетПрокси;
	
		Если ИспользоватьSSL Тогда
			ssl = Новый ЗащищенноеСоединениеOpenSSL;
			СоединениеССайтом = Новый HTTPСоединение(СерверМП, , , ,Прокси,Таймаут,ssl);
		Иначе
			СоединениеССайтом = Новый HTTPСоединение(СерверМП, , , ,Прокси,Таймаут);
		КонецЕсли;
		
		Попытка
			HTTPОтвет = СоединениеССайтом.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение  
			ПредставлениеОшибки = "Текст JSON: " + Символы.ПС + тРез + Символы.ПС + "Текст ошибки: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщенияЖР = "ВыполнитьЗапрос." + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + ПредставлениеОшибки;
			ОбщегоНазначения.ЗаписатьОшибкуВЖурналРегистрации("ИМ.АРМДанныеОплаты", ТекстСообщенияЖР); 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Неопределено;
		КонецПопытки;
		
		Если HTTPОтвет = Неопределено Тогда
			ПредставлениеОшибки = "Текст JSON: " + Символы.ПС + тРез + Символы.ПС + "Текст ошибки: Получен http ответ - Неопределено";
			ТекстСообщенияЖР = "ВыполнитьЗапрос." + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + ПредставлениеОшибки;
			ОбщегоНазначения.ЗаписатьОшибкуВЖурналРегистрации("ИМ.АРМДанныеОплаты", ТекстСообщенияЖР); 
			Возврат Неопределено;
		КонецЕсли;
		
		СтатусВыполненияЗапроса = HTTPОтвет.КодСостояния;
		
		тРез = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Если тРез = Неопределено Тогда	
			ПутьКФайлу = HTTPОтвет.ПолучитьИмяФайлаТела();
			ТекстовыйФайл = Новый ТекстовыйДокумент;
			ТекстовыйФайл.Прочитать(ПутьКФайлу,КодировкаТекста.UTF8);
			тРез = ТекстовыйФайл.ПолучитьТекст();
			Файл = Новый Файл(ПутьКФайлу);
			Если Файл.Существует() Тогда
				УдалитьФайлы(ПутьКФайлу);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не СтатусВыполненияЗапроса = 200 Тогда
		ПредставлениеОшибки = ПолучитьПредставлениеОшибки(тРез);
		Если ПредставлениеОшибки = Неопределено Тогда
			ПредставлениеОшибки = тРез;
		КонецЕсли;
		ПредставлениеОшибки = "Текст JSON: " + Символы.ПС + тРез + Символы.ПС + "Текст ошибки: " + Символы.ПС + ПредставлениеОшибки;
		ТекстСообщенияЖР = "ВыполнитьЗапрос." + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + ПредставлениеОшибки;
		ОбщегоНазначения.ЗаписатьОшибкуВЖурналРегистрации("ИМ.АРМДанныеОплаты", ТекстСообщенияЖР); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ПредставлениеОшибки);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Если ИспользоватьWinHTTP Тогда
			Текст = новый ТекстовыйДокумент;
			Текст.УстановитьТекст(тРез);
			ИмяВФ = ПолучитьИмяВременногоФайла("txt"); 
			Текст.Записать(ИмяВФ, "iso-8859-1");
			Текст.Прочитать(ИмяВФ, КодировкаТекста.UTF8);
			тРез = Текст.ПолучитьТекст();
		КонецЕсли;
		Ответ = JSONСерверВызовСервера.ПрочитатьJSON82(тРез, Истина, Ложь, Ложь);
	Исключение
		ПредставлениеОшибки = "Текст JSON: " + Символы.ПС + тРез + Символы.ПС + "Текст ошибки: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщенияЖР = "ВыполнитьЗапрос." + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + ПредставлениеОшибки;
		ОбщегоНазначения.ЗаписатьОшибкуВЖурналРегистрации("ИМ.АРМДанныеОплаты", ТекстСообщенияЖР); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПредставлениеОшибки(СтрокаИсходная)
	Если ЭтоHTML(СтрокаИсходная) Тогда
		НачалоЗаголовка = Найти(НРег(СтрокаИсходная),"<title>");
		КонецЗаголовка = Найти(НРег(СтрокаИсходная),"</title>");
		Если НачалоЗаголовка > 0 И КонецЗаголовка > 0 Тогда
			НачалоЗаголовка = НачалоЗаголовка + 7;
			СтрокаОшибки = Сред(СтрокаИсходная, НачалоЗаголовка, КонецЗаголовка - НачалоЗаголовка);
			Если Лев(СтрокаОшибки, 3) = "503" Тогда //исключаем этот спам
				Возврат Неопределено;
			КонецЕсли;
			Возврат Сред(СтрокаИсходная, НачалоЗаголовка, КонецЗаголовка - НачалоЗаголовка);
		Иначе
			Возврат СтрокаИсходная;
		КонецЕсли;
	Иначе
		Возврат СтрокаИсходная;
	КонецЕсли;
КонецФункции

Функция ЭтоHTML(ИсходнаяСтрока)
	Возврат Найти(НРег(ИсходнаяСтрока), "<html>")>0 И Найти(НРег(ИсходнаяСтрока), "</html>")>0;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦены)
	
	Цена = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ТекДата,
	               |			Номенклатура = &Номенклатура
	               |				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции


//*** УДАЛИТЬ ***

М = Новый Массив; М.Добавить("a.anikin@magdv.com");
