Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование",		ЭтотОбъект.Метаданные().Имя);
	РегистрационныеДанные.Вставить("Информация",		ЭтотОбъект.Метаданные().Имя);
	РегистрационныеДанные.Вставить("Версия",			ЭтотОбъект.Метаданные().Комментарий);
	РегистрационныеДанные.Вставить("БезопасныйРежим",	Ложь);
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = ЭтотОбъект.Метаданные().Имя;
	строкаКоманды.Представление = ЭтотОбъект.Метаданные().Синоним;
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции