
&НаСервере
Перем мХранилищеДополнительнойИнформации;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	Если Параметры.Свойство("ДополнительнаяОбработкаСсылка") Тогда
		Объект.ДополнительнаяОбработкаСсылка = Параметры.ДополнительнаяОбработкаСсылка;
	КонецЕсли;
	
	ВосстановитьСписокПечатныхФормНаСервере();
	
	УстановитьДоступностьСпискаПечатныхФорм();
	
	Элементы.Отладка.Видимость = РольДоступна("ПолныеПрава");
	
	ТекстОтбораДляЗП     =	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщику.Контрагент Как Поставщик,
	|	ЗаказПоставщику.Склад Как Магазин
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику";			  
	
	
	ИнициализироватьКНКД(НастройкиЗП , ТекстОтбораДляЗП);
	ИнициализироватьКНКД(НастройкиЗнП, "Выбрать Значение(Справочник.Склады.ПустаяСсылка) Как СкладОтправитель, Значение(Справочник.Склады.ПустаяСсылка) Как СкладПолучатель");
	
	//ИмяВнешнейКомпонентыПечати = "КартинкаШтрихкода";
	//ВнешняяКомпонентаШК = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКНКД(ПолеОтбора, ТекстЗапроса)
	
	Обработка 		= РеквизитФормыВЗначение("Объект");
	ТекстЗапроса 	= ТекстЗапроса;
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить(); 
	ИсточникДанных.Имя                = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя            = "НаборДанных";
	НаборДанных.ИсточникДанных = "ИсточникДанных";
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор);
	ИсточникНастроек 		   = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	ПолеОтбора.Инициализировать(ИсточникНастроек);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ЗНОКомандаИгнорироватьПометку1С.Пометка = Ложь;
	
	ПолучитьЗаголовокФормы();
	
	Принт =  Новый COMОбъект("WScript.Network");
	prn =  Принт.EnumPrinterConnections();
	i = 0;
	Пока i < prn.Count()-1 Цикл
		Элементы.ПринтерПоУмолчанию.СписокВыбора.Добавить(prn.Item(i+1));
		i = i + 2;
	КонецЦикла;
	
	
	Настройки = ПолучитьНастройкиПечатиПоУмолчаниюКлиент();
	Если Не Настройки = Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
	КонецЕсли; 
	
	ВидимостьНастроек = Истина;
	УправлениеВидимостью();
	
КонецПроцедуры

Функция ПолучитьНастройкиПечатиПоУмолчаниюКлиент()
	Возврат ПолучитьНастройкиПечатиПоУмолчанию();
КонецФункции

Функция ПолучитьНастройкиПечатиПоУмолчанию()
	
	
	ТЗ = "ВЫБРАТЬ
	|	ВариантыОтчетов.Наименование,
	|	ВариантыОтчетов.ХранилищеЗначений,
	|	ВариантыОтчетов.Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Наименование = &КлючВарианта
	|	И ВариантыОтчетов.Администратор = &Пользователь";
	
	Запрос = Новый Запрос(ТЗ);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("КлючВарианта", "НастройкиПечатиАРМОператораОтгрузки");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//ОписаниеНастроек.Представление = Выборка.Наименование;
		Настройки = Выборка.ХранилищеЗначений.Получить();
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			Настройки.Вставить("Ссылка", Выборка.Ссылка);
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Настройки;
	
КонецФункции

Процедура СохранитьНастройкиПечатиПоУмолчанию()
	
	СтруктураНастроек = Новый Структура("ПринтерПоУмолчанию, ВыводНаПринтер");
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтаФорма);
	
	Настройки = ПолучитьНастройкиПечатиПоУмолчанию();
	Если ТипЗнч(Настройки) = Тип("Структура") Тогда
		
		Если Настройки.ПринтерПоУмолчанию = ПринтерПоУмолчанию И Настройки.ВыводНаПринтер = ВыводНаПринтер Тогда
			Возврат;
		КонецЕсли;
		
		ВариантОбъект = Настройки.Ссылка.Получитьобъект();
		
	Иначе
		
		ВариантОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		ВариантОбъект.Наименование = "НастройкиПечатиАРМОператораОтгрузки";
		ВариантОбъект.КлючОбъекта  = "ВнешняяОбработка.АРМОператораОтгрузки";
		ВариантОбъект.Администратор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ВариантОбъект.ХранилищеЗначений = Новый ХранилищеЗначения(СтруктураНастроек, Новый СжатиеДанных());
	Попытка
		ВариантОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ

&НаКлиенте
Процедура НастройкаПечатиДокументПечатиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СпВыб = Элементы.НастройкаПечатиДокументПечатиИД.СписокВыбора;
	Элем = СпВыб.НайтиПоЗначению(ВыбранноеЗначение);
	
	ТекДанные = Элементы.НастройкаПечати.ТекущиеДанные;
	
	Если Элем<>Неопределено Тогда
		ТекДанные.ДокументПечати = Элем.Представление;
	КонецЕсли;	 
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура КомандаЗаполнитьЗНО(Команда)
	
	//ВремяНачала = ОценкаПроизВодительностиКлиентСервер.НачатьЗамерВремени();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		СтруктураЗНО = Новый Структура("ЗНО", ?(Не Элементы.ЗНО.ТекущиеДанные = Неопределено, 
		?(ТипЗнч(Элементы.ЗНО.ТекущиеДанные.ЗНО) = Тип("ДокументСсылка.ЗаказНаОтгрузку"), Элементы.ЗНО.ТекущиеДанные.ЗНО, Элементы.ЗНО.ТекущиеДанные.ПолучитьРодителя().ЗНО) 
		, Неопределено));
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			ИндексТекущейСтроки = Элементы.ЗНО.ТекущиеДанные.ПолучитьИдентификатор();//Элементы.ЗНО.ТекущаяСтрока;//ЗНО.ПолучитьЭлементы().Индекс(Элементы.ЗНО.ТекущиеДанные);
		КонецЕсли;
		Попытка
			УстановитьБезопасныйРежимСервер();
		Исключение
		КонецПопытки;
		//ЗаполнитьДеревоНаСервере();
		ОбновитьЗНО();
		ЗаполнитьДеревоНаСервере();
		
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			
			Для Каждого СтрокаЗНО Из ЗНО.ПолучитьЭлементы() Цикл
				Если СтрокаЗНО.ЗНО = СтруктураЗНО.ЗНО Тогда
					
					Элементы.ЗНО.ТекущаяСтрока = СтрокаЗНО.ПолучитьИдентификатор();//ИндексТекущейСтроки;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;  
		//СвернутьРазвернутьДерево();
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		ТаблицаКомплектация.Очистить();
		
		//ЗаполнитьОтборПоЗП();
		//ЗаполнитьОтборПоЗнП();
		ТаблицаКомплектация.Очистить();
		ПараметрыДанных = Новый Структура("ВидДвижения, ДатаОтгрузки, СкладТранзит", ВидДвиженияНакопления.Приход, ДатаОтгрузки, СкладТранзит);
		ВыполнитьЗапросСКД("ПолучениеДанныхКомплектацииЗП" , ПараметрыДанных, НастройкиЗП.Настройки.Отбор);
		ВыполнитьЗапросСКД("ПолучениеДанныхКомплектацииЗнП", ПараметрыДанных, НастройкиЗнП.Настройки.Отбор);
		
	КонецЕсли;
	
	//ОценкаПроизВодительностиКлиентСервер.ЗакончитьЗамерВремени(ПредопределенноеЗначение("Справочник.КлючевыеОперации.ОбновлениеСпискаМаршрутовВАрмОператораОтгрузки"), ВремяНачала);
	
КонецПроцедуры

Процедура ВыполнитьЗапросСКД(ИмяМакета, ПараметрыСКД, Знач Отбор);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ОСКД = Обработка.ПолучитьМакет(ИмяМакета);
	
	НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
	
	Для Каждого ЭлементОТбора Из НастройкиОСКД.Отбор.Элементы Цикл
		Для Каждого ЭлементНастройки Из Отбор.Элементы Цикл
			Если ЭлементОТбора.ЛевоеЗначение = ЭлементНастройки.ЛевоеЗначение Тогда
				ЗаполнитьЗначенияСвойств(ЭлементОТбора, ЭлементНастройки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//НастройкиОСКД = КомпоновщикНастроек.ПолучитьНастройкиОСКД();
	
	ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
	
	Для Каждого КлючЗначение Из ПараметрыСКД Цикл
		ПараметрДанных = ПараметрыДанныхОСКД.Найти(КлючЗначение.Ключ);
		ПараметрДанных.Использование = Истина;
		ПараметрДанных.Значение = КлючЗначение.Значение;
	КонецЦикла;
	
	
	
	
	//ПараметрДанных = ПараметрыДанныхОСКД.Найти("ВидДвижения");
	//ПараметрДанных.Использование = Истина;
	//ПараметрДанных.Значение = ВидДвиженияНакопления.Приход;
	//
	//ПараметрДанных = ПараметрыДанныхОСКД.Найти("ДатаОтгрузки");
	//ПараметрДанных.Использование = Истина;
	//ПараметрДанных.Значение = ДатаОтгрузки;
	//
	//ПараметрДанных = ПараметрыДанныхОСКД.Найти("СкладТранзит");
	//ПараметрДанных.Использование = Истина;
	//ПараметрДанных.Значение = СкладТранзит;
	
	КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаОСКД.УстановитьОбъект(ТЗ);
	ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
	
	Для Каждого Строка Из ТЗ Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКомплектация.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьОтборПоЗП()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Склад
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику";
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ИсточникНастроек = ИнициализироватьИсточникКНКД(СхемаКомпоновкиДанных, ТекстЗапроса);
	
	ЕстьАктивноеУсловие = Ложь;
	Для Каждого ЭлементОтбора Из НастройкиЗП.ПолучитьНастройки().Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование Тогда
			ЕстьАктивноеУсловие = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьАктивноеУсловие Тогда
		Возврат;
	КонецЕсли;	
	
	ОтборЗП.Загрузить(ВыполнитьЗапросВКНКД(ИсточникНастроек, НастройкиЗП.ПолучитьНастройки(), СхемаКомпоновкиДанных));
	
КонецПроцедуры

Процедура ВыполнитьСКД()
	
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	
	ВариантыНастроекКомпоновкиДанных = СхемаКомпоновкиДанных.ВариантыНастроек;
	ВариантыНастроекКомпоновкиДанных.Очистить();
	ВариантНастроекКомпоновкиДанных = ВариантыНастроекКомпоновкиДанных.Добавить();
	ВариантНастроекКомпоновкиДанных.Имя = "Основной";
	
	НастройкиКомпоновкиДанных = ВариантНастроекКомпоновкиДанных.Настройки;
	ВыбранныеПоляКомпоновкиДанных = НастройкиКомпоновкиДанных.Выбор;
	КоллекцияВыбранныхПолейКомпоновкиДанных = ВыбранныеПоляКомпоновкиДанных.Элементы;
	ВыбранноеПолеКомпоновкиДанных = КоллекцияВыбранныхПолейКомпоновкиДанных.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПолеКомпоновкиДанных.Поле = Новый ПолеКомпоновкиДанных("Заказ");
	ОтборКомпоновкиДанных = НастройкиЗП.Настройки.Отбор;//НастройкиКомпоновкиДанных.Отбор;
	КоллекцияЭлементовОтбораКомпоновкиДанных = ОтборКомпоновкиДанных.Элементы;
	ЭлементОтбораКомпоновкиДанных = КоллекцияЭлементовОтбораКомпоновкиДанных.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораКомпоновкиДанных.Использование = Ложь;
	ЭлементОтбораКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказ.Контрагент");
	ЭлементОтбораКомпоновкиДанных = КоллекцияЭлементовОтбораКомпоновкиДанных.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбораКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Заказ.Склад");
	КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных = НастройкиКомпоновкиДанных.Структура;
	ГруппировкаКомпоновкиДанных = КоллекцияЭлементовСтруктурыНастроекКомпоновкиДанных.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранныеПоляКомпоновкиДанных = ГруппировкаКомпоновкиДанных.Выбор;
	КоллекцияВыбранныхПолейКомпоновкиДанных = ВыбранныеПоляКомпоновкиДанных.Элементы;
	КоллекцияВыбранныхПолейКомпоновкиДанных.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ПорядокКомпоновкиДанных = ГруппировкаКомпоновкиДанных.Порядок;
	КоллекцияЭлементовПорядкаКомпоновкиДанных = ПорядокКомпоновкиДанных.Элементы;
	КоллекцияЭлементовПорядкаКомпоновкиДанных.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	ВариантНастроекКомпоновкиДанных.Представление = "Основной";
	ИсточникиДанныхСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.ИсточникиДанных;
	ИсточникДанныхСхемыКомпоновкиДанных = ИсточникиДанныхСхемыКомпоновкиДанных.Добавить();
	ИсточникДанныхСхемыКомпоновкиДанных.Имя = "ИсточникДанных1";
	ИсточникДанныхСхемыКомпоновкиДанных.ТипИсточникаДанных = "Local";
	НаборыДанныхСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.НаборыДанных;
	НаборДанныхЗапросСхемыКомпоновкиДанных = НаборыДанныхСхемыКомпоновкиДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	
	НаборДанныхЗапросСхемыКомпоновкиДанных.Запрос = "ВЫБРАТЬ
	|ОрганизацияДоставкиПоЗаказам.Регистратор Как Заказ
	|ИЗ
	|РегистрНакопления.ОрганизацияДоставкиПоЗаказам КАК ОрганизацияДоставкиПоЗаказам
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ПО ОрганизацияДоставкиПоЗаказам.Регистратор  =  ЗаказПоставщику.Ссылка
	|ГДЕ
	|ОрганизацияДоставкиПоЗаказам.ВидДвижения  =  &ВидДвижения
	|И ОрганизацияДоставкиПоЗаказам.СкладОтправитель  =  &СкладОтправитель
	|И ЗаказПоставщику.ЖелаемаяДатаПоступления  =  &ДатаОтгрузки";
	
	НаборДанныхЗапросСхемыКомпоновкиДанных.Имя = "НаборДанных1";
	НаборДанныхЗапросСхемыКомпоновкиДанных.ИсточникДанных = "ИсточникДанных1";
	ПоляНабораДанныхСхемыКомпоновкиДанных = НаборДанныхЗапросСхемыКомпоновкиДанных.Поля;
	ПолеНабораДанныхСхемыКомпоновкиДанных = ПоляНабораДанныхСхемыКомпоновкиДанных.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанныхСхемыКомпоновкиДанных.Поле = "Заказ";
	ПолеНабораДанныхСхемыКомпоновкиДанных.ПутьКДанным = "Заказ";
	РольПоляНабораДанныхКомпоновкиДанных = ПолеНабораДанныхСхемыКомпоновкиДанных.Роль;
	РольПоляНабораДанныхКомпоновкиДанных.НомерПериода = 1;
	ПараметрыСхемыКомпоновкиДанных = СхемаКомпоновкиДанных.Параметры;
	ПараметрСхемыКомпоновкиДанных = ПараметрыСхемыКомпоновкиДанных.Добавить();
	ПараметрСхемыКомпоновкиДанных.Заголовок = "Вид движения";
	ПараметрСхемыКомпоновкиДанных.Значение = ВидДвиженияНакопления.Приход;
	ПараметрСхемыКомпоновкиДанных.Имя = "ВидДвижения";
	ПараметрСхемыКомпоновкиДанных.ОграничениеИспользования = Истина;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ВидДвиженияНакопления"));
	ПараметрСхемыКомпоновкиДанных.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
	ПараметрСхемыКомпоновкиДанных = ПараметрыСхемыКомпоновкиДанных.Добавить();
	ПараметрСхемыКомпоновкиДанных.Заголовок = "Дата отгрузки";
	ПараметрСхемыКомпоновкиДанных.Значение = Дата(1,1,1,0,0,0);
	ПараметрСхемыКомпоновкиДанных.Имя = "ДатаОтгрузки";
	ПараметрСхемыКомпоновкиДанных.ОграничениеИспользования = Истина;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ПараметрСхемыКомпоновкиДанных.ТипЗначения = Новый ОписаниеТипов(МассивТипов,,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	ПараметрСхемыКомпоновкиДанных = ПараметрыСхемыКомпоновкиДанных.Добавить();
	ПараметрСхемыКомпоновкиДанных.Заголовок = "Склад отправитель";
	ПараметрСхемыКомпоновкиДанных.Имя = "СкладОтправитель";
	ПараметрСхемыКомпоновкиДанных.ОграничениеИспользования = Истина;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Склады"));
	ПараметрСхемыКомпоновкиДанных.ТипЗначения=Новый ОписаниеТипов(МассивТипов);
КонецПроцедуры


&НаСервере
Функция ИнициализироватьИсточникКНКД(СхемаКомпоновкиДанных, Запрос = "")
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить(); 
	ИсточникДанных.Имя                = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	//НаборДанных.Запрос 			= ПолучитьТекстЗапросаДляНастройкиКомпоновкиДанных(ПоЗаказам);
	НаборДанных.Запрос 			= Запрос;
	НаборДанных.Имя            	= "НаборДанных";
	НаборДанных.ИсточникДанных 	= "ИсточникДанных";
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных);
	ИсточникНастроек 		   = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	Возврат ИсточникНастроек;
	
КонецФункции

&НаСервере
Функция ВыполнитьЗапросВКНКД(ИсточникНастроек, НастройкиКомпоновкиДанных, СхемаКомпоновкиДанных)
	
	ТаблицаЗначениеРезультат = Новый ТаблицаЗначений;	
	
	КНКД = Новый КомпоновщикНастроекКомпоновкиДанных;
	КНКД.Инициализировать(ИсточникНастроек);
	КНКД.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	//
	ГруппировкаКНКД = КНКД.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаКНКД.Использование = Истина;
	
	Для Каждого Поле Из ГруппировкаКНКД.Выбор.ДоступныеПоляВыбора.Элементы Цикл
		Если Не Поле.Папка Тогда
			ДобавитьПолеВКНКД(ГруппировкаКНКД.Выбор.Элементы, Поле.Заголовок);//"Склад");
		КонецЕсли;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КНКД.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,,);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаЗначениеРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаЗначениеРезультат;
	
КонецФункции	

&НаСервере
Процедура ДобавитьПолеВКНКД(ВыбранныеЭлементы, Поле)
	
	Элемент = ВыбранныеЭлементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Элемент.Поле			= Новый ПолеКомпоновкиДанных(Поле);
	Элемент.Использование	= Истина;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуЗаказовККомплектации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацияДоставкиПоЗаказам.Регистратор КАК Заказ
	|ИЗ
	|	РегистрНакопления.ОрганизацияДоставкиПоЗаказам КАК ОрганизацияДоставкиПоЗаказам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ОрганизацияДоставкиПоЗаказам.Регистратор = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ОрганизацияДоставкиПоЗаказам.ВидДвижения = &ВидДвижения
	|	И ОрганизацияДоставкиПоЗаказам.СкладОтправитель = &СкладОтправитель
	|	И ЗаказКлиента.ЖелаемаяДатаОтгрузки = &ДатаОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацияДоставкиПоЗаказам.Регистратор
	|ИЗ
	|	РегистрНакопления.ОрганизацияДоставкиПоЗаказам КАК ОрганизацияДоставкиПоЗаказам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	|		ПО ОрганизацияДоставкиПоЗаказам.Регистратор = ЗаказНаПеремещение.Ссылка
	|ГДЕ
	|	ОрганизацияДоставкиПоЗаказам.ВидДвижения = &ВидДвижения
	|	И ОрганизацияДоставкиПоЗаказам.СкладОтправитель = &СкладОтправитель
	|	И ЗаказНаПеремещение.ЖелаемаяДатаПоступления = &ДатаОтгрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОрганизацияДоставкиПоЗаказам.Регистратор
	|ИЗ
	|	РегистрНакопления.ОрганизацияДоставкиПоЗаказам КАК ОрганизацияДоставкиПоЗаказам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ПО ОрганизацияДоставкиПоЗаказам.Регистратор = ЗаказПоставщику.Ссылка
	|ГДЕ
	|	ОрганизацияДоставкиПоЗаказам.ВидДвижения = &ВидДвижения
	|	И ОрганизацияДоставкиПоЗаказам.СкладОтправитель = &СкладОтправитель
	|	И ЗаказПоставщику.ЖелаемаяДатаПоступления = &ДатаОтгрузки";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладТранзит);
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаКомплектация.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

Процедура НайтиСтрокиПоДаннымФормыДерево(НайденнаяСтрока, КоллекцияЭлементов = Неопределено, СтруктураПоиска, ПрекратитьПоиск, ИскатьВПодчиненных = Ложь)
	Если КоллекцияЭлементов = Неопределено Тогда
		КоллекцияЭлементовДерева = ЗНО.ПолучитьЭлементы();
	КонецЕсли;
	Для Каждого СтрокаДерева ИЗ КоллекцияЭлементовДерева Цикл
		
		Если ПрекратитьПоиск Тогда
			Возврат;
		КонецЕсли;
		
		КлючСоответствует = Истина;
		Для Каждого Параметр Из СтруктураПоиска Цикл
			Если Не СтрокаДерева[Параметр.Ключ] = Параметр.Значение Тогда
				КлючСоответствует = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если КлючСоответствует Тогда
			
			НайденнаяСтрока = СтрокаДерева;
			
			ПрекратитьПоиск = Истина;
			
			Возврат;
			
		КонецЕсли;
		
		Если Не ИскатьВПодчиненных Тогда
			Продолжить;
		КонецЕсли;
		
		КоллекцияЭлементов = СтрокаДерева.ПолучитьЭлементы();
		
		Если КоллекцияЭлементов.Количество() > 0 Тогда
			
			НайтиСтрокиПоДаннымФормыДерево(НайденнаяСтрока, КоллекцияЭлементов, СтруктураПоиска, ПрекратитьПоиск, ИскатьВПодчиненных);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция УстановитьБезопасныйРежимСервер()
	Пока БезопасныйРежим() Цикл
		УстановитьБезопасныйРежим(Ложь);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		УстановитьФлажкиНаСервере(Истина);
		СвернутьРазвернутьДерево();
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		ПечататьВсе = Ложь;
		
		Ответ = Вопрос("Пометить напечатанные заказы?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПечататьВсе = Истина;
		КонецЕсли;
		
		
		Для Каждого Стр Из ТаблицаКомплектация Цикл
			Если Не Стр.Напечатан Или ПечататьВсе Тогда
				Стр.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьФлажки(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		УстановитьФлажкиНаСервере(Ложь);
		СвернутьРазвернутьДерево();
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		Для Каждого Стр Из ТаблицаКомплектация Цикл
			Стр.Пометка = Ложь;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкрытьНапечатанное(Команда)
	
	Элементы.ЗНОКомандаСкрытьНапечатанное.Пометка = НЕ Элементы.ЗНОКомандаСкрытьНапечатанное.Пометка;
	
	СвернутьРазвернутьДерево();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьОбщая(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		СтруктураЗНО = Новый Структура("ЗНО", ?(Не Элементы.ЗНО.ТекущиеДанные = Неопределено, 
			?(ТипЗнч(Элементы.ЗНО.ТекущиеДанные.ЗНО) = Тип("ДокументСсылка.ЗаказНаОтгрузку"), Элементы.ЗНО.ТекущиеДанные.ЗНО, Элементы.ЗНО.ТекущиеДанные.ПолучитьРодителя().ЗНО), 
			Неопределено));
			
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			ИндексТекущейСтроки = Элементы.ЗНО.ТекущиеДанные.ПолучитьИдентификатор();//Элементы.ЗНО.ТекущаяСтрока;//ЗНО.ПолучитьЭлементы().Индекс(Элементы.ЗНО.ТекущиеДанные);
		КонецЕсли;
		
		Сообщение = "";
		Если Отладка тогда
			Отказ = ЛОжь;
		ИНаче	
			Отказ = ПроверкаВозможностиПечати(Сообщение);
		КонецЕсли;	
		Если Отказ И Не Отладка Тогда
			Возврат;
		КонецЕсли;
		
		ПодготовитьСписокПечатныхФорм();
		
		Если СписокПечатныхФорм.ОтметитьЭлементы("Печатать") Тогда
			
			Если СписокПечатныхФорм.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			РазрешитьПечатьНапечатанных = Истина;
			Для Каждого ПФ Из СписокПечатныхФорм Цикл
				
				Если ПФ.Пометка И Не ПФ.Представление = "Документы на алкоголь" И Найти(ПФ.Представление, "Приложение для ветврача") = 0 И Не (ПФ.Представление = "Транспортная наклдная" Или ПФ.Представление = "Транспортная накладная") И Не Сообщение = "" Тогда
					Если Не Отладка Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,, "ЗНО[0]");
						Возврат;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			ДокументыКПечати = ПечатьНаСервере();
			//
			//Для Каждого Док Из ДокументыКПечати Цикл
			//	Если Док.ВысотаТаблицы>0   Тогда
			//		Если Не ВыводНаПринтер Тогда
			//			Док.Показать();
			//		Иначе
			//			Если ЗначениеЗаполнено(ПринтерПоУмолчанию) Тогда
			//				Док.ИмяПринтера = ПринтерПоУмолчанию;
			//			Иначе
			//				//Док.ИмяПринтера = ОбщегоНазначенияКлиент.ПолучитьПринтерПоУмолчанию();
			//			КонецЕсли;
			//			
			//			Док.Напечатать(Истина);
			//		КонецЕсли;
			//	КонецЕсли;	
			//	
			//КонецЦикла;	
			
		КонецЕсли;	
		
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			
			Для Каждого СтрокаЗНО Из ЗНО.ПолучитьЭлементы() Цикл
				Если СтрокаЗНО.ЗНО = СтруктураЗНО.ЗНО Тогда
					
					Элементы.ЗНО.ТекущаяСтрока = СтрокаЗНО.ПолучитьИдентификатор();//ИндексТекущейСтроки;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		Если ТаблицаКомплектация.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрано ни одного заказа!");
			Возврат;
		КонецЕсли;
		
		ТабДок = СформироватьПечатнуюФормуКомплектация();
		ДокументыКПечати = Новый Массив;
		ДокументыКПечати.Добавить(ТабДок);
		
	КонецЕсли;
	
	Если ДокументыКПечати = Неопределено Или ТипЗнч(ДокументыКПечати) = Тип("Массив") И ДокументыКПечати.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
		Возврат;
	КонецЕсли;
	
	Для Каждого Док Из ДокументыКПечати Цикл
		Если Док.ВысотаТаблицы>0   Тогда
			Док.ПолеСлева = 5;
			Док.ПолеСправа = 5;
			Док.Автомасштаб = Истина;
			Если Не ВыводНаПринтер Тогда
				Док.Показать();
			Иначе
				Если ЗначениеЗаполнено(ПринтерПоУмолчанию) Тогда
					Док.ИмяПринтера = ПринтерПоУмолчанию;
				Иначе
					//Док.ИмяПринтера = ОбщегоНазначенияКлиент.ПолучитьПринтерПоУмолчанию();
				КонецЕсли;
				
				Док.Напечатать(Истина);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		МассивЗаказов = Новый Массив;
		Заказы = ТаблицаКомплектация.НайтиСтроки(Новый Структура("Пометка", Истина));
		Для Каждого Стр Из Заказы Цикл
			МассивЗаказов.Добавить(Стр.Заказ);
		КонецЦикла;
		
		ЗаписатьДанныеОПечати(МассивЗаказов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура  ЗаписатьДанныеОПечати(Заказы)
	
	ДопКонстанты = ОбщегоНазначенияСерверПовтИсп.ПолучитьЗначениеДопКонстант();
	
	Для Каждого Заказ Из Заказы Цикл
		
		РС = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		РС.Объект = Заказ;
		РС.Свойство = ?(ДопКонстанты.Свойство("СвойствоНапечатан"), ДопКонстанты.СвойствоНапечатан, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Напечатан"));
		Если Не ЗначениеЗаполнено(РС.Свойство) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удается найти свойство напечатан! Данные о печати не будут добавлены!");
			Прервать;
		КонецЕсли;
		
		РС.Значение = Истина;
		
		Попытка
			РС.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьСписокПечатныхФорм(Команда)
	
	СохранитьСписокПечатныхФормНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокПечатныхФорм(Команда)
	
	НастройкаПечати.Очистить();
	ЗаполнитьСписокПечатныхФорм();
	//ВосстановитьСписокПечатныхФормНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

&НаСервере
Процедура УстановитьФлажкиНаСервере(состояние)
	ПолучимДерево = РеквизитФормыВЗначение("ЗНО");	
	Для Каждого запись из получимдерево.Строки Цикл
		//Если Состояние И (Не Запись.пАх Или Не Запись.п1С Или Запись.Напечатано) Тогда
		//	Продолжить;
		//КонецЕсли;
		//-
		//Если состояние И НЕ (запись.пАх И запись.п1С) Тогда
		//	
		//	запись.Пометка = НЕ состояние;
		//	Для Каждого запись1 из запись.Строки Цикл
		//		запись1.Пометка = НЕ состояние;		
		//	КонецЦикла;
		//	
		//Иначе	
		
		запись.Пометка=состояние;
		Для Каждого запись1 из запись.Строки Цикл
			запись1.Пометка = состояние;		
		КонецЦикла;
		//КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(получимдерево,"ЗНО");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоНаСервере()
	
	ТабРеестров = РеквизитФормыВЗначение("РО");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Документ",ТабРеестров.ВыгрузитьКолонку("РеестрОтгрузки"));
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ДопИдентификатор.Значение, """") КАК СТРОКА(50))) = """"
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК СкладWMS,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка КАК ЗаказНаОтгрузку,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль КАК Автомобиль,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Водитель КАК Водитель,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.ВремяВыезда КАК ДатаВыезда,
	               |	ЗаказНаОтгрузкуЗаказы.Заказ,
	               |	ЗаказНаОтгрузкуЗаказы.Перемещение,
	               |	ЗаказНаОтгрузкуЗаказы.Склад,
	               |	ЗаказНаОтгрузкуЗаказы.Получатель КАК Магазин,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено)
	               |				ИЛИ ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.ВОтгрузке)
	               |				ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ДопИдентификатор.Значение, """") КАК СТРОКА(50))) = """"
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК пАх,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Заказ.СкладОтправитель = &СкладыQP5
	               |					ТОГДА ИСТИНА
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Перемещение ССЫЛКА Документ.ПеремещениеТоваров
	               |						И ЗаказНаОтгрузкуЗаказы.Перемещение <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |						И (ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.ВОтгрузке)
	               |							ИЛИ ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено))
	               |						И (ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Погрузка)
	               |								И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Скомплектован)
	               |							ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отгружен)
	               |								И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Завершено)
	               |							ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |								И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Скомплектован)
	               |							ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |								И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Отменен))
	               |					ТОГДА ИСТИНА
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Перемещение ССЫЛКА Документ.РеализацияТоваровУслуг
	               |							И ЗаказНаОтгрузкуЗаказы.Перемещение <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |							И (ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.ВОтгрузке)
	               |								ИЛИ ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено))
	               |							И (ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Погрузка)
	               |									И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Скомплектован)
	               |								ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отгружен)
	               |									И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Завершено)
	               |								ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |									И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Скомплектован)
	               |								ИЛИ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |									И ЗаказНаОтгрузкуЗаказы.СтатусЗаказа = ЗНАЧЕНИЕ(Перечисление.СтатусыОтгружаемыхЗаказов.Отменен))
	               |						ИЛИ ВложенныйЗапрос.ОбобщенныйДокумент
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК п1С,
	               |	ДополнительныеСведенияШК.Значение КАК НомерМЛ,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДополнительныеСведенияШК.Значение, """") = """"
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Напечатано,
	               |	ВЫБОР
	               |		КОГДА НЕ ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик
	               |		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведенияПеревозчик.Значение КАК Справочник.Контрагенты).Наименование, """")
	               |	КОНЕЦ КАК Перевозчик,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Экспедитор КАК Экспедитор,
	               |	ЕСТЬNULL(ДополнительныеСведенияКоличествоПаллет.Значение, """") КАК КоличествоПалет,
	               |	ВЫРАЗИТЬ(ЗаказНаОтгрузкуЗаказы.Получатель.Наименование КАК СТРОКА(4)) КАК ПолучательПредставление,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Водитель2,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Отгружен,
	               |	ВложенныйЗапрос.ОбобщенныйДокумент
	               |ИЗ
	               |	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопИдентификатор
	               |		ПО ЗаказНаОтгрузкуЗаказы.Склад = ДопИдентификатор.Объект
	               |			И (ДопИдентификатор.Свойство.Наименование = ""ИдентификаторСинхронизации"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияШК
	               |		ПО (ДополнительныеСведенияШК.Свойство.Наименование = ""Штрихкод документа"")
	               |			И ЗаказНаОтгрузкуЗаказы.Перемещение = ДополнительныеСведенияШК.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияПеревозчик
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведенияПеревозчик.Объект КАК Справочник.ТранспортныеСредства)) = ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль)
	               |			И (ДополнительныеСведенияПеревозчик.Свойство.Наименование = ""Контрагент"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияКоличествоПаллет
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведенияКоличествоПаллет.Объект КАК Справочник.ТранспортныеСредства)) = ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль)
	               |			И (ДополнительныеСведенияКоличествоПаллет.Свойство.Наименование = ""КоличествоПалет"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказНаПеремещение.Ссылка КАК Заказ,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказНаПеремещениеТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ) КАК неОтменено,
	               |			ЛОЖЬ КАК ОбобщенныйДокумент
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	               |					ПО (ЗаказНаПеремещениеТовары.Ссылка = ЗаказНаПеремещение.Ссылка)
	               |						И (ЗаказНаПеремещениеТовары.Отменено = ЛОЖЬ)
	               |				ПО (ЗаказНаПеремещение.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В(&Документ)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказНаПеремещение.Ссылка
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЗаказКлиента.Ссылка,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказКлиентаТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ),
	               |			ЕСТЬNULL(ВЫРАЗИТЬ(КонтрагентыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |					ПО (ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка)
	               |						И (ЗаказКлиентаТовары.Отменено = ЛОЖЬ)
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	               |					ПО ЗаказКлиента.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
	               |						И (КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""ОбобщённыйДокумент"")
	               |				ПО (ЗаказКлиента.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В(&Документ)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказКлиента.Ссылка,
	               |			ЕСТЬNULL(ВЫРАЗИТЬ(КонтрагентыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЗаказПоставщику.Ссылка,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказПоставщикуТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ),
	               |			ЛОЖЬ
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |					ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	               |						И (ЗаказПоставщикуТовары.Отменено = ЛОЖЬ)
	               |				ПО (ЗаказПоставщику.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В(&Документ)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказПоставщику.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ЗаказНаОтгрузкуЗаказы.Заказ = ВложенныйЗапрос.Заказ
	               |ГДЕ
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеестрОтгрузкиЗаказыНаОтгрузку.ЗаказНаОтгрузку
	               |			ИЗ
	               |				Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |			ГДЕ
	               |				РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В (&Документ))
	               |	И НЕ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |	И ЕСТЬNULL(ВложенныйЗапрос.неОтменено, ЛОЖЬ) = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаВыезда,
	               |	ПолучательПредставление
	               |ИТОГИ
	               |	МАКСИМУМ(Автомобиль),
	               |	МАКСИМУМ(Водитель),
	               |	МАКСИМУМ(ДатаВыезда),
	               |	МИНИМУМ(пАх),
	               |	МИНИМУМ(п1С),
	               |	МАКСИМУМ(НомерМЛ),
	               |	МИНИМУМ(Напечатано),
	               |	МАКСИМУМ(Перевозчик),
	               |	МАКСИМУМ(Экспедитор),
	               |	МАКСИМУМ(КоличествоПалет),
	               |	МАКСИМУМ(Отгружен)
	               |ПО
	               |	ЗаказНаОтгрузку";
	
				   
	Запрос.УстановитьПараметр("СкладыQP5", Справочники.Склады.НайтиПоНаименованию("КроссДокинг QP5 О005 Омск"));
	Рез = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ЗНО");
	Дерево.Строки.Очистить();
	
	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЗаказНаОтгрузку");
	Пока Выб1.Следующий() Цикл
		
		Стр1 = Дерево.Строки.Добавить();
		Стр1.пАх = Выб1.пАх;
		Стр1.п1С = Выб1.п1С;
		Стр1.Отгружен = Выб1.Отгружен;
		Стр1.ЗНО = Выб1.ЗаказНаОтгрузку;
		Стр1.Автомобиль = Выб1.Автомобиль;
		Стр1.Водитель = Выб1.Водитель;
		Стр1.Водитель2 = Выб1.Водитель2;
		Стр1.ДатаВыезда = Выб1.ДатаВыезда;
		Стр1.Напечатано = Выб1.Напечатано;
		Стр1.Перевозчик = Выб1.Перевозчик;
		Стр1.Экспедитор = Выб1.Экспедитор;
		Стр1.КоличествоПалет = Выб1.КоличествоПалет;
		Стр1.НомерМЛ = Выб1.НомерМЛ;
		Стр1.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		//Стр1.НомерМЛ = Выб1.НомерМЛ;
		
		Выб2 = Выб1.Выбрать();
		Пока Выб2.Следующий() Цикл
			
			Стр2 = Стр1.Строки.Добавить();
			Стр2.пАх        = Выб2.пАх;
			Стр2.п1С        = Выб2.п1С;
			Стр2.ЗНО        = Выб2.Заказ;
			Стр2.Автомобиль = Выб2.Перемещение;
			Стр2.Водитель   = Выб2.Магазин;
			Стр2.ДатаВыезда = Выб2.Склад;
			Стр2.Уровень    = 1;
			Стр2.Напечатано = Выб2.Напечатано;
			Стр2.НомерМЛ	 = Выб2.НомерМЛ;
			Стр2.СкладWMS	 = Выб2.СкладWMS;
			Стр2.Перевозчик = Выб2.Перевозчик;
			Стр2.Экспедитор = Выб2.Экспедитор;
			Стр2.КоличествоПалет = Выб2.КоличествоПалет;
			Стр2.обобщенныйДокумент = Выб2.обобщенныйДокумент;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ЗНО");
	
КонецПроцедуры	

&НаКлиенте
Процедура СвернутьРазвернутьДерево()
	
	СкрытьНапечатанное = Элементы.ЗНОКомандаСкрытьНапечатанное.Пометка;
	
	Если НЕ СкрытьНапечатанное Тогда
		Возврат;
	КонецЕсли;	
	
	
	СтрокиДерева = ЗНО.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Напечатано Тогда
			Этаформа.Элементы.ЗНО.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
		Иначе
			Этаформа.Элементы.ЗНО.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаВозможностиПечати(Сообщение)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(ПринтерПоУмолчанию) И ВыводНаПринтер Тогда 
		Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Пометка = Ложь;
		УправлениеВидимостью();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не задан принтер!",, "ПринтерПоУмолчанию");
		//Сообщение = Сообщение + "Не задан принтер!";
		Отказ = Истина;
	КонецЕсли;
	
	ЕстьСтрокиКПечати = Ложь;
	
	КэшАдресовМагазинов = Новый Соответствие;
	
	СтрокиДерева = ЗНО.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		Если СтрокаДерева.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьСтрокиКПечати = Истина;
		
		//закомментировано до лучших времен
		//Если НЕ СтрокаДерева.пАх ИЛИ НЕ СтрокаДерева.п1С Тогда
		Если Ложь И (НЕ СтрокаДерева.пАх Или Не СтрокаДерева.п1С)  Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + СтрокаДерева.ЗНО + ", не завершился процесс погрузки!",, "ЗНО[0].Пометка");
			//Сообщение = Сообщение + ?(Не Сообщение = "", Символы.ПС, "") + "Документ " + СтрокаДерева.ЗНО + ", не завершился процесс погрузки!";
			Отказ = Истина;
		КонецЕсли;	
		
		//Если СтрокаДерева.Напечатано Тогда
		//	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + СтрокаДерева.ЗНО + ", документы на отгрузку уже были напечатаны!",, "ЗНО[0].Пометка");
		//	//Сообщение = Сообщение + ?(Не Сообщение = "", Символы.ПС, "") +  "Документ " + СтрокаДерева.ЗНО + ", документы на отгрузку уже были напечатаны!";
		//	//Отказ = Истина;
		//КонецЕсли;
		ВыбСклады = СтрокаДерева.ПолучитьЭлементы();
		Для Каждого ВыбСклад Из ВыбСклады Цикл
			
			Если Не ЗначениеЗаполнено(ВыбСклад.ДатаВыезда) Тогда
				Продолжить;
			КонецЕсли;
			
			Адрес = КэшАдресовМагазинов[ВыбСклад.ДатаВыезда];
			Если Адрес = Неопределено Тогда
				Адрес = ПолучитьАдресМагазина(ВыбСклад.ДатаВыезда);
				КэшАдресовМагазинов.Вставить(ВыбСклад.ДатаВыезда, Адрес);
			КонецЕсли;
			
			Если ПустаяСтрока(Адрес) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + СтрокаДерева.ЗНО + ", " + ВыбСклад.ДатаВыезда + " не заполнен адрес склада!");
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Если НЕ ЕстьСтрокиКПечати Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран заказ на отгрузку!",, "ЗНО[0].Пометка");
	КонецЕсли;	
	
	Возврат Отказ;
	
КонецФункции	

&НаСервере
Функция ПечатьНаСервере()
	
	ТабПФ = НастройкаПечати.Выгрузить();//НастройкаПечати.Выгрузить();//РеквизитФормыВЗначение("НастройкаПечати");
	
	ТабПФИтоговая = ТабПФ.Скопировать();
	ТабПФИтоговая.Очистить();
	
	Для Каждого СтрПФ Из ТабПФ Цикл
		Если СтрПФ.Количество > 0 Тогда
			Элем = СписокПечатныхФорм.НайтиПоЗначению(СтрПФ.ДокументПечатиИД);
			Если Элем<>Неопределено И Элем.Пометка Тогда
				Стр = ТабПФИтоговая.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,СтрПФ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	ТабПФИтоговая.Сортировать("Порядок");
	
	СтрокиМаршрутов = РеквизитФормыВЗначение("ЗНО");
	
	ДокументыКПечати = Новый Массив;
	
	ТаблицаВетВрача = Новый ТаблицаЗначений;
	ТаблицаВетВрача.Колонки.Добавить("ТД");
	ТаблицаВетВрача.Колонки.Добавить("Код");
	МассивЗНО = Новый Массив; //ЛВО  08.12.2020
	ИтоговыйТабДокТранспортнаяНакладная2020 = Новый ТабличныйДокумент;
	ИтоговыйТабДокТранспортнаяНакладная2022 = Новый ТабличныйДокумент;
	
	//КопияДерева = СтрокиМаршрутов.Скопировать();
	Если СортировкаПоВодителю тогда
		СтрокиМаршрутов.Строки.Сортировать("Водитель");
	КонецЕсли;
	
	
	Для Каждого СтрокаМарш Из СтрокиМаршрутов.Строки Цикл
		Если НЕ СтрокаМарш.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрПФ ИЗ ТабПФИтоговая Цикл
			
			ИмяМакета = СтрПФ.ДокументПечатиИД;
			
			Если ИмяМакета = "МаршрутныйЛист" Тогда
				
				Если НЕ СтрокаМарш.Напечатано Или Истина Тогда
					//МассивТД = Новый Массив;
					//МассивТД.Добавить(СформироватьПечатнуюФормуМаршрутногоЛиста(СтрокаМарш));
					//МассивТД.Добавить(СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту(СтрокаМарш));
					
					ТабДок = Новый Массив;
					ТабДок.Добавить(СформироватьПечатнуюФормуМаршрутногоЛиста(СтрокаМарш));
					//ТабДок.Добавить(СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту(СтрокаМарш));					
				Иначе
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли ИмяМакета = "ТОРГ13" Тогда
				
				ТабДок = ПолучитьГрупповоеПеремещение(СтрокаМарш);
				
			ИначеЕсли ВРЕГ(ИмяМакета) = "ТОРГ13ОПТ" Тогда
				
				ТабДок = ПолучитьГрупповоеПеремещениеОПТ(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ОбъединенныйМаршрутныйЛист" Тогда
				//+a.buganov@kdvm.ru 02.04.2018
				ТабДок = СформироватьПечатнуюФормуОбъединенныйМаршрутныйЛист(СтрокаМарш);
				//- 
			ИначеЕсли ИмяМакета = "ПФ_MXL_СправкаНаЭтиловыйСпирт" Тогда
				
				ТабДок = Новый Массив;
				ТабДок.Добавить(СформироватьПечатнуюФормуСправкаНаЭтиловыйСпирт(СтрокаМарш));
				//ТабДок.Добавить(СформироватьТТНЕГАИС(СтрокаМарш));
				//ТабДок = СформироватьПечатнуюФормуСправкаНаЭтиловыйСпирт(СтрокаМарш);
				//ТД = СформироватьТТНЕГАИС(СтрокаМарш);
				
				
				
			ИначеЕсли ИмяМакета = "ПриложениеКМаршрутномуЛисту" Тогда
				
				ТабДок = СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_ТТН" Тогда
				
				ТабДок = СформироватьПечатнуюФорму1_Т(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_ЗаказПоставщику" Тогда
				
				МассивОбъектов = Новый Массив;
				Для Каждого Заказы Из СтрокаМарш.Строки Цикл
					Если ТипЗНЧ(Заказы.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
						МассивОбъектов.Добавить(Заказы.ЗНО); 
					КонецЕсли;
				КонецЦикла;	
				
				Если Не МассивОбъектов.Количество() = 0 ТОгда
					ТабДок = СформироватьПечатнуюФормуЗаказПоставщику(МассивОбъектов);
				КонецЕсли;
				
				СохранитьДанныеОПечати(МассивОбъектов, "Заказ поставщику", СтрокаМарш.ЗНО, СтрПФ.Количество);
				
			ИначеЕсли ИмяМакета = "ТранспортнаяНакладная" Или ИмяМакета = "ТранспортнаяНакладнаяСПустымЭкспедитором" Или ИмяМакета = "ТранспортнаяНакладнаяСПустымПеревозчиком" Тогда
				
				//n.chernyshov печать новой формы
				//ТабДок = ПолучитьТранспортнуюНакладную(СтрокаМарш);
				//ТабДок = ПолучитьТранспортнуюНакладную2022(СтрокаМарш);
				//разное заполнение по перевозчикам
				
				ПараметрыФормированияТН = ПолучитьПараметрыФормированияТН();
				
				Если ИмяМакета = "ТранспортнаяНакладнаяСПустымЭкспедитором" Тогда
					ПараметрыФормированияТН.ОчиститьЭкспедитора = Истина;
				КонецЕсли;
				
				Если ИмяМакета = "ТранспортнаяНакладнаяСПустымПеревозчиком" Тогда
					ПараметрыФормированияТН.ОчиститьПеревозчика = Истина;
				КонецЕсли;

				ТабДок = ПолучитьТранспортнуюНакладную_01082023(СтрокаМарш, ПараметрыФормированияТН);
				
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ТабДок.КоличествоЭкземпляров = 1;
				Иначе	
					ТабДок.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;
				
				//ЛВО 8.12.2020 +
				//Если НЕ СтрокаМарш.ЗНО.Статус = Перечисления.СтатусыЗаказовНаОтгрузку.Отгружено Тогда
				//	Сообщить("" + СтрокаМарш.ЗНО + "находится в статусе " + СтрокаМарш.ЗНО.Статус + ". Формировать ВСД можно только для документво со статусом ОТГРУЖЕНО.");
				//Иначе
					МассивЗНО.Добавить(СтрокаМарш.ЗНО);
				//КонецЕсли;			
				//-
			ИначеЕсли ИмяМакета = "ТранспортнаяНакладная2020" Тогда
				
				ТабДок = Новый ТабличныйДокумент;
				ТабДокТранспортнаяНакладная2020 = ПолучитьТранспортнуюНакладную2020(СтрокаМарш);
				ИтоговыйТабДокТранспортнаяНакладная2020.Вывести(ТабДокТранспортнаяНакладная2020);
				ИтоговыйТабДокТранспортнаяНакладная2020.ВывестиГоризонтальныйРазделительСтраниц();
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ИтоговыйТабДокТранспортнаяНакладная2020.КоличествоЭкземпляров = 1;
				Иначе	
					ИтоговыйТабДокТранспортнаяНакладная2020.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;
				
			ИначеЕсли ИмяМакета = "ТранспортнаяНакладная2022" Тогда
				
				ТабДок = Новый ТабличныйДокумент;
				ТабДокТранспортнаяНакладная2022 = ПолучитьТранспортнуюНакладную2022(СтрокаМарш);
				ИтоговыйТабДокТранспортнаяНакладная2022.Вывести(ТабДокТранспортнаяНакладная2022);
				ИтоговыйТабДокТранспортнаяНакладная2022.ВывестиГоризонтальныйРазделительСтраниц();
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ИтоговыйТабДокТранспортнаяНакладная2022.КоличествоЭкземпляров = 1;
				Иначе	
					ИтоговыйТабДокТранспортнаяНакладная2022.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;

			ИначеЕсли ИмяМакета = "ПФ_MXL_НакладнаяНаПеремещение" Тогда
				
				ТабДок = ПолучитьНакладнуюНаПеремещение(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_ВнутренееПеремещение" Тогда
				
				ТабДок = СформироватьПечатнуюФормуПриложениеКВнутренемуПеремещению(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_ТОРГ12" Тогда
				
				МассивДокументов = Новый Массив;
				СтруктураПараметров = Новый Структура("Водитель, Автомобиль, ЗНО", СтрокаМарш.Водитель, СтрокаМарш.Автомобиль, СтрокаМарш.ЗНО);
				//ЛВО 31.07.2019 +
					ПечатьПоРеализации = Ложь;
					Если СтрокаМарш.Пометка = 1 тогда
						 ПечатьпоРеализации = Истина;
					 КонецЕсли;
					 СтруктураПараметров.Вставить("ПечатьПоРеализации",ПечатьПоРеализации);
				//-
				Для Каждого ТекСтр Из СтрокаМарш.Строки Цикл
					Если Не ЗначениеЗаполнено(ТекСтр.Автомобиль) И ТекСтр.Пометка = 1 И ТипЗнч(ТекСтр.ЗНО) = Тип("ДокументСсылка.ЗаказКлиента") И ТекСтр.ОбобщенныйДокумент Тогда
						
						МассивДокументов.Добавить(ТекСтр.ЗНО);

					ИначеЕсли Не ЗначениеЗаполнено(ТекСтр.Автомобиль) Или Не ТекСтр.Пометка = 1 Тогда
						Продолжить;
					КонецЕсли; 
					
					Если ТипЗнч(ТекСтр.Автомобиль) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						Продолжить;
					КонецЕсли; 
					МассивДокументов.Добавить(ТекСтр.Автомобиль);
				КонецЦикла; 
				
				ТабДокумент = СформироватьПечатнуюФормуТОРГ12(МассивДокументов, СтруктураПараметров);
				ТабДокумент.РазборПоКопиям = Истина;
				Если ТабДокумент.КоличествоЭкземпляров = 0 Тогда
					ТабДокумент.КоличествоЭкземпляров = СтрПФ.Количество;
				КонецЕсли;
				
				ДокументыКПечати.Добавить(ТабДокумент);
				
				Продолжить;
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_СчетФактура1137" Тогда
				
				МассивДокументов = Новый Массив;
				СтруктураПараметров = Новый Структура("Водитель, Автомобиль, ЗНО", СтрокаМарш.Водитель, СтрокаМарш.Автомобиль, СтрокаМарш.ЗНО);
				
				//ЛВО 31.07.2019 +
					ПечатьПоРеализации = Ложь;
					Если СтрокаМарш.Пометка = 1 тогда
						 ПечатьпоРеализации = Истина;
					 КонецЕсли;
					 СтруктураПараметров.Вставить("ПечатьПоРеализации",ПечатьПоРеализации);
				//-

				Для Каждого ТекСтр Из СтрокаМарш.Строки Цикл
					
					Если Не ЗначениеЗаполнено(ТекСтр.Автомобиль) И ТекСтр.Пометка = 1 И ТипЗнч(ТекСтр.ЗНО) = Тип("ДокументСсылка.ЗаказКлиента") И ТекСтр.ОбобщенныйДокумент Тогда
						
						МассивДокументов.Добавить(ТекСтр.ЗНО);

					ИначеЕсли Не ЗначениеЗаполнено(ТекСтр.Автомобиль) Или Не ТекСтр.Пометка = 1 Тогда
						Продолжить;
					КонецЕсли; 
					
					Если ТипЗнч(ТекСтр.Автомобиль) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						Продолжить;
					КонецЕсли; 
					МассивДокументов.Добавить(ТекСтр.Автомобиль);
				КонецЦикла; 
				
				ТабДокумент = СформироватьПечатнуюФормуСчетФактура(МассивДокументов, СтруктураПараметров);
				ТабДокумент.РазборПоКопиям = Истина;
				Если ТабДокумент.КоличествоЭкземпляров = 0 Тогда
					ТабДокумент.КоличествоЭкземпляров = СтрПФ.Количество;
				КонецЕсли;
				
				ДокументыКПечати.Добавить(ТабДокумент);
				
				Продолжить;
				
			ИначеЕсли ИмяМакета = "ПФ_MXL_ПриложениеДляВетВрача" Тогда
				
				ТипПечати = ?(СтрПФ.ДокументПечати = "Приложение для ветврача", "1", "2");
				ТабДок = СформироватьПечатнуюФормуПриложенияДляВетВрача(СтрокаМарш, СтрПФ.Количество, ТипПечати, ТаблицаВетВрача);
				Продолжить;
			ИначеЕсли ИмяМакета = "ТТНЕГАИС" Тогда
				
				ТабДок = СформироватьТТНЕГАИС(СтрокаМарш);
				
			ИначеЕсли ИмяМакета = "ЛистКомплектации" Тогда
				
				ТабДок = ПолучитьЛистКомплектации(СтрокаМарш, 0);
				
			ИначеЕсли ИмяМакета = "ОбъединенныйЛистКомплектации" Тогда
				
				ТабДок = ПолучитьЛистКомплектации(СтрокаМарш, 1);
				
			ИначеЕсли ИмяМакета = "ЛистКомплектацииМагазин" Тогда
				
				ТабДок = ПолучитьЛистКомплектации(СтрокаМарш, 2);
			ИначеЕсли  ИмяМакета = "КомплектДокументовЗаказпоставщикуНакладнаяНаПеремещение" Тогда
				
				СоответствиеСкладов = Новый Соответствие;
				Для Каждого Стр Из СтрокаМарш.Строки Цикл
					Если Не Стр.Пометка = 1 Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Стр.Водитель) И (ТипЗнч(Стр.ЗНО) = Тип("ДокументСсылка.ЗаказНаПеремещение") И ЗначениеЗаполнено(Стр.Автомобиль)) Или ТипЗнч(Стр.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику")
						Тогда
						
						МассивСтрок = СоответствиеСкладов.Получить(Стр.Водитель);
						Если МассивСтрок = Неопределено Тогда
							
							Массив = Новый Массив;
							Массив.Добавить(Стр);
							СоответствиеСкладов.Вставить(Стр.Водитель, Массив);
							
						Иначе
							
							МассивСтрок.Добавить(Стр);
							
						КонецЕсли;
					КонецЕсли;	
				КонецЦикла;
				
				МассивТД = Новый Массив;
				Для Каждого КлючЗначение Из СоответствиеСкладов Цикл
					
					//+Заказы поставщикам
					МассивОбъектов = Новый Массив;
					МассивПеремещений = Новый Массив;
					Для Каждого Заказы Из КлючЗначение.Значение Цикл
						Если ТипЗНЧ(Заказы.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
							
							МассивОбъектов.Добавить(Заказы.ЗНО); 
							
						ИначеЕсли ТипЗНЧ(Заказы.ЗНО) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
							
							Если Заказы.СкладWMS И НеПечататьЛистКомплектацииДляWMS Тогда
								Продолжить;
							КонецЕсли;
							
							МассивПеремещений.Добавить(Заказы.Автомобиль);
							
						 КонецЕсли;
						 
					КонецЦикла;	
					        
					Если Не МассивОбъектов.Количество() = 0 ТОгда
						ТабДок = СформироватьПечатнуюФормуЗаказПоставщику(МассивОбъектов, Неопределено, Истина, СтрокаМарш.Водитель);
						МассивТД.Добавить(ТабДок);
					КонецЕсли;
					
					Если Не МассивПеремещений.Количество() = 0 Тогда
						ТабДок = ПолучитьНакладнуюНаПеремещение(СтрокаМарш, МассивПеремещений, Истина);
						МассивТД.Добавить(ТабДок);
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого Т Из МассивТД Цикл
					Т.КоличествоЭкземпляров = 1;
				КонецЦикла;
				
				ТабДок = МассивТД;
				
			КонецЕсли;	
			
			
			Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
				МассивТД = Новый Массив;
				МассивТД.Добавить(ТабДок);
			ИначеЕсли ТипЗнч(ТабДок) = Тип("Массив") Тогда
				МассивТД = ТабДок;
			КонецЕсли;
			
			Для Каждого ТабДок Из МассивТД Цикл
				ТабДок.РазборПоКопиям = Истина;
				//Сообщить("" + ТабДок.КоличествоЭкземпляров);
				Если ТабДок.КоличествоЭкземпляров = 0 Тогда // ЛВО 16.10.2019
					ТабДок.КоличествоЭкземпляров = СтрПФ.Количество;
				КонецЕсли;
				//	Сообщить("" + ТабДок.КоличествоЭкземпляров + Символы.Пс + СтрПФ.Количество+ "***");
				ДокументыКПечати.Добавить(ТабДок);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если СортировкаПоВодителю тогда
		СтрокиМаршрутов.Строки.Сортировать("ДатаВыезда");
	КонецЕсли;
	
	
	Если ИтоговыйТабДокТранспортнаяНакладная2020.Области.Количество() > 0 тогда
		 ДокументыКПечати.Добавить(ИтоговыйТабДокТранспортнаяНакладная2020);
	КонецЕсли;
	 
	Если ИтоговыйТабДокТранспортнаяНакладная2022.Области.Количество() > 0 тогда
		 ДокументыКПечати.Добавить(ИтоговыйТабДокТранспортнаяНакладная2022);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(СтрокиМаршрутов,"ЗНО");
	
	ТаблицаВетВрача.Сортировать("Код");
	Для Каждого ТабДок Из ТаблицаВетВрача Цикл
		ДокументыКПечати.Добавить(ТабДок.ТД);
	КонецЦикла;
	
	// ЛВО 08.12.2020 +
	Если не РольДоступна("ПолныеПрава") и  МассивЗНО.Количество()>0 тогда
		МодульВетис = ВетисПовтИсп.ИнициализароватьПодключаемыйМодуль();
		МодульВетис.СформироватьЗаявкиПеремещениеПоЗНО(МассивЗНО);
	КонецЕсли;
	// +
	
	Возврат ДокументыКПечати;
	
КонецФункции	

&НаСервере
Процедура СохранитьСписокПечатныхФормНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Наименование,
	|	ХранилищеДополнительнойИнформации.Хранилище,
	|	ХранилищеДополнительнойИнформации.Дата КАК Дата,
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.ВидДанных = 18
	|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ХранОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ХранОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
	КонецЕсли;
	
	ТЗ = НастройкаПечати.Выгрузить();//НастройкаПечати.Выгрузить();//РеквизитФормыВЗначение("НастройкаПечати");
	
	ХранОбъект.Дата 			= ТекущаяДата();
	ХранОбъект.ВидДанных 		= 18; // отдельный вид для настоен
	ХранОбъект.Комментарий 	    = "Настройки печати маршрутов";
	ХранОбъект.Наименование 	= "Настройки печати маршрутов";
	ХранОбъект.Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
	ХранОбъект.Хранилище 		= Новый ХранилищеЗначения(ТЗ);
	ХранОбъект.Записать();
	
КонецПроцедуры	

&НаСервере
Процедура ВосстановитьСписокПечатныхФормНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Наименование,
	|	ХранилищеДополнительнойИнформации.Хранилище,
	|	ХранилищеДополнительнойИнформации.Дата КАК Дата,
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.ВидДанных = 18
	|	И ХранилищеДополнительнойИнформации.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ТЗ = Выборка.Хранилище.Получить();
		ЗначениеВРеквизитФормы(ТЗ,"НастройкаПечати");
		ЗаполнитьСписокПечатныхФорм();
	Иначе
		ЗаполнитьСписокПечатныхФорм();
	КонецЕсли;	
	
КонецПроцедуры	


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

&НаСервере
Функция ПолучитьПараметрыФормированияТН()
	
	ПараметрыФормированияТН = Новый Структура();
	ПараметрыФормированияТН.Вставить("ДляНалоговой", Ложь);
	ПараметрыФормированияТН.Вставить("ОчиститьЭкспедитора", Ложь);
	ПараметрыФормированияТН.Вставить("ОчиститьПеревозчика", Ложь);
	
	Возврат ПараметрыФормированияТН;
	
КонецФункции

&НаСервере
Процедура ПолучитьЗаголовокФормы()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	МетаданныеОбъекта = РеквизитОбъект.Метаданные();	
	ЭтаФорма.Заголовок = МетаданныеОбъекта.Синоним + " " + МетаданныеОбъекта.Комментарий;
	
конецпроцедуры

Функция ПолучитьМассивПФКомплектация()
	
	МассивПФ = Новый Массив;
	//МассивПФ.Добавить("");
	//МассивПФ.Добавить("");
	//МассивПФ.Добавить("");
	//МассивПФ.Добавить("");
	//МассивПФ.Добавить("");
	Возврат МассивПФ;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПечатныхФорм(ТекущаяСтраница = "")
	
	МассивПФКомплектация = ПолучитьМассивПФКомплектация();
	
	ТЗПФ = НастройкаПечати.Выгрузить();//РеквизитФормыВЗначение("НастройкаПечати");
	
	СписокПечатныхФорм.Очистить();
	
	СпВыб = Элементы.НастройкаПечатиДокументПечатиИД.СписокВыбора;
	СпВыб.Очистить();
	
	ПерезаполнятьТЗ = Истина;//(ТЗПФ.Количество()=0) Или Не ТекущаяСтраница = "";
	
	МДМакеты = РеквизитФормыВЗначение("Объект").Метаданные().Макеты;
	
	Для Каждого М Из МДМакеты Цикл
		
		Если ТекущаяСтраница = "ГруппаКомплектация" И МассивПФКомплектация.Найти(М.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если М.Имя = "ПФ_MXL_СправкаНаЭтиловыйСпиртИмпорт" Тогда
			Продолжить;
		КонецЕсли;
		
		Если М.Имя = "ПФ_MXL_СчетФактура981" Тогда
			Продолжить;
		КонецЕсли;
		
		Если М.Имя = "ЛистКомплектации" Тогда
			//Продолжить;
		КонецЕсли;
		
		Если М.Имя = "РеестрМаршрутныхЛистов" Тогда
			Продолжить;
		КонецЕсли;
		
		Если М.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.СхемаКомпоновкиДанных Тогда
			Продолжить;
		КонецЕсли;
		
		СпВыб.Добавить(М.Имя,М.Синоним);
		СписокПечатныхФорм.Добавить(М.Имя,М.Синоним);
		
		Если М.Имя = "ТранспортнаяНакладная" Тогда
			
			Имя = "ТранспортнаяНакладнаяСПустымЭкспедитором";
			Синоним = "Транспортная накладная (с пустым экспедитором)";
			
			СпВыб.Добавить(Имя, Синоним);
			СписокПечатныхФорм.Добавить(Имя, Синоним);
			
			Имя = "ТранспортнаяНакладнаяСПустымПеревозчиком";
			Синоним = "Транспортная накладная (с пустым перевозчиком)";
			
			СпВыб.Добавить(Имя, Синоним);
			СписокПечатныхФорм.Добавить(Имя, Синоним);
			
		КонецЕсли;
		
		Если ПерезаполнятьТЗ Тогда
			
			Стр = ТЗПФ.Добавить();
			Стр.ДокументПечатиИД = М.Имя;
			Стр.ДокументПечати = М.Синоним;
			
			Если М.Синоним = "Приложение для ветврача" Тогда
				Стр = ТЗПФ.Добавить();
				Стр.ДокументПечатиИД = М.Имя;
				Стр.ДокументПечати = М.Синоним + "(только корма)";
			КонецЕсли;
			
			Если М.Имя = "ТранспортнаяНакладная" Тогда
				
				Имя = "ТранспортнаяНакладнаяСПустымЭкспедитором";
				Синоним = "Транспортная накладная (с пустым экспедитором)";
				
				Стр = ТЗПФ.Добавить();
				Стр.ДокументПечатиИД = Имя;
				Стр.ДокументПечати   = Синоним;
				
				Имя = "ТранспортнаяНакладнаяСПустымПеревозчиком";
				Синоним = "Транспортная накладная (с пустым перевозчиком)";
				
				Стр = ТЗПФ.Добавить();
				Стр.ДокументПечатиИД = Имя;
				Стр.ДокументПечати   = Синоним;
				
			КонецЕсли;
			
		КонецЕсли;
		
		
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗПФ,"НастройкаПечати");
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступностьСпискаПечатныхФорм()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставГруппПользователей.ГруппаПользователей,
	|	СоставГруппПользователей.Пользователь
	|ИЗ
	|	РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
	|ГДЕ
	|	СоставГруппПользователей.Пользователь = &Пользователь
	|	И СоставГруппПользователей.ГруппаПользователей = &ГруппаПользователей";
	
	Запрос.УстановитьПараметр("ГруппаПользователей", Справочники.ГруппыПользователей.НайтиПоНаименованию("Администраторы"));
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		//	Элементы.НастройкаПечати.ТолькоПросмотр = Истина;
		//	Элементы.НастройкаПечатиКомандаСохранитьСписокПечатныхФорм.Доступность = Ложь;
		//Иначе	
		//	Элементы.НастройкаПечати.ТолькоПросмотр = Ложь;
		//	Элементы.НастройкаПечатиКомандаСохранитьСписокПечатныхФорм.Доступность = Истина;
	КонецЕсли; 
	
КонецПроцедуры	

&НаСервере
Процедура ПодготовитьСписокПечатныхФорм()
	
	ТЗПФ = НастройкаПечати.Выгрузить();//РеквизитФормыВЗначение("НастройкаПечати");
	ТЗПФ.Сортировать("Порядок");
	
	СписокПечатныхФорм.Очистить();
	
	Для Каждого СтрПФ Из ТЗПФ Цикл
		Если СтрПФ.Количество<>0 Тогда
			СписокПечатныхФорм.Добавить(СтрПФ.ДокументПечатиИД,СтрПФ.ДокументПечати, Истина);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ЗАПОЛНЕНИЯ ТАБЛИЧНЫХ ДОКУМЕНТОВ ПЕЧАТНЫХ ФОРМ

//печать МЛ
&НаСервере 
Функция СформироватьПечатнуюФормуМаршрутногоЛиста(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	//Попытка
	//	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	//Исключение
	//КонецПопытки;
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("МаршрутныйЛист");
	
	МассивОбъектов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		
		Если ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказКлиента") Или ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
			ЭтоАлкашка = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.ЗНО, "УчетВЕГАИС");
		Иначе
			ЭтоАлкашка = Ложь;
		КонецЕсли;
		
		Если (ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (МассивОбъектов.Найти(СтрЗаказ.Автомобиль) = Неопределено) и Не СтрЗаказ.Пометка = 0 Тогда
			//Если СтрЗаказ.СкладWMS = ЛОЖЬ И Не ЭтоАлкашка Тогда
			//	Продолжить;
			//КонецЕсли; 
			МассивОбъектов.Добавить(СтрЗаказ.Автомобиль);
		КонецЕсли;
		
		Если ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") И ЗначениеЗаполнено(СтрЗаказ.Водитель) И ТипЗнч(СтрЗаказ.Водитель) = Тип("СправочникСсылка.Склады") 
			И ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.Водитель, "ТипСклада") = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			МассивОбъектов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;
			
	КонецЦикла;	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_МаршрутныйЛист";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	МассивСкладов = Новый Массив;
	Для Каждого ТекДок из МассивОбъектов Цикл
		
		//Зарегистрировать документы Для обмена !!!!Более нет необходимости регистрировать!!!
		//МассивУзлов = ПолучитьМассивУзловДляДокумента(ТекДок);
		//Если МассивУзлов <> Неопределено Тогда
		//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекДок);
		//КонецЕсли;
		
		//Зарегистрировать коробки этого документа
		//ТекСпр = ПолучитьСправочникКоробок(ТекДок);
		//Если ТекСпр <> Неопределено Тогда
		//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекСпр);
		//КонецЕсли; 
		
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ИскомыйСклад = Неопределено Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ТекДок) = тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
			Если  ИскомыйСклад = Неопределено Тогда
				Если СкладКонтрагента <> Неопределено тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				Иначе
					МассивСкладов.Добавить(ТекДок.Контрагент);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			КонтрагентЗаказа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДок, "Контрагент");
			Если МассивСкладов.Найти(КонтрагентЗаказа) = Неопределено Тогда
				МассивСкладов.Добавить(КонтрагентЗаказа);
			КонецЕсли;
		КонецЕсли; 
		
		//Если уже записан так же Автомобиль и Водитель, не записывать
		Организация = ТекДок.Организация;
		ДатаДокумента = ТекДок.Дата;
		
		//Если ТекДок.Водитель = СтруктураПараметров.Водитель И ТекДок.Автомобиль = СтруктураПараметров.Автомобиль Тогда
		//	Продолжить;
		//КонецЕсли; 
		//ДокументОбъект = ТекДок.ПолучитьОбъект();
		//ДокументОбъект.Автомобиль = СтруктураПараметров.Автомобиль;
		//ДокументОбъект.Водитель = СтруктураПараметров.Водитель;
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивОбъектов, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаМаршрута.ЗНО, "Номер"));
	//ШтрихкодНакладной = СоздатьШтрихкодНакладной(МассивОбъектов);
	//Если ШтрихкодНакладной = Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать прервана! Маршрутный лист уже был напечатан!");
	//	Возврат ТабДокумент;
	//КонецЕсли; 
	
	ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДатаДокумента);
	
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первый из ЗНО
	Если Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказНаОтгрузкуЗаказы.Склад) КАК Склад
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Рез = Запрос.Выполнить().Выбрать();
		Рез.Следующий();
		Если ЗначениеЗаполнено(Рез.Склад) Тогда
			СкладОтправитель = Рез.Склад;
		КонецЕсли;
	Иначе
		
		КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
		Если КодУзла = "000" Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
		Иначе
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
		КонецЕсли;
		
	КонецЕсли;
	
	АдресГрузоОтправителя =УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
	//АдресГрузоОтправителя = ПолучитьАдресМагазина(СкладОтправитель);
	
	ОбластьМакета.Параметры.Организация					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
	ОбластьМакета.Параметры.ШтрихкодМаршрутногоЛиста	= Лев(ШтрихкодНакладной, 11);
	ОбластьМакета.Параметры.ШтрихкодДокумента			= ШтрихкодНакладной;
	ОбластьМакета.Параметры.ДатаПечати					= СтрокаМаршрута.ЗНО.ВремяВыезда;//, "ДЛФ=D");
	ОбластьМакета.Параметры.ФИОВодителя					= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель)  
	+ ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), " / " + Символы.ПС + ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
	ОбластьМакета.Параметры.ТелефонВодителя				= УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
	
	ОбластьМакета.Параметры.ГосНомерТС					= СтрокаМаршрута.Автомобиль.Код;
	ОбластьМакета.Параметры.Грузоотправильетль			= АдресГрузоОтправителя;
	//ЗаполнитьШтрихКодОбласть(ОбластьМакета, ШтрихкодНакладной);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	НПП = 1;
	Для Каждого ТекСтр Из МассивСкладов Цикл
		// ЛВО 19.09.2019 +
		Если ТипЗнч(ТекСтр) = Тип("СправочникСсылка.Контрагенты") тогда
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		Иначе
			ВидКИ = Справочники.ВидыКонтактнойИнформации.ТелефонСклада;
		КонецЕсли;
		//-
		
		ОбластьМакета.Параметры.Склад = "" + ТекСтр + 
		//";" + УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ТекСтр, Справочники.ВидыКонтактнойИнформации.АдресСклада) + 
		";" + УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ТекСтр,ВидКИ); // Справочники.ВидыКонтактнойИнформации.ТелефонСклада);  ЛВО
		ОбластьМакета.Параметры.НПП = НПП;
		НПП = НПП + 1;
		СтруктураОтвет = ПолучитьИнформациюОМагазине(ТекСтр);
		ОбластьМакета.Параметры.РежимРаботыГрузчиков = СтруктураОтвет.РежимРаботыГрузчиков;
		ОбластьМакета.Параметры.ТипРазгрузки = СтруктураОтвет.ТипРазгрузки;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.КоличествоЭкземпляров = МассивСкладов.Количество() + 1;
	
	//Если Константы.ЗаголовокСистемы.Получить()="ООО «Камелот – А» [Новосибирск РЦ]" Тогда
	//	ТабДокумент.КоличествоЭкземпляров = МассивСкладов.Количество();
	//Иначе 	
	//   ТабДокумент.КоличествоЭкземпляров = МассивСкладов.Количество() + 1;
	//КонецЕсли;
   
	//Зарегистрировать документы Для отправки на кассу
	//Для Каждого ТекДок Из МассивОбъектов Цикл
	//	МассивУзлов = ПолучитьМассивУзловДляДокумента(ТекДок);
	//	Если МассивУзлов <> Неопределено Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекДок);
	//	КонецЕсли;
	//	
	//	//Зарегистрировать коробки этого документа
	//	ТекСпр = ПолучитьСправочникКоробок(ТекДок);
	//	Если ТекСпр <> Неопределено Тогда
	//		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекСпр);
	//	КонецЕсли; 
	//КонецЦикла; 
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	//СтруктураПараметров = Новый Структура("Водитель, Автомобиль, Статус, УдаленныйШтрихкод",СтрокаМаршрута.Водитель, СтрокаМаршрута.Автомобиль, 1, ШтрихкодНакладной);
	//СохранитьДанныеОПечати(СтруктураПараметров);
	
	СохранитьДанныеОПечати(МассивОбъектов, "Маршрутный лист", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);	
		
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьПечатнуюФормуОбъединенныйМаршрутныйЛист(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	//Попытка
	//	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	//Исключение
	//КонецПопытки;
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ОбъединенныйМаршрутныйЛист");
	
	МассивОбъектов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		
		Если Не СтрЗаказ.Пометка Тогда 
			Продолжить; 
		КонецЕсли;
		
		Если ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			МассивОбъектов.Добавить(СтрЗаказ.ЗНО);
		Иначе
			
			ЭтоАлкашка = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.ЗНО, "УчетВЕГАИС");
			Если (ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
				И (МассивОбъектов.Найти(СтрЗаказ.Автомобиль) = Неопределено) и Не СтрЗаказ.Пометка = 0 Тогда
				//Если СтрЗаказ.СкладWMS = ЛОЖЬ И Не ЭтоАлкашка Тогда
				//	Продолжить;
				//КонецЕсли; 
				МассивОбъектов.Добавить(СтрЗаказ.Автомобиль);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_МаршрутныйЛист";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.КоличествоЭкземпляров = 1;
	
	МассивСкладов = Новый Массив;
	Для Каждого ТекДок из МассивОбъектов Цикл
		
		ЭтоЗаказПоставщику = ТипЗнч(ТекДок) = тип("ДокументСсылка.ЗаказПоставщику");
		
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ИскомыйСклад = Неопределено Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ТекДок) = тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
			Если  ИскомыйСклад = Неопределено Тогда
				МассивСкладов.Добавить(СкладКонтрагента);
			КонецЕсли; 
		ИначеЕсли ЭтоЗаказПоставщику Тогда
			МассивСкладов.Добавить(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекДок, "Склад"));
		КонецЕсли; 
		
		//Если уже записан так же Автомобиль и Водитель, не записывать
		Организация = ТекДок.Организация;
		ДатаДокумента = ТекДок.Дата;
		
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивОбъектов, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаМаршрута.ЗНО, "Номер"));
	//ШтрихкодНакладной = СоздатьШтрихкодНакладной(МассивОбъектов);
	//Если ШтрихкодНакладной = Неопределено Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать прервана! Маршрутный лист уже был напечатан!");
	//	Возврат ТабДокумент;
	//КонецЕсли; 
	
	ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы   = Макет.ПолучитьОбласть("ШапкаТаблицы");
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Организация, ДатаДокумента);
	КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
	Если ЭтоЗаказПоставщику Тогда
		РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДок, "Контрагент, Склад");
		СкладОтправитель = ПолучитьСкладТранзит(Новый Структура("Отправитель, СкладПолучатель", РеквизитыЗаказа.Контрагент, РеквизитыЗаказа.Склад));
		
		Если СкладОтправитель = Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан склад транзит для связки" + Символы.ПС 
			+ "Контрагент:" + " " + РеквизитыЗаказа.Контрагент
			+ "Склад:"		+ " " + РеквизитыЗаказа.Склад);
			Возврат ТабДокумент 
		КонецЕсли;
		
	ИначеЕсли КодУзла = "000" Тогда
		СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
	Иначе
		СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
	КонецЕсли; 
	АдресГрузоОтправителя = ПолучитьАдресМагазина(СкладОтправитель);
	
	Водитель											= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель)  
	+ ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), " / " + Символы.ПС + ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
	ОбластьМакета.Параметры.Водитель					= Водитель;	
	
	ДатаНомерЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Дата, Номер");
	
	ОбластьМакета.Параметры.ДатаЗНО						= ДатаНомерЗНО.Дата;
	ОбластьМакета.Параметры.НомерЗНО					= ДатаНомерЗНО.Номер;
	//ОбластьМакета.Параметры.ГосНомерТС					= СтрокаМаршрута.Автомобиль.Код;
	//ОбластьМакета.Параметры.Грузоотправильетль			= АдресГрузоОтправителя;
	//ЗаполнитьШтрихКодОбласть(ОбластьМакета, ШтрихкодНакладной);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Дерево = РеквизитФормыВЗначение("ЗНО");
	
	ОбластьМакетаГруппировкаМагазина = Макет.ПолучитьОбласть("ГруппировкаМагазин");
	ОбластьМакетаСтрока				 = Макет.ПолучитьОбласть("ДанныеСтрока");
	НПП = 1;
	ВсегоВес   = 0;
	ВсегоОбъем = 0;
	ВсегоСумма = 0;
	МассивСкладовРазличные = Новый Массив;
	ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(МассивСкладовРазличные, МассивСкладов);
	
	Для Каждого ТекСтр Из МассивСкладовРазличные Цикл
		
		КодМагазина = СтрПолучитьСтроку(СтрЗаменить(Строка(ТекСтр), " ", Символы.ПС), 1);
		ОбластьМакетаГруппировкаМагазина.Параметры.КодМагазина   = КодМагазина;
		ОбластьМакетаГруппировкаМагазина.Параметры.АдресМагазина = СтрЗаменить(Строка(ТекСтр), КодМагазина + " " , "");//УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ТекСтр, Справочники.ВидыКонтактнойИнформации.АдресСклада);//СтрЗаменить(Строка(ТекСтр), КодМагазина + " ", "");
		
		Если Не ТабДокумент.ПроверитьВывод(ОбластьМакетаГруппировкаМагазина) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапкаТаблицы);
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакетаГруппировкаМагазина);
		
		Заказы = Дерево.Строки.НайтиСтроки(Новый Структура("Водитель, Пометка", ТекСтр, 1), Истина);
		
		Для Каждого СтрокаЗаказ Из Заказы Цикл
			Если ТипЗнч(СтрокаЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаЗаказ.ЗНО, "Номер, Контрагент, СуммаДокумента");
				ОбластьМакетаСтрока.Параметры.НомерДокумента = ДанныеЗаказа.Номер;
				ОбластьМакетаСтрока.Параметры.СкладПоставщик = ДанныеЗаказа.Контрагент;
				ОбластьМакетаСтрока.Параметры.Сумма = ДанныеЗаказа.СуммаДокумента;
				Сумма = ДанныеЗаказа.СуммаДокумента;
			ИначеЕсли ТипЗнч(СтрокаЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаЗаказ.ЗНО, "Номер, СкладОтправитель");
				ОбластьМакетаСтрока.Параметры.НомерДокумента = ДанныеЗаказа.Номер;
				ОбластьМакетаСтрока.Параметры.СкладПоставщик = ДанныеЗаказа.СкладОтправитель;
				Сумма = 0;
			КонецЕсли;
			
			ВесОбъем = ОбработкаТабличнойЧастиСервер.ПолучитьВесИОбъемТоваровВУпаковкеWMSПоДокументу(СтрокаЗаказ.ЗНО);
			ОбластьМакетаСтрока.Параметры.Вес   = Окр(ВесОбъем.Вес);
			ОбластьМакетаСтрока.Параметры.Объем = ВесОбъем.Объем;
			ВсегоВес   = ВсегоВес   + ВесОбъем.Вес;
			ВсегоОбъем = ВсегоОбъем + ВесОбъем.Объем;
			ВсегоСумма = ВсегоСумма + Сумма;
			Если Не ТабДокумент.ПроверитьВывод(ОбластьМакетаСтрока) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапкаТаблицы);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаСтрока);	
		КонецЦикла;
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	ОбластьМакета.Параметры.ВесИтого   = Окр(ВсегоВес);
	ОбластьМакета.Параметры.ОбъемИтого = ВсегоОбъем;
	ОбластьМакета.Параметры.СуммаИтого = ВсегоСумма;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ТабДокумент.Вывести(ОбластьМакета);
	
	//ТабДокумент.КоличествоЭкземпляров = МассивСкладов.Количество() + 1;
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	//
	//СтруктураПараметров = Новый Структура("Водитель, Автомобиль, Статус, УдаленныйШтрихкод",СтрокаМаршрута.Водитель, СтрокаМаршрута.Автомобиль, 1, ШтрихкодНакладной);
	//СохранитьДанныеОПечати(мХранилищеДополнительнойИнформации, СтруктураПараметров);
	
	СохранитьДанныеОПечати(МассивОбъектов, "Объединенный маршрутный лист", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);		
		
	Возврат ТабДокумент;
	
	
КонецФункции

Функция ПолучитьСкладТранзит(ПараметрыТранзит);
	
	Отправитель 	= ПараметрыТранзит.Отправитель; 
	СкладПолучатель = ПараметрыТранзит.СкладПолучатель;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	?(ТипЗнч(Отправитель) = Тип("СправочникСсылка.Контрагенты"),
	"ВЫБРАТЬ
	|	СоответствиеТранзитныхСкладов.СкладТранзит
	|ИЗ
	|	РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Таблица
	|		ПО СоответствиеТранзитныхСкладов.Отправитель = Таблица.Ссылка
	|ГДЕ
	|	СоответствиеТранзитныхСкладов.Отправитель = &Отправитель
	|	И СоответствиеТранзитныхСкладов.СкладПолучатель = &СкладПолучатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоответствиеТранзитныхСкладов.СкладТранзит
	|ИЗ
	|	РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Таблица
	|		ПО СоответствиеТранзитныхСкладов.Отправитель = Таблица.Ссылка
	|ГДЕ
	|	СоответствиеТранзитныхСкладов.Отправитель = &Отправитель
	|	И СоответствиеТранзитныхСкладов.СкладПолучатель = ВЫРАЗИТЬ(&СкладПолучатель КАК Справочник.Склады).Родитель"
	, 
	"ВЫБРАТЬ		
	|	СоответствиеТранзитныхСкладов.СкладТранзит
	|ИЗ
	|	РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Таблица
	|		ПО СоответствиеТранзитныхСкладов.Отправитель = Таблица.Ссылка
	|ГДЕ
	|	СоответствиеТранзитныхСкладов.Отправитель = &Отправитель
	|	И СоответствиеТранзитныхСкладов.СкладПолучатель = &СкладПолучатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоответствиеТранзитныхСкладов.СкладТранзит
	|ИЗ
	|	РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Таблица
	|		ПО СоответствиеТранзитныхСкладов.Отправитель = Таблица.Ссылка
	|ГДЕ
	|	СоответствиеТранзитныхСкладов.Отправитель = ВЫРАЗИТЬ(&Отправитель КАК Справочник.Склады).Родитель
	|	И СоответствиеТранзитныхСкладов.СкладПолучатель = &СкладПолучатель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоответствиеТранзитныхСкладов.СкладТранзит
	|ИЗ
	|	РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Таблица
	|		ПО СоответствиеТранзитныхСкладов.Отправитель = Таблица.Ссылка
	|ГДЕ
	|	СоответствиеТранзитныхСкладов.Отправитель = &Отправитель
	|	И СоответствиеТранзитныхСкладов.СкладПолучатель = ВЫРАЗИТЬ(&СкладПолучатель КАК Справочник.Склады).Родитель");
	
	Запрос.УстановитьПараметр("Отправитель"	   , Отправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СкладТранзит;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьЛистКомплектации(СтрокаМаршрута, РежимПечати)
	
	
	ВремяВыполнения = "";
	ВремяВыполнения = "Старт:" + " " + ТекущаяДата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Если РежимПечати = 0 Тогда
		Макет = Обработка.ПолучитьМакет("ЛистКомплектации");
	ИначеЕсли РежимПечати = 1 Тогда
		Макет = Обработка.ПолучитьМакет("ОбъединенныйЛистКомплектации");
	ИначеЕсли РежимПечати = 2 Тогда
		Макет = Обработка.ПолучитьМакет("ЛистКомплектацииМагазин");
	КонецЕсли;
	
	Водитель   = СокрЛП(СтрокаМаршрута.Водитель);
	Автомобиль = СокрЛП(СтрокаМаршрута.Автомобиль);
	
	СписокЗаказов = Новый Массив;
	Строки = СтрокаМаршрута.Строки.НайтиСтроки(Новый Структура("Пометка", 1));
	Для Каждого Строка Из Строки Цикл
		
		Если Строка.СкладWMS И НеПечататьЛистКомплектацииДляWMS Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.Автомобиль) Тогда
			СписокЗаказов.Добавить(Строка.ЗНО);
		Иначе
			СписокЗаказов.Добавить(Строка.Автомобиль);
		КонецЕсли;
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_МаршрутныйЛист";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ВремяВыполнения = ВремяВыполнения + Символы.ПС + "Формирование списка заказов. Начало:" + " " + ТекущаяДата();
	Н = ТекущаяДата();
	//СписокЗаказов = Новый Массив;
	//Заказы = СтрокаМаршрута.Строки.НайтиСтроки(Новый Структура("Пометка", 1));
	//Для Каждого СтрокаЗаказ Из Заказы Цикл
	//	СписокЗаказов.Добавить(СтрокаЗаказ.Заказ);
	//КонецЦикла;
	
	К = ТекущаяДата();
	ВремяВыполнения = ВремяВыполнения + Символы.ПС + "Формирование списка заказов. Конец:" + " " + ТекущаяДата() + " " + "/" + " " + (ТекущаяДата() - Н);
	
	
	Запрос = Новый Запрос;
	Если РежимПечати = 0 Или РежимПечати = 2 Тогда
		
		ТабЧ = Новый ТаблицаЗначений;
		ТабЧ.Колонки.Добавить("Ч", Новый ОписаниеТипов("Число"));
		ТабЧ.Колонки.Добавить("Стр", Новый ОписаниеТипов("Строка"), Новый КвалификаторыСтроки(4));
		ЗаполнитьЗначенияСвойств(ТабЧ.Добавить(), Новый Структура("Ч, Стр", 0, ""));
		ЗаполнитьЗначенияСвойств(ТабЧ.Добавить(), Новый Структура("Ч, Стр", 0, null));
		ЗаполнитьЗначенияСвойств(ТабЧ.Добавить(), Новый Структура("Ч, Стр", 0, Неопределено));
		Для Сч = 1 По 9999 Цикл
			ЗаполнитьЗначенияСвойств(ТабЧ.Добавить(), Новый Структура("Ч, Стр", Сч, Строка(Сч)));
		КонецЦикла;
		Запрос.УстановитьПараметр("ТабЧ", ТабЧ);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабЧ.Ч,
		|	ТабЧ.Стр
		|ПОМЕСТИТЬ ТабЧ
		|ИЗ
		|	&ТабЧ КАК ТабЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад,
		|	МАКСИМУМ(РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка) КАК Ячейка,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК ОсновнаяЯчейка
		|ПОМЕСТИТЬ Ячейки
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказТовары.Ссылка.Склад КАК Магазин,
		|	ТИПЗНАЧЕНИЯ(ЗаказТовары.Ссылка) КАК ТипДокумента,
		|	ЗаказТовары.Ссылка.Контрагент КАК ПоставщикСклад,
		|	ЗаказТовары.НомерСтроки КАК НПП,
		|	ЗаказТовары.Номенклатура.Артикул КАК Артикул,
		|	ЗаказТовары.Номенклатура.Наименование КАК Наименование,
		|	ЗаказТовары.Количество КАК КоличествоШтук,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0) КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА ЗаказТовары.Количество
		|		ИНАЧЕ ЗаказТовары.Количество - (ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	ЗаказТовары.Ссылка КАК Заказ,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.ОсновнаяЯчейка), ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.Ячейка), """")) КАК Ячейка,
		|	ЕСТЬNULL(ТабЧ.Ч, 0) КАК ОсновнаяЯчейка
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказПоставщику.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|	ГДЕ
		|		ЗаказПоставщику.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|		ПО (КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Комплектация не требуется"")
		|			И ВложенныйЗапрос.Ссылка.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|			ПО ЗаказТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
		|				И (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|			ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
		|				ЛЕВОЕ СОЕДИНЕНИЕ ТабЧ КАК ТабЧ
		|				ПО ((ВЫРАЗИТЬ(ЕСТЬNULL(Ячейки.ОсновнаяЯчейка.Наименование, Ячейки.Ячейка.Наименование) КАК СТРОКА(4))) = (ВЫРАЗИТЬ(ТабЧ.Стр КАК СТРОКА(4))))
		|			ПО ЗаказТовары.Номенклатура = Ячейки.Номенклатура
		|				И ЗаказТовары.Ссылка.Склад = Ячейки.Склад
		|		ПО ВложенныйЗапрос.Ссылка = ЗаказТовары.Ссылка
		|ГДЕ
		|	ЗаказТовары.Отменено = ЛОЖЬ
		|	И ЕСТЬNULL(КонтрагентыДополнительныеРеквизиты.Значение, ЛОЖЬ) = ЛОЖЬ
		|{ГДЕ
		|	ЗаказТовары.Ссылка.Склад.*,
		|	ЗаказТовары.Ссылка.Контрагент.*}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказТовары.Ссылка.СкладПолучатель,
		|	ТИПЗНАЧЕНИЯ(ЗаказТовары.Ссылка),
		|	ЗаказТовары.Ссылка.СкладОтправитель,
		|	ЗаказТовары.НомерСтроки,
		|	ЗаказТовары.Номенклатура.Артикул,
		|	ЗаказТовары.Номенклатура.Наименование,
		|	ЗаказТовары.Количество,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0),
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА ЗаказТовары.Количество
		|		ИНАЧЕ ЗаказТовары.Количество - (ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ,
		|	ЗаказТовары.Ссылка,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.ОсновнаяЯчейка), ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.Ячейка), """")),
		|	ЕСТЬNULL(ТабЧ.Ч, 0)
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|			И ЗаказТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказНаПеремещение.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|		ГДЕ
		|			ЗаказНаПеремещение.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ЗаказТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЧ КАК ТабЧ
		|			ПО ((ВЫРАЗИТЬ(ЕСТЬNULL(Ячейки.ОсновнаяЯчейка.Наименование, Ячейки.Ячейка.Наименование) КАК СТРОКА(4))) = (ВЫРАЗИТЬ(ТабЧ.Стр КАК СТРОКА(4))))
		|		ПО ЗаказТовары.Номенклатура = Ячейки.Номенклатура
		|			И ЗаказТовары.Ссылка.СкладОтправитель = Ячейки.Склад
		|ГДЕ
		|	ЗаказТовары.Отменено = ЛОЖЬ
		|{ГДЕ
		|	ЗаказТовары.Ссылка.СкладОтправитель.*,
		|	ЗаказТовары.Ссылка.СкладПолучатель.*}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка.Контрагент,
		|	ТИПЗНАЧЕНИЯ(ЗаказКлиентаТовары.Ссылка),
		|	ЗаказКлиентаТовары.Ссылка.Склад,
		|	ЗаказКлиентаТовары.НомерСтроки,
		|	ЗаказКлиентаТовары.Номенклатура.Артикул,
		|	ЗаказКлиентаТовары.Номенклатура.Наименование,
		|	ЗаказКлиентаТовары.Количество,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0),
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказКлиентаТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА ЗаказКлиентаТовары.Количество
		|		ИНАЧЕ ЗаказКлиентаТовары.Количество - (ВЫРАЗИТЬ(ЗаказКлиентаТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ,
		|	ЗаказКлиентаТовары.Ссылка,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.ОсновнаяЯчейка), ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.Ячейка), """")),
		|	ЕСТЬNULL(ТабЧ.Ч, 0)
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|			И ЗаказКлиентаТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказКлиента.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ГДЕ
		|			ЗаказКлиента.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ЗаказКлиентаТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЧ КАК ТабЧ
		|			ПО ((ВЫРАЗИТЬ(ЕСТЬNULL(Ячейки.ОсновнаяЯчейка.Наименование, Ячейки.Ячейка.Наименование) КАК СТРОКА(4))) = (ВЫРАЗИТЬ(ТабЧ.Стр КАК СТРОКА(4))))
		|		ПО ЗаказКлиентаТовары.Номенклатура = Ячейки.Номенклатура
		|			И ЗаказКлиентаТовары.Ссылка.Склад = Ячейки.Склад
		|ГДЕ
		|	ЗаказКлиентаТовары.Отменено = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка.Контрагент,
		|	ТИПЗНАЧЕНИЯ(РеализацияТоваровУслугТовары.Ссылка),
		|	РеализацияТоваровУслугТовары.Ссылка.Склад,
		|	РеализацияТоваровУслугТовары.НомерСтроки,
		|	РеализацияТоваровУслугТовары.Номенклатура.Артикул,
		|	РеализацияТоваровУслугТовары.Номенклатура.Наименование,
		|	РеализацияТоваровУслугТовары.Количество,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0),
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА РеализацияТоваровУслугТовары.Количество
		|		ИНАЧЕ РеализацияТоваровУслугТовары.Количество - (ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ,
		|	ВложенныйЗапрос.Ссылка.ЗаказКлиента,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.ОсновнаяЯчейка), ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.Ячейка), """")),
		|	ЕСТЬNULL(ТабЧ.Ч, 0)
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|			И РеализацияТоваровУслугТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЧ КАК ТабЧ
		|			ПО ((ВЫРАЗИТЬ(ЕСТЬNULL(Ячейки.ОсновнаяЯчейка.Наименование, Ячейки.Ячейка.Наименование) КАК СТРОКА(4))) = (ВЫРАЗИТЬ(ТабЧ.Стр КАК СТРОКА(4))))
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = Ячейки.Номенклатура
		|			И РеализацияТоваровУслугТовары.Ссылка.Склад = Ячейки.Склад
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка.СкладПолучатель,
		|	ТИПЗНАЧЕНИЯ(ПеремещениеТоваровТовары.Ссылка),
		|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		|	ПеремещениеТоваровТовары.НомерСтроки,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Количество,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0),
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА ПеремещениеТоваровТовары.Количество
		|		ИНАЧЕ ПеремещениеТоваровТовары.Количество - (ВЫРАЗИТЬ(ПеремещениеТоваровТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ,
		|	ВложенныйЗапрос.Ссылка.ЗаказНаПеремещение,
		|	ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.ОсновнаяЯчейка), ЕСТЬNULL(ПРЕДСТАВЛЕНИЕ(Ячейки.Ячейка), """")),
		|	ЕСТЬNULL(ТабЧ.Ч, 0)
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|			И ПеремещениеТоваровТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПеремещениеТоваров.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ГДЕ
		|			ПеремещениеТоваров.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ПеремещениеТоваровТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Ячейки КАК Ячейки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТабЧ КАК ТабЧ
		|			ПО ((ВЫРАЗИТЬ(ЕСТЬNULL(Ячейки.ОсновнаяЯчейка.Наименование, Ячейки.Ячейка.Наименование) КАК СТРОКА(4))) = (ВЫРАЗИТЬ(ТабЧ.Стр КАК СТРОКА(4))))
		|		ПО ПеремещениеТоваровТовары.Номенклатура = Ячейки.Номенклатура
		|			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель = Ячейки.Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	Магазин,
		|	ОсновнаяЯчейка,
		|	Наименование
		|ИТОГИ
		|	МАКСИМУМ(ПоставщикСклад)
		|ПО
		|	Магазин,
		|	Заказ";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказТовары.Номенклатура.Артикул КАК Артикул,
		|	ЗаказТовары.Номенклатура.Наименование КАК Наименование,
		|	ЗаказТовары.Количество КАК КоличествоШтук,
		|	ЗаказТовары.Номенклатура
		|ПОМЕСТИТЬ Строки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказПоставщику.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|	ГДЕ
		|		ЗаказПоставщику.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказТовары
		|		ПО ВложенныйЗапрос.Ссылка = ЗаказТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|		ПО (КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""Комплектация не требуется"")
		|			И ВложенныйЗапрос.Ссылка.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
		|ГДЕ
		|	ЗаказТовары.Отменено = ЛОЖЬ
		|	И ЕСТЬNULL(КонтрагентыДополнительныеРеквизиты.Значение, ЛОЖЬ) = ЛОЖЬ
		|{ГДЕ
		|	ЗаказТовары.Ссылка.Склад.*,
		|	ЗаказТовары.Ссылка.Контрагент.*}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказТовары.Номенклатура.Артикул,
		|	ЗаказТовары.Номенклатура.Наименование,
		|	ЗаказТовары.Количество,
		|	ЗаказТовары.Номенклатура
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказНаПеремещение.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|		ГДЕ
		|			ЗаказНаПеремещение.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ЗаказТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	ЗаказТовары.Отменено = ЛОЖЬ
		|{ГДЕ
		|	ЗаказТовары.Ссылка.СкладОтправитель.*,
		|	ЗаказТовары.Ссылка.СкладПолучатель.*}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура.Артикул,
		|	ЗаказКлиентаТовары.Номенклатура.Наименование,
		|	ЗаказКлиентаТовары.Количество,
		|	ЗаказКлиентаТовары.Номенклатура
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗаказКлиента.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ГДЕ
		|			ЗаказКлиента.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ЗаказКлиентаТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Отменено = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура.Артикул,
		|	РеализацияТоваровУслугТовары.Номенклатура.Наименование,
		|	РеализацияТоваровУслугТовары.Количество,
		|	РеализацияТоваровУслугТовары.Номенклатура
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ГДЕ
		|			РеализацияТоваровУслуг.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО РеализацияТоваровУслугТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Количество,
		|	ПеремещениеТоваровТовары.Номенклатура
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПеремещениеТоваров.Ссылка КАК Ссылка
		|		ИЗ
		|			Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ГДЕ
		|			ПеремещениеТоваров.Ссылка В(&СписокЗаказов)) КАК ВложенныйЗапрос
		|		ПО ПеремещениеТоваровТовары.Ссылка = ВложенныйЗапрос.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Строки.Артикул,
		|	Строки.Наименование,
		|	СУММА(Строки.КоличествоШтук) КАК КоличествоШтук,
		|	Строки.Номенклатура
		|ПОМЕСТИТЬ СгруппированныеДанные
		|ИЗ
		|	Строки КАК Строки
		|
		|СГРУППИРОВАТЬ ПО
		|	Строки.Номенклатура,
		|	Строки.Наименование,
		|	Строки.Артикул
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СгруппированныеДанные.Артикул,
		|	СгруппированныеДанные.Наименование КАК Наименование,
		|	СгруппированныеДанные.КоличествоШтук,
		|	СгруппированныеДанные.Номенклатура,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ(СгруппированныеДанные.КоличествоШтук / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
		|	КОНЕЦ КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
		|			ТОГДА СгруппированныеДанные.КоличествоШтук
		|		ИНАЧЕ СгруппированныеДанные.КоличествоШтук - (ВЫРАЗИТЬ(СгруппированныеДанные.КоличествоШтук / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
		|	КОНЕЦ КАК Количество,
		|	0 КАК Поле1,
		|	0 КАК Поле2,
		|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0) КАК Коэффициент
		|ИЗ
		|	СгруппированныеДанные КАК СгруппированныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|		ПО СгруппированныеДанные.Номенклатура = УпаковкиНоменклатуры.Владелец
		|			И (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование
		|ИТОГИ ПО
		|	Поле1,
		|	Поле2";
		
	КонецЕсли;
	//Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	
	Результат = Запрос.Выполнить();
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Время выполнения Запроса:" + " " + (ТекущаяДата() - К);
	К = ТекущаяДата();
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Начало формирования ТД:" + " " + ТекущаяДата();
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	Попытка
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	Исключение
	КонецПопытки;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	Попытка
		ПараметрыЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Номер, Водитель, Автомобиль");
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ПараметрыЗНО);
	Исключение
	КонецПопытки;
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	ВыборкаПолучатель = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НПП = 0;
	ПерваяИтерация = Истина;
	Пока ВыборкаПолучатель.Следующий() Цикл
		
		Если Не ПерваяИтерация И РежимПечати = 2 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапка);
		Иначе
			ПерваяИтерация = Ложь;
		КонецЕсли;
		
		Если РежимПечати = 0 Или РежимПечати = 2 Тогда
			Область = Макет.ПолучитьОбласть("СтрокаМагазин");
			ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПолучатель);
			ТабДокумент.Вывести(Область);
		КонецЕсли;
		ВыборкаЗаказ = ВыборкаПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			Если РежимПечати = 0 Тогда
				Область = Макет.ПолучитьОбласть("СтрокаДокумент");
				Область.Параметры.ТипДокумента   = ВыборкаЗаказ.Заказ;
				Область.Параметры.ПоставщикСклад = ВыборкаЗаказ.ПоставщикСклад;
				
				Если Не ТабДокумент.ПроверитьВывод(Область) И РежимПечати = 2 Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьШапкаТаблицы);
				КонецЕсли;
				
				ТабДокумент.Вывести(Область);
			КонецЕсли;
			ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				//+a.buganov@kdvm.ru 16.04.2018
				//************** ИЗМЕНИТЬ ФЛАГ, КОГДА ПОНАДОБИТСЯ ИСПОЛЬЗОВАНИЕ УПАКОВОК ВМС
				ИспользоватьУпаковкиВМС = Ложь;
				//- 
				
				Если Не ИспользоватьУпаковкиВМС Тогда
					
					КоличествоУпаковок = 0;
					Количество		   = ВыборкаДетальныеЗаписи.КоличествоШтук;
					
				Иначе
					
					КоличествоУпаковок = ?(ВыборкаДетальныеЗаписи.Коэффициент = 0, 0, Цел(ВыборкаДетальныеЗаписи.КоличествоШтук / ВыборкаДетальныеЗаписи.Коэффициент));
					Количество		   = ?(ВыборкаДетальныеЗаписи.Коэффициент = 0
					, ВыборкаДетальныеЗаписи.КоличествоШтук
					, ВыборкаДетальныеЗаписи.КоличествоШтук - Цел(ВыборкаДетальныеЗаписи.КоличествоШтук / ВыборкаДетальныеЗаписи.Коэффициент) * ВыборкаДетальныеЗаписи.Коэффициент);
					
				КонецЕсли;
				Если Не КоличествоУпаковок = 0  Тогда
					
					Если РежимПечати = 1 Тогда
						НПП = НПП + 1;
					КонецЕсли;
					
					Область = Макет.ПолучитьОбласть("СтрокаДанные");
					ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаДетальныеЗаписи,, "Количество, КоличествоУпаковок");
					Область.Параметры.КоличествоУпаковок = КоличествоУпаковок;
					Область.Области.СтрокаДанные.ЦветФона = WebЦвета.СветлоСерый;
					Область.Параметры.НПП = НПП;
					ТабДокумент.Вывести(Область);
				КонецЕсли;
				
				Если Не Количество = 0  Тогда
					
					Если РежимПечати = 1 Тогда
						НПП = НПП + 1;
					КонецЕсли;
					
					Область = Макет.ПолучитьОбласть("СтрокаДанные");
					ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаДетальныеЗаписи,, "Количество, КоличествоУпаковок");
					Область.Параметры.Количество = Количество;
					Область.Параметры.НПП = НПП;
					ТабДокумент.Вывести(Область);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если РежимПечати = 2 Тогда
			ТабДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПолучатель);
	Если Не РежимПечати = 2 Тогда
		ТабДокумент.Вывести(Область);
	КонецЕсли;
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Завершение формирвоания ТД:" + " " + (ТекущаяДата() - К);
	
	Если Отладка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВремяВыполнения);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
	
КонецФункции

Функция СформироватьПечатнуюФормуКомплектация()
	
	ВремяВыполнения = "";
	ВремяВыполнения = "Старт:" + " " + ТекущаяДата();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ЛистКомплектации");
	
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_МаршрутныйЛист";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ВремяВыполнения = ВремяВыполнения + Символы.ПС + "Формирование списка заказов. Начало:" + " " + ТекущаяДата();
	Н = ТекущаяДата();
	СписокЗаказов = Новый Массив;
	Заказы = ТаблицаКомплектация.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого СтрокаЗаказ Из Заказы Цикл
		СписокЗаказов.Добавить(СтрокаЗаказ.Заказ);
	КонецЦикла;
	
	К = ТекущаяДата();
	ВремяВыполнения = ВремяВыполнения + Символы.ПС + "Формирование списка заказов. Конец:" + " " + ТекущаяДата() + " " + "/" + " " + (ТекущаяДата() - Н);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказТовары.Ссылка.Склад КАК Магазин,
	|	ТИПЗНАЧЕНИЯ(ЗаказТовары.Ссылка) КАК ТипДокумента,
	|	ЗаказТовары.Ссылка.Контрагент КАК ПоставщикСклад,
	|	ЗаказТовары.НомерСтроки КАК НПП,
	|	ЗаказТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаказТовары.Номенклатура.Наименование КАК Наименование,
	|	ЗаказТовары.Количество КАК КоличествоШтук,
	|	УпаковкиНоменклатуры.Коэффициент КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
	|	КОНЕЦ КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА ЗаказТовары.Количество
	|		ИНАЧЕ ЗаказТовары.Количество - (ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ЗаказТовары.Ссылка КАК Заказ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказПоставщику.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|	ГДЕ
	|		ЗаказПоставщику.Ссылка В(&СписокЗаказов)
	|		И ЗаказПоставщику.ЖелаемаяДатаПоступления = &ДатаОтгрузки) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|			ПО ЗаказТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
	|				И (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
	|		ПО ВложенныйЗапрос.Ссылка = ЗаказТовары.Ссылка
	|ГДЕ
	|	ЗаказТовары.Отменено = ЛОЖЬ
	|	И ЗаказТовары.Ссылка.ЖелаемаяДатаПоступления = &ДатаОтгрузки
	|{ГДЕ
	|	ЗаказТовары.Ссылка.Склад.*,
	|	ЗаказТовары.Ссылка.Контрагент.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказТовары.Ссылка.СкладПолучатель,
	|	ТИПЗНАЧЕНИЯ(ЗаказТовары.Ссылка),
	|	ЗаказТовары.Ссылка.СкладОтправитель,
	|	ЗаказТовары.НомерСтроки,
	|	ЗаказТовары.Номенклатура.Артикул,
	|	ЗаказТовары.Номенклатура.Наименование,
	|	ЗаказТовары.Количество,
	|	УпаковкиНоменклатуры.Коэффициент,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА ЗаказТовары.Количество
	|		ИНАЧЕ ЗаказТовары.Количество - (ВЫРАЗИТЬ(ЗаказТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ,
	|	ЗаказТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
	|			И ЗаказТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказНаПеремещение.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	|		ГДЕ
	|			ЗаказНаПеремещение.Ссылка В(&СписокЗаказов)
	|			И ЗаказНаПеремещение.ЖелаемаяДатаПоступления = &ДатаОтгрузки) КАК ВложенныйЗапрос
	|		ПО ЗаказТовары.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ЗаказТовары.Отменено = ЛОЖЬ
	|	И ЗаказТовары.Ссылка.ЖелаемаяДатаПоступления = &ДатаОтгрузки
	|{ГДЕ
	|	ЗаказТовары.Ссылка.СкладОтправитель.*,
	|	ЗаказТовары.Ссылка.СкладПолучатель.*}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка.Контрагент,
	|	ТИПЗНАЧЕНИЯ(ЗаказКлиентаТовары.Ссылка),
	|	ЗаказКлиентаТовары.Ссылка.Склад,
	|	ЗаказКлиентаТовары.НомерСтроки,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул,
	|	ЗаказКлиентаТовары.Номенклатура.Наименование,
	|	ЗаказКлиентаТовары.Количество,
	|	УпаковкиНоменклатуры.Коэффициент,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЗаказКлиентаТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА УпаковкиНоменклатуры.Коэффициент ЕСТЬ NULL 
	|			ТОГДА ЗаказКлиентаТовары.Количество
	|		ИНАЧЕ ЗаказКлиентаТовары.Количество - (ВЫРАЗИТЬ(ЗаказКлиентаТовары.Количество / УпаковкиНоменклатуры.Коэффициент КАК ЧИСЛО(10, 0))) * УпаковкиНоменклатуры.Коэффициент
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО (УпаковкиНоменклатуры.Наименование = ""Упаковка WMS"")
	|			И ЗаказКлиентаТовары.Номенклатура = УпаковкиНоменклатуры.Владелец
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказКлиента.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ГДЕ
	|			ЗаказКлиента.Ссылка В(&СписокЗаказов)
	|			И ЗаказКлиента.ЖелаемаяДатаОтгрузки = &ДатаОтгрузки) КАК ВложенныйЗапрос
	|		ПО ЗаказКлиентаТовары.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ЗаказКлиентаТовары.Отменено = ЛОЖЬ
	|ИТОГИ
	|	МАКСИМУМ(ПоставщикСклад)
	|ПО
	|	Магазин,
	|	Заказ";
	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	
	Результат = Запрос.Выполнить();
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Время выполнения Запроса:" + " " + (ТекущаяДата() - К);
	К = ТекущаяДата();
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Начало формирования ТД:" + " " + ТекущаяДата();
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(Область);
	
	ВыборкаПолучатель = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПолучатель.Следующий() Цикл
		
		Область = Макет.ПолучитьОбласть("СтрокаМагазин");
		ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПолучатель);
		ТабДокумент.Вывести(Область);
		
		ВыборкаЗаказ = ВыборкаПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			Область = Макет.ПолучитьОбласть("СтрокаДокумент");
			Область.Параметры.ТипДокумента   = ВыборкаЗаказ.Заказ;
			Область.Параметры.ПоставщикСклад = ВыборкаЗаказ.ПоставщикСклад;
			ТабДокумент.Вывести(Область);
			
			ВыборкаДетальныеЗаписи = ВыборкаЗаказ.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если Не ВыборкаДетальныеЗаписи.КоличествоУпаковок = 0  Тогда
					
					Область = Макет.ПолучитьОбласть("СтрокаДанные");
					ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаДетальныеЗаписи,, "Количество");
					Область.Области.СтрокаДанные.ЦветФона = WebЦвета.СветлоСерый;
					ТабДокумент.Вывести(Область);
					
				КонецЕсли;
				
				Если Не ВыборкаДетальныеЗаписи.Количество = 0  Тогда
					
					Область = Макет.ПолучитьОбласть("СтрокаДанные");
					ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаДетальныеЗаписи,, "КоличествоУпаковок");
					ТабДокумент.Вывести(Область);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(Область.Параметры, ВыборкаПолучатель);
	ТабДокумент.Вывести(Область);
	
	ВремяВыполнения  = ВремяВыполнения + Символы.ПС + "Завершение формирвоания ТД:" + " " + (ТекущаяДата() - К);
	
	Если Отладка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ВремяВыполнения);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивУзловДляДокумента(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0.Ссылка
	|ИЗ
	|	ПланОбмена.ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0 КАК ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0
	|ГДЕ
	|	ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0.Склады.Склад = &Склад";
	
	Если ТипЗнч(ДокументСсылка) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Запрос.УстановитьПараметр("Склад", ДокументСсылка.СкладПолучатель);
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
КонецФункции 

&НаСервере
Функция ПолучитьСправочникКоробок(ТекДок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.ВидДанных = 5
	|	И ХранилищеДополнительнойИнформации.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", ТекДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции 

&НаСервере
Функция НайтиСкладКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|ГДЕ
	|	СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Контрагент склада""
	|	И СкладыДополнительныеРеквизиты.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
КонецФункции 

&НаСервере
Функция ПолучитьАдресМагазина(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Ссылка = &Ссылка
	|	И СкладыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)";
	
	Запрос.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьКодМагазинаСклада(СкладПолучатель)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",   СкладПолучатель);
	Запрос.УстановитьПараметр("Свойство", УправлениеСвойствамиПовтИсп.ПолучитьДополнительноеСвойствоПВХПоНаименованию("КодМагазинаСклада"));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СкладыДополнительныеРеквизиты.Значение, """") КАК КодМагазинаСклада
	               |ИЗ
	               |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	               |ГДЕ
	               |	СкладыДополнительныеРеквизиты.Ссылка = &Ссылка
	               |	И СкладыДополнительныеРеквизиты.Свойство = &Свойство";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодМагазинаСклада;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура СохранитьДанныеОПечати(МассивДокументов, ПФ, ЗНО = Неопределено, КоличествоЭкземпляров = 0)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Док Из МассивДокументов Цикл
		
		РС = РегистрыСведений.ИсторияПечатиДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(РС, Новый Структура("Документ, Дата, Пользователь, ПечатнаяФорма, ДопАналитика, КоличествоЭкземпляров"
		, Док
		, ТекущаяДата()
		, ПараметрыСеанса.ТекущийПользователь
		, ПФ
		, ЗНО
		, КоличествоЭкземпляров));
		Попытка
			РС.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("История печати документов", УровеньЖурналаРегистрации.Ошибка,, Док, "Печать из АРМ:" + " " + ПараметрыСеанса.ТекущийПользователь); 
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

//конец печать МЛ

//печать ТОРГ13
&НаСервере
Функция ПолучитьГрупповоеПеремещение(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкладОтправитель1 = Справочники.Склады.НайтиПоНаименованию("Склад Хозяйственные товары");
	СкладОтправитель2 = Справочники.Склады.НайтиПоНаименованию("Обх Склад Хозяйственные товары");
	СкладОтправитель3 = Справочники.Склады.НайтиПоНаименованию("Склад оборудования");
	СкладОтправитель4 = Справочники.Склады.НайтиПоНаименованию("Обх Склад оборудования");
	СкладОтправитель5 = Справочники.Склады.НайтиПоНаименованию("Склад IT");
	СкладОтправитель6 = Справочники.Склады.НайтиПоНаименованию("Обх Склад IT");
	
	//+Буганов
	СкладОтправитель7 = Справочники.Склады.НайтиПоНаименованию("Обх Склад охлажденка");
	СкладОтправитель8 = Справочники.Склады.НайтиПоНаименованию("Склад охлажденка");
	
	МассивХозТоваров		= Новый Массив;
	МассивОборудования		= Новый Массив;
	МассивДокументовДляIT	= Новый Массив;
	//+Буганов
	МассивДокументовАлкоголь= Новый Массив;
	//-
	
	МассивПечать = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") И ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И Не СтрЗаказ.Пометка = 0 Тогда
			
			ТекПеремещение = СтрЗаказ.Автомобиль;
			
			Если НЕ ТекПеремещение.Проведен Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя печатать не проведенные документы!");
				Продолжить;
			КонецЕсли; 
			
			//+Буганов
			Если ТекПеремещение.ЗаказНаПеремещение.УчетВЕГАИС И Ложь Тогда
				МассивДокументовАлкоголь.Добавить(ТекПеремещение); 
				МассивПечать.Добавить(ТекПеремещение);
				//-
			ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель1
				ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель2
				ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель7
				ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель8
				Тогда
				МассивХозТоваров.Добавить(ТекПеремещение);
				МассивПечать.Добавить(ТекПеремещение);
			ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель3
				ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель4 Тогда
				МассивОборудования.Добавить(ТекПеремещение);
				МассивПечать.Добавить(ТекПеремещение);
			ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель5
				ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель6 Тогда
				МассивДокументовДляIT.Добавить(ТекПеремещение); 
				МассивПечать.Добавить(ТекПеремещение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	МД = Новый Массив;
	МД.Добавить(МассивХозТоваров);
	МД.Добавить(МассивОборудования);
	МД.Добавить(МассивДокументовДляIT);
	МД.Добавить(МассивДокументовАлкоголь);
	//
	////Соловьев И.В. Подключаем внешнюю компаненту штрихкода
	//ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	////Соловьев И.В.
	Обработка = РеквизитФормывЗначение("Объект");
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = Обработка.ПолучитьМакет("ТОРГ13");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ТОРГ13";
	ВалютаЦены = Справочники.Валюты.НайтиПоКоду("810");
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	// получим области
	ОбластьШапки         = Макет.ПолучитьОбласть("Шапка");
	//Если СтруктураПараметров.ВыводитьШтрихкод  Тогда
	//	ОбластьШапки         = Макет.ПолучитьОбласть("Шапка");
	//Иначе
	//	ОбластьШапки         = Макет.ПолучитьОбласть("ШапкаБезШК");
	//КонецЕсли; 
	
	ОбластьСклада =           Макет.ПолучитьОбласть("ЗаголовокСклада");
	ОбластьЗаголовка =        Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтроки =           Макет.ПолучитьОбласть("Строка");
	ОбластьИтогоПоСтранице =  Макет.ПолучитьОбласть("ИтогиПоСтранице");
	ОбластьВсего =            Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал =           Макет.ПолучитьОбласть("Подвал");
	СтрокНаСтранице = 70;  //23
	СтрокШапки      = 10;
	СтрокПодвала    = 9;
	НомерСтраницы   = 1;
	
	
	Для Каждого МассивДокументов Из МД Цикл
		
		// на каждый маршрут - один документ перемещения
		НомерДокументаСтрока="";
		
		// надо получить данные по магазинам... Для печати накладных
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладПолучатель
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка", МассивДокументов);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаПолучателей = РезультатЗапроса.Выбрать();
		
		// счас получим Запросом состав документов, сгруппируем по складу отправителю, складу получателю...
		// еще и цену надо получить в Запросе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.СкладПолучатель.РозничныйВидЦены,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьГрупповоеПеремещение.ВТ_ПеремещенияШапки}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияШапки
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&ПеремещениеТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное,
		|	ПеремещениеТоваровТовары.Номенклатура.Код,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное,
		|	ПеремещениеТоваровТовары.Упаковка,
		|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения.Код,
		|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	ПеремещениеТоваровТовары.Упаковка.Коэффициент,
		|	ПеремещениеТоваровТовары.Номенклатура.Вес,
		|	ПеремещениеТоваровТовары.Количество,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьГрупповоеПеремещение.ВТ_ПеремещенияТовары}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияТовары
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка В(&ПеремещениеТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПеремещенияШапки.СкладОтправитель,
		|	ВТ_ПеремещенияШапки.СкладПолучатель,
		|	ВТ_ПеремещенияШапки.Организация,
		|	ВТ_ПеремещенияШапки.Дата,
		|	ВТ_ПеремещенияШапки.Ссылка,
		|	ВТ_ПеремещенияТовары.Номенклатура,
		|	ВТ_ПеремещенияТовары.НоменклатураНаименованиеПолное,
		|	ВТ_ПеремещенияТовары.НоменклатураКод,
		|	ВТ_ПеремещенияТовары.НоменклатураАртикул,
		|	ВТ_ПеремещенияТовары.ХарактеристикаНаименованиеПолное,
		|	ВТ_ПеремещенияТовары.Упаковка,
		|	ВТ_ПеремещенияТовары.НоменклатураЕдиницаИзмерения,
		|	ВТ_ПеремещенияТовары.УпаковкаЕдиницаИзмерения,
		|	ВТ_ПеремещенияТовары.УпаковкаЕдиницаИзмеренияКод,
		|	ВТ_ПеремещенияТовары.НоменклатураЕдиницаИзмеренияКод,
		|	ВТ_ПеремещенияТовары.КоличествоУпаковок,
		|	ВТ_ПеремещенияТовары.УпаковкаКоэффициент,
		|	ВТ_ПеремещенияТовары.НоменклатураВес,
		|	ВТ_ПеремещенияТовары.Количество,
		|	ВТ_ПеремещенияШапки.СкладПолучательРозничныйВидЦены,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьГрупповоеПеремещение.ВТ_Перемещения}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	ВТ_ПеремещенияШапки КАК ВТ_ПеремещенияШапки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПеремещенияТовары КАК ВТ_ПеремещенияТовары
		|		ПО ВТ_ПеремещенияШапки.Ссылка = ВТ_ПеремещенияТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Перемещения.Номенклатура КАК Товар,
		|	ВТ_Перемещения.НоменклатураНаименованиеПолное КАК ТоварНаименование,
		|	ВЫБОР
		|		КОГДА &ТоварКод = ""Код""
		|			ТОГДА ВТ_Перемещения.НоменклатураКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураАртикул
		|	КОНЕЦ КАК ТоварКод,
		|	ВТ_Перемещения.ХарактеристикаНаименованиеПолное КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.УпаковкаЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.НоменклатураЕдиницаИзмерения)
		|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВТ_Перемещения.УпаковкаЕдиницаИзмеренияКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураЕдиницаИзмеренияКод
		|	КОНЕЦ КАК ЕдиницаИзмеренияКодПоОКЕИ,
		|	СУММА(ВТ_Перемещения.КоличествоУпаковок) КАК Количество,
		|	СУММА((ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2))) * ВТ_Перемещения.КоличествоУпаковок) КАК Сумма,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2)) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_Перемещения.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА (ВЫРАЗИТЬ(ВЫБОР
		|							КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|									ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
		|								ТОГДА ВТ_Перемещения.НоменклатураВес
		|							ИНАЧЕ ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, 0)
		|						КОНЕЦ КАК ЧИСЛО(15, 3))) * ВТ_Перемещения.Количество
		|			ИНАЧЕ (ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
		|							ТОГДА ВТ_Перемещения.НоменклатураВес
		|						ИНАЧЕ ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, 0)
		|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ВТ_Перемещения.КоличествоУпаковок
		|		КОНЕЦ) КАК МассаБрутто,
		|	СУММА(ВТ_Перемещения.НоменклатураВес * ВТ_Перемещения.Количество) КАК МассаНетто,
		|	ВТ_Перемещения.СкладОтправитель КАК СкладОтправитель,
		|	ВТ_Перемещения.СкладПолучатель КАК СкладПолучатель,
		|	ВТ_Перемещения.Организация КАК Организация,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьГрупповоеПеремещение.Результат}}"" КАК Метка
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущийПериод, ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_Перемещения.СкладПолучательРозничныйВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|			И ВТ_Перемещения.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВТ_Перемещения.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""вес брутто"")
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Перемещения.Номенклатура,
		|	ВТ_Перемещения.ХарактеристикаНаименованиеПолное,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВТ_Перемещения.УпаковкаЕдиницаИзмеренияКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураЕдиницаИзмеренияКод
		|	КОНЕЦ,
		|	ВТ_Перемещения.СкладОтправитель,
		|	ВТ_Перемещения.СкладПолучатель,
		|	ВТ_Перемещения.Организация,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2)),
		|	ВТ_Перемещения.НоменклатураНаименованиеПолное,
		|	ВЫБОР
		|		КОГДА &ТоварКод = ""Код""
		|			ТОГДА ВТ_Перемещения.НоменклатураКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураАртикул
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.УпаковкаЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.НоменклатураЕдиницаИзмерения)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товар
		|ИТОГИ ПО
		|	Организация,
		|	СкладПолучатель,
		|	СкладОтправитель
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекущийПериод", ТекущаяДата());
		Запрос.УстановитьПараметр("ПеремещениеТоваров", МассивДокументов);
		Запрос.УстановитьПараметр("ТоварКод", ТоварКод);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаМаршрута.ЗНО, "Номер"));
		//ШтрихкодНакладной = СоздатьШтрихкодНакладной(МассивДокументов);
		Если ШтрихкодНакладной = Неопределено Тогда
			//Сообщить("Печать прервана! Маршрутный лист уже был напечатан!");
			//Возврат ТабДокумент;
		КонецЕсли; 
		
		Пока Выборка.Следующий() Цикл
			
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Выборка.Организация, ТекущаяДата());
			ВыборкаМагазинов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМагазинов.Следующий() Цикл
				
				ОбщийПолучатель = ВыборкаМагазинов.СкладПолучатель;
				
				ВыборкаПолучателей.Сбросить();
				НомерДокументаСтрока="";
				ОбщийНомер="+";
				Пока ВыборкаПолучателей.НайтиСледующий(Новый структура("СкладПолучатель",ОбщийПолучатель)) Цикл
					// создадим строку номеров
					// выделим номер
					ЧастьНомера="";
					НомерДокумента = ВыборкаПолучателей.номер + " " + "от" + " " + Формат(ВыборкаПолучателей.Дата, "ДЛФ = Д");
					ДлинаНомера = стрдлина(НомерДокумента);
					Для сч = 0 по ДлинаНомера Цикл
						номерсимвола = длинаномера-сч;
						Сим = сред(НомерДокумента,номерсимвола,1);
						Если сим="-" Тогда
							прервать;
						КонецЕсли;
						ЧастьНомера = сим + ЧастьНомера ;
					КонецЦикла;
					// счас уберем левые нули
					Для сч=1 по стрдлина(частьномера) Цикл
						сим = сред(частьномера,сч,1);
						Если сим<>"0" Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если СокрЛП(частьномера) <> "" Тогда
						общийномер = общийномер + прав(ЧастьНомера,стрдлина(частьномера)-сч+1) + "+";
					КонецЕсли;
					НомерДокументаСтрока = НомерДокументаСтрока + НомерДокумента+"/";
					
				КонецЦикла;
				
				ОбластьШапки.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
				//Удалить старая версия, Заполняем Штрихкод
				//ЗаполнитьШтрихКодОбласть(ОбластьШапки, ОбщийНомер, ВнешняяКомпонента);
				//Если СтруктураПараметров.ВыводитьШтрихкод Тогда
				ОбластьШапки.Параметры.ШтрихкодДокумента = ШтрихкодНакладной;
				//ЗаполнитьШтрихКодОбласть(ОбластьШапки, ШтрихкодНакладной);
				//КонецЕсли; 
				ОбластьШапки.Параметры.НомерДокумента = НомерДокументаСтрока;
				ТабДокумент.Вывести(ОбластьШапки);
				
				// начнем 
				ВыборкаСкладов = ВыборкаМагазинов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ИтогоКоличество  = 0;
				ИтогоМассаБрутто = 0;
				ИтогоМассаНетто  = 0;
				ИтогоСумма       = 0;
				
				Пока ВыборкаСкладов.Следующий() Цикл
					ОбщийОтправитель = ВыборкаСкладов.СкладОтправитель;
					// напечатаем заголовок отгрузки со склада
					ОбластьСклада.параметры.ОтправительПодразделение = ОбщийОтправитель;
					ОбластьСклада.параметры.ПолучательПодразделение = ОбщийПолучатель;
					ТабДокумент.Вывести(ОбластьСклада);
					
					выборкаСтрокТовары = выборкаскладов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					КоличествоСтрок = ВыборкаСтрокТовары.Количество();
					
					Если КоличествоСтрок = 1 Тогда
						ПереноситьПоследнююСтроку = 0;
					Иначе
						ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
						ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
						ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
					КонецЕсли;
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					ИтогМассаБруттоПоСтранице    = 0;
					ИтогМассаНеттоПоСтранице     = 0;
					ИтогСуммыПоСтранице          = 0;
					
					// инициализация итогов по документу
					
					Ном = 0;
					НомерСтраницы=1;
					ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабДокумент.Вывести(ОбластьЗаголовка);
					
					Пока выборкаСтроктовары.Следующий() Цикл
						// будем выводить товары
						Ном = Ном + 1;
						//Начинаем новую страницу, Если предыдущая строка была последней на странице
						//или пора переносить последнюю строку на последнюю страницу с подвалом.
						ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
						
						Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
							или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
							
							ОбластьИтогоПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
							
							ТабДокумент.Вывести(ОбластьИтогоПоСтранице);
							
							// инициализация итогов по странице
							ИтогКоличествоМестПоСтранице = 0;
							ИтогМассаБруттоПоСтранице    = 0;
							ИтогМассаНеттоПоСтранице     = 0;
							ИтогСуммыПоСтранице          = 0;
							
							НомерСтраницы = НомерСтраницы + 1;
							ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
							ТабДокумент.Вывести(ОбластьЗаголовка);
							
						КонецЕсли;
						
						ОбластьСтроки.Параметры.Заполнить(ВыборкаСтрокТовары);
						
						КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
						
						ОбластьСтроки.Параметры.КоличествоМест    = КоличествоМест;
						
						ОбластьСтроки.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
						СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
						СокрЛП(ВыборкаСтрокТовары.Характеристика));
						
						Сумма = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
						
						ОбластьСтроки.Параметры.Сумма = Сумма;
						
						ТабДокумент.Вывести(ОбластьСтроки);
						
						// Обновим итоги по странице
						ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
						ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
						ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
						ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
						
						// Обновим итогов по документу
						ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
						ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
						ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
						ИтогоСумма       = ИтогоСумма       + Сумма;
						
					КонецЦикла;
					
				КонецЦикла;		
				// завершим печать накладной
				ОбластьИтогоПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
				
				ТабДокумент.Вывести(ОбластьИтогоПоСтранице);
				
				// Выводим итоги по документу в целом
				ОбластьМакета = Макет.ПолучитьОбласть("Всего");
				ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
				ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
				ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
				ОбластьМакета.Параметры.ИтогоСумма          = ИтогоСумма;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				// Выводим подвал документа
				ОбластьМакета  = Макет.ПолучитьОбласть("Подвал");
				//ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.ДолжностьОтправителя = "";
				ОбластьМакета.Параметры.ФИООтправителя       = "";//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикОтправитель);
				
				ОбластьМакета.Параметры.ДолжностьПолучателя  = "";//Шапка.ДолжностьКладовщикаПолучателя;
				ОбластьМакета.Параметры.ФИОПолучателя        = "";//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикПолучатель);
				
				//Если ЗначениеЗаполнено(Шапка.УчетныйВидЦеныВалютаЦены) Тогда
				ОбластьМакета.Параметры.ИтогоСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Цел(ИтогоСумма),ВалютаЦены, Истина);
				//Иначе
				//	ОбластьМакета.Параметры.ИтогоСуммаПрописью = НСтр("ru = 'Ноль'");
				//КонецЕсли;
				
				ОбластьМакета.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СохранитьДанныеОПечати(МассивПечать, "Торг 13", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьТОРГ13()
//конец печать ТОРГ13

Функция ПолучитьГрупповоеПеремещениеОПТ(СтрокаМаршрута)
	
	
	МассивОбъектов = Новый Массив;
	Для Каждого Строка Из СтрокаМаршрута.Строки ЦИкл
		
		Если Строка.Пометка И ТипЗнч(Строка.Автомобиль) = Тип("ДокументСсылка.ПеремещениеТоваров") ТОгда
			МассивОбъектов.Добавить(Строка.Автомобиль);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СформироватьПечатнуюФормуТОРГ13ОПТ(МассивОбъектов, Новый СписокЗначений);
	
	
КонецФункции // ПечатьТОРГ13()

Процедура ЗадатьПараметрыМакета(ТабДокумент)
	
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.РазмерКолонтитулаСверху = 0;
	ТабДокумент.РазмерКолонтитулаСнизу = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТОРГ13ОПТ(МассивОбъектов, ОбъектыПечати)
	
	////Соловьев И.В. Подключаем внешнюю компаненту штрихкода
	//ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	////Соловьев И.В.
	
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Торг13ОПТ");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ТОРГ13";
	
	ЗадатьПараметрыМакета(ТабДокумент);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Перемещение.Ссылка                                          КАК Ссылка,
	|	Перемещение.Номер                                           КАК Номер,
	|	Перемещение.Дата                                            КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Перемещение.ЗаказНаПеремещение = Неопределено
	|		ТОГДА """"
	|		ИНАЧЕ Перемещение.ЗаказНаПеремещение.Номер
	|	КОНЕЦ														КАК НомерЗаказа,
	|	Перемещение.Организация                                     КАК Организация,
	|	Перемещение.Организация.Префикс                             КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.СкладОтправитель)           КАК ОтправительПодразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.СкладПолучатель)            КАК ПолучательПодразделение,
	|	Перемещение.СкладОтправитель.ТекущийОтветственный           КАК КладовщикОтправитель,
	|	Перемещение.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщикаОтправителя,
	|	Перемещение.СкладПолучатель.ТекущийОтветственный            КАК КладовщикПолучатель,
	|	Перемещение.СкладПолучатель.ТекущаяДолжностьОтветственного  КАК ДолжностьКладовщикаПолучателя,
	|	Перемещение.ВидЦены                                         КАК УчетныйВидЦены,
	|	Перемещение.ВидЦены.ВалютаЦены                              КАК УчетныйВидЦеныВалютаЦены
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка В(&МассивПеремещений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента, Ссылка
	|");
	Запрос.УстановитьПараметр("МассивПеремещений", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Номенклатура КАК Товар,
	|	ПеремещениеТоваров.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ВЫБОР
	|		КОГДА &ТоварКод = ""Код""
	|			ТОГДА ПеремещениеТоваров.Номенклатура.Код
	|		ИНАЧЕ ПеремещениеТоваров.Номенклатура.Артикул
	|	КОНЕЦ КАК ТоварКод,
	|	ПеремещениеТоваров.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Упаковка.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Номенклатура.ЕдиницаИзмерения)
	|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПеремещениеТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПеремещениеТоваров.Упаковка.ЕдиницаИзмерения.Код
	|			ИНАЧЕ ПеремещениеТоваров.Номенклатура.ЕдиницаИзмерения.Код
	|		КОНЕЦ) КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|	СУММА(ПеремещениеТоваров.КоличествоУпаковок) КАК Количество,
	|	СУММА((ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, ЕСТЬNULL(ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Цена, 0)) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, ЕСТЬNULL(ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Упаковка.Коэффициент, 1)) * ЕСТЬNULL(ПеремещениеТоваров.Упаковка.Коэффициент, 1) КАК ЧИСЛО(15, 2))) * ПеремещениеТоваров.КоличествоУпаковок) КАК Сумма,
	|	СРЕДНЕЕ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, ЕСТЬNULL(ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Цена, 0)) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, ЕСТЬNULL(ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Упаковка.Коэффициент, 1)) * ЕСТЬNULL(ПеремещениеТоваров.Упаковка.Коэффициент, 1) КАК ЧИСЛО(15, 2))) КАК Цена,
	|	СУММА(ВЫБОР
	|			КОГДА ПеремещениеТоваров.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПеремещениеТоваров.Номенклатура.Вес * ПеремещениеТоваров.Количество
	|			ИНАЧЕ ПеремещениеТоваров.Упаковка.Вес * ПеремещениеТоваров.КоличествоУпаковок
	|		КОНЕЦ) КАК МассаБрутто,
	|	СУММА(ПеремещениеТоваров.Номенклатура.Вес * ПеремещениеТоваров.Количество) КАК МассаНетто
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаДокумента,
	|				(Номенклатура, Характеристика, ВидЦены) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						&УчетныйВидЦены
	|					ИЗ
	|						Документ.ПеремещениеТоваров.Товары КАК Т
	|					ГДЕ
	|						Т.Ссылка = &ПеремещениеТоваров)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ПеремещениеТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаДокумента,
	|				(Номенклатура, Характеристика, ВидЦены) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						Т.Характеристика,
	|						&РезервныйВидЦены
	|					ИЗ
	|						Документ.ПеремещениеТоваров.Товары КАК Т
	|					ГДЕ
	|						Т.Ссылка = &ПеремещениеТоваров)) КАК ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены
	|		ПО ПеремещениеТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Номенклатура
	|			И ПеремещениеТоваров.Характеристика = ЦеныНоменклатурыСрезПоследнихРезервныйВидЦены.Характеристика
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ПеремещениеТоваров
	|	И ПеремещениеТоваров.Номенклатура.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваров.Номенклатура,
	|	ПеремещениеТоваров.Номенклатура.НаименованиеПолное,
	|	ПеремещениеТоваров.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА &ТоварКод = ""Код""
	|			ТОГДА ПеремещениеТоваров.Номенклатура.Код
	|		ИНАЧЕ ПеремещениеТоваров.Номенклатура.Артикул
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Упаковка.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Номенклатура.ЕдиницаИзмерения)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварНаименование");
	Запрос.УстановитьПараметр("ТоварКод", ТоварКод);
	
	МассивВыводимыхОбластей = Новый Массив;
	Пока Шапка.Следующий() Цикл
		//Соловьев И.В. Не печатаем не проведенные документы
		Если НЕ Шапка.Ссылка.Проведен Тогда
			Сообщить("Нельзя печатать не проведенные документы!");
			Продолжить;
		КонецЕсли; 
		//Соловеьв И.В.
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("ПеремещениеТоваров", Шапка.Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента", Шапка.ДатаДокумента);
		Запрос.УстановитьПараметр("УчетныйВидЦены", Шапка.УчетныйВидЦены);
		Запрос.УстановитьПараметр("РезервныйВидЦены",Справочники.ВидыЦен.НайтиПоНаименованию("СИБИРЬ"));
		
		//++СемесДВ
		ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();
		//Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//--СемесДВ
		
		// Выводим общие реквизиты шапки.
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		ОбластьМакетаШапка         = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
		ОбластьМакетаШапка.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
		ОбластьМакетаШапка.Параметры.НомерДокумента           = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.Номер, Ложь, Истина);
		ОбластьМакетаШапка.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
		ОбластьМакетаШапка.Параметры.НомерЗаказа           	 = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерЗаказа, Ложь, Истина);
		
		АдресСклада = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.Ссылка.СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
		ОбластьМакетаШапка.Параметры.АдресПодразделения		 =  АдресСклада;
		
		АдресСкладаПолучателя = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.Ссылка.СкладПолучатель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
		ОбластьМакетаШапка.Параметры.АдресПолучателя =  АдресСкладаПолучателя;
		
		//Соловьев И.В. Заполняем штрихкод
		//ЗначениеШтрихкода = "" +Шапка.Номер +"+" +Формат(Шапка.ДатаДокумента, "ДФ=dd.MM.yyyy") +"+"+ПолучитьКодДокументаДляПечати(Шапка.Ссылка.Метаданные());
		ЗначениеШтрихкода = СформироватьШтрихкодНакладной(Шапка.Ссылка);
		ТекстСообщения = "ЗначениеШтрихкода: " + ЗначениеШтрихкода;
		ЗаписьЖурналаРегистрации("Печать ТОРГ13", УровеньЖурналаРегистрации.Примечание,Шапка.Ссылка.Метаданные(),Шапка.Ссылка,ТекстСообщения);

		ОбластьМакетаШапка.Параметры.ЗначениеШтрихкода = ЗначениеШтрихкода;
		//ЗаполнитьШтрихКодОбласть(ОбластьМакетаШапка, ЗначениеШтрихкода);
		//Соловьев И.В.
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		//++СемесДВ
		//СтрокНаСтранице = 68;  //23
		//СтрокШапки      = 10;
		//СтрокПодвала    = 9;
		//--СемесДВ
		НомерСтраницы   = 1;
		
		// Выводим заголовок таблицы
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
		
		//КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		//++СемесДВ
		//КоличествоСтрок = Выборка.Количество();
		//
		//Если КоличествоСтрок = 1 Тогда
		//	ПереноситьПоследнююСтроку = 0;
		//Иначе
		//	ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
		//	ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
		//	ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		//КонецЕсли;
		//--СемесДВ
		
		// инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассаНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;
		
		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;
		
		//++СемесДВ
		// Области макета.
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		ОбластьМакетаСтрока     = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаВсего      = Макет.ПолучитьОбласть("Всего");
		ОбластьМакетаПодвал     = Макет.ПолучитьОбласть("Подвал");
		
		КоличествоСтрок = ВыборкаСтрокТовары.Количество();
		//--СемесДВ
		
		Ном = 0;
		
		//++СемесДВ
		//// Выводим многострочную часть докмента
		//ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогиПоСтранице");
		//ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
		//
		// Выборка товаров
		//Соловьев И.В.
		//Пока Выборка.Следующий() Цикл
		//	ВыборкаСтрокТовары = Выборка.Выбрать();
		//	
		//	Пока ВыборкаСтрокТовары.Следующий() Цикл
		//		Если ВыборкаСтрокТовары.Товар.ЭтоГруппа Тогда
		//			Продолжить;
		//		КонецЕсли;
		//		Ном = Ном + 1;
		//		//Начинаем новую страницу, Если предыдущая строка была последней на странице
		//		//или пора переносить последнюю строку на последнюю страницу с подвалом.
		//		//ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
		//		
		//		Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
		//			или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
		//			
		//			ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
		//			ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		//			ОбластьИтоговПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
		//			ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
		//			
		//			ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
		//			
		//			// инициализация итогов по странице
		//			ИтогКоличествоМестПоСтранице = 0;
		//			ИтогМассаБруттоПоСтранице    = 0;
		//			ИтогМассаНеттоПоСтранице     = 0;
		//			ИтогСуммыПоСтранице          = 0;
		//			
		//			НомерСтраницы = НомерСтраницы + 1;
		//			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//			ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
		//			ТабДокумент.Вывести(ЗаголовокТаблицы);
		//			
		//		КонецЕсли;
		//		
		//		ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
		//		
		//		КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
		//		
		//		ОбластьМакета.Параметры.КоличествоМест    = КоличествоМест;
		//		
		//		ОбластьМакета.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
		//		СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
		//		СокрЛП(ВыборкаСтрокТовары.Характеристика));
		//		
		//		Сумма = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
		//		
		//		ОбластьМакета.Параметры.Сумма = Сумма;
		//		
		//		ТабДокумент.Вывести(ОбластьМакета);
		//		
		//		// Обновим итоги по странице
		//		ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
		//		ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
		//		ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
		//		ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
		//		
		//		// Обновим итогов по документу
		//		ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
		//		ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
		//		ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
		//		ИтогоСумма       = ИтогоСумма       + Сумма;
		//		
		//	КонецЦикла;
		//КонецЦикла;
		//
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			Ном = Ном + 1;
			
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьМакетаСтрока.Параметры.КоличествоМест    = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
			ОбластьМакетаСтрока.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
				СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
				СокрЛП(ВыборкаСтрокТовары.Характеристика));
			
			СуммаСтроки = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
			ОбластьМакетаСтрока.Параметры.Сумма = СуммаСтроки;
			
			Если Ном > 1 Тогда
				
				// Умещаются ли области на страницу при печати.
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакетаСтрока);
				МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
				Если Ном = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьМакетаВсего);
					МассивВыводимыхОбластей.Добавить(ОбластьМакетаПодвал);
				КонецЕсли;
				
				Если Не ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					// Вывод итогов по странице.
					ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
					ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// Инициализация итогов по странице.
					ИтогКоличествоМестПоСтранице = 0;
					ИтогМассаБруттоПоСтранице    = 0;
					ИтогМассаНеттоПоСтранице     = 0;
					ИтогСуммыПоСтранице          = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					
					// Вывод заголовка таблицы.
					ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
			
			// Обновление итоги по странице
			ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
			ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
			ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
			ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + СуммаСтроки;
			
			// Обновление итогов по документу
			ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
			ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
			ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
			ИтогоСумма       = ИтогоСумма       + СуммаСтроки;
			
		КонецЦикла;
		//--СемесДВ
		
		ОбластьИтоговПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогМассаНеттоПоСтранице     = ИтогМассаНеттоПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
		ТабДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакетаВсего.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
		ОбластьМакетаВсего.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
		ОбластьМакетаВсего.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
		ОбластьМакетаВсего.Параметры.ИтогоСумма          = ИтогоСумма;
		ТабДокумент.Вывести(ОбластьМакетаВсего);
		
		// Выводим подвал документа
		ОбластьМакетаПодвал.Параметры.Заполнить(Шапка);
		
		ОбластьМакетаПодвал.Параметры.ДолжностьОтправителя = "бухгалтер-оператор";//Шапка.ДолжностьКладовщикаОтправителя;   ЛВО 12.05.2020
		// ЛВО 12.05.2020 проверка доверенности +
			СтрокаДоверенность = ПараметрыСеанса.ТекущийПользователь.Наименование;
			ЗапросПол = Новый Запрос;
			ЗапросПол.Текст = "ВЫБРАТЬ
			               |	ПользователиДополнительныеРеквизиты.Значение
			               |ИЗ
			               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
			               |ГДЕ
			               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
			               |	И ПользователиДополнительныеРеквизиты.Свойство = &Свойство";
			ЗапросПол.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
			ЗапросПол.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Информация о доверенности"));
			РезультатДов = ЗапросПол.Выполнить();
			Если не РезультатДов.Пустой() тогда
				ВыборкаДоверенность = РезультатДов.Выбрать();
				Пока ВыборкаДоверенность.Следующий() цикл
					 Доверенность = ВыборкаДоверенность.Значение;
				 КонецЦикла;
				 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
			КонецЕсли;
			
			//-
		ОбластьМакетаПодвал.Параметры.ФИООтправителя       = СтрокаДоверенность;//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикОтправитель); ЛВО 12.05.2020
		
		ОбластьМакетаПодвал.Параметры.ДолжностьПолучателя  = Шапка.ДолжностьКладовщикаПолучателя;
		ОбластьМакетаПодвал.Параметры.ФИОПолучателя        = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикПолучатель);
		
		Если ЗначениеЗаполнено(Шапка.УчетныйВидЦеныВалютаЦены) Тогда
			ОбластьМакетаПодвал.Параметры.ИтогоСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Цел(ИтогоСумма), Шапка.УчетныйВидЦеныВалютаЦены, Истина);
		Иначе
			ОбластьМакетаПодвал.Параметры.ИтогоСуммаПрописью = НСтр("ru = 'Ноль'");
		КонецЕсли;
		
		ОбластьМакетаПодвал.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
		
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	//Зарегистрируем документы для обмена на кассы
	//МассивУзлов = Новый Массив;
	//ВыборкаУзлов = ПланыОбмена.ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0.Выбрать();
	//Пока ВыборкаУзлов.Следующий() Цикл
	//	Если ВыборкаУзлов.Код = ПланыОбмена.ОбменУправлениеТорговлей_11_0_РозничнаяТорговля_1_0.ЭтотУзел().Код Тогда
	//		Продолжить;
	//	КонецЕсли; 
	//	МассивУзлов.Добавить(ВыборкаУзлов.Ссылка);
	//КонецЦикла; 
	//
	//Для каждого ТекДок Из МассивОбъектов Цикл
	//	ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, ТекДок);
	//КонецЦикла; 
	
	// Еще раз зададим параметры макета, т.к. это фича 1С - параметры могут сбросится
	ЗадатьПараметрыМакета(ТабДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьТОРГ13()

Функция СформироватьТТНЕГАИС(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	//+Буганов
	МассивДокументовАлкоголь= Новый Массив;
	//-
	
	МассивПечать = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") И ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И Не СтрЗаказ.Пометка = 0 Тогда
			
			ТекПеремещение = СтрЗаказ.Автомобиль;
			
			Если НЕ ТекПеремещение.Проведен Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя печатать не проведенные документы!");
				Продолжить;
			КонецЕсли; 
			
			ИспользоватьРаздельнаяПриемкаЕГАИС = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.Водитель, "РаздельнаяПриемкаЕГАИС");
			
			Если ТекПеремещение.ЗаказНаПеремещение.УчетВЕГАИС И ИспользоватьРаздельнаяПриемкаЕГАИС Тогда
				
				МассивДокументовАлкоголь.Добавить(ТекПеремещение); 
				МассивПечать.Добавить(ТекПеремещение);
			//	//-
			//ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель1
			//	ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель2
			//	ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель7
			//	ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель8
			//	Тогда
			//	МассивХозТоваров.Добавить(ТекПеремещение);
			//	МассивПечать.Добавить(ТекПеремещение);
			//ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель3
			//	ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель4 Тогда
			//	МассивОборудования.Добавить(ТекПеремещение);
			//	МассивПечать.Добавить(ТекПеремещение);
			//ИначеЕсли ТекПеремещение.СкладОтправитель = СкладОтправитель5
			//	ИЛИ ТекПеремещение.СкладОтправитель = СкладОтправитель6 Тогда
			//	МассивДокументовДляIT.Добавить(ТекПеремещение); 
			//	МассивПечать.Добавить(ТекПеремещение);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	//МД = Новый Массив;
	////МД.Добавить(МассивХозТоваров);
	////МД.Добавить(МассивОборудования);
	////МД.Добавить(МассивДокументовДляIT);
	//МД.Добавить(МассивДокументовАлкоголь);
	МД = МассивДокументовАлкоголь;
	//Соловьев И.В. Подключаем внешнюю компаненту штрихкода
	//ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	//Соловьев И.В.
	Обработка = РеквизитФормывЗначение("Объект");
	ТоварКод = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	Если Не ЗначениеЗаполнено(ТоварКод) Тогда
		ТоварКод = "Код";
	КонецЕсли;
	
	Макет = Обработка.ПолучитьМакет("ТТНЕГАИС");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ТТНЕГАИС";
	ВалютаЦены = Справочники.Валюты.НайтиПоКоду("810");
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	
	// получим области
	ОбластьШапки         = Макет.ПолучитьОбласть("Шапка");
	//Если СтруктураПараметров.ВыводитьШтрихкод  Тогда
	//	ОбластьШапки         = Макет.ПолучитьОбласть("Шапка");
	//Иначе
	//	ОбластьШапки         = Макет.ПолучитьОбласть("ШапкаБезШК");
	//КонецЕсли; 
	
	ОбластьСклада =           Макет.ПолучитьОбласть("ЗаголовокСклада");
	ОбластьЗаголовка =        Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтроки =           Макет.ПолучитьОбласть("Строка");
	ОбластьИтогоПоСтранице =  Макет.ПолучитьОбласть("ИтогиПоСтранице");
	ОбластьВсего =            Макет.ПолучитьОбласть("Всего");
	ОбластьПодвал =           Макет.ПолучитьОбласть("Подвал");
	СтрокНаСтранице = 70;  //23
	СтрокШапки      = 10;
	СтрокПодвала    = 9;
	НомерСтраницы   = 1;
	
	
	Для Каждого МассивДокументов Из МД Цикл
		
		// на каждый маршрут - один документ перемещения
		НомерДокументаСтрока="";
		
		// надо получить данные по магазинам... Для печати накладных
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладПолучатель
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка", МассивДокументов);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаПолучателей = РезультатЗапроса.Выбрать();
		
		// счас получим Запросом состав документов, сгруппируем по складу отправителю, складу получателю...
		// еще и цену надо получить в Запросе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТоваров.СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваров.СкладПолучатель.РозничныйВидЦены,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.ВТ_ПеремещенияШапки}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияШапки
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&ПеремещениеТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПеремещенияШапки.СкладПолучательРозничныйВидЦены,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.ВТ_РозничныйВидЦены}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_РозничныйВидЦены
		|ИЗ
		|	ВТ_ПеремещенияШапки КАК ВТ_ПеремещенияШапки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное,
		|	ПеремещениеТоваровТовары.Номенклатура.Код,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное,
		|	ПеремещениеТоваровТовары.Упаковка,
		|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения.Код,
		|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код,
		|	ПеремещениеТоваровТовары.КоличествоУпаковок,
		|	ПеремещениеТоваровТовары.Упаковка.Коэффициент,
		|	ПеремещениеТоваровТовары.Номенклатура.Вес,
		|	ПеремещениеТоваровТовары.Количество,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.ВТ_ПеремещенияТовары}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияТовары
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка В(&ПеремещениеТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПеремещенияТовары.Номенклатура,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.ВТ_ФильтрНоменклатуры}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ФильтрНоменклатуры
		|ИЗ
		|	ВТ_ПеремещенияТовары КАК ВТ_ПеремещенияТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПеремещенияШапки.СкладОтправитель,
		|	ВТ_ПеремещенияШапки.СкладПолучатель,
		|	ВТ_ПеремещенияШапки.Организация,
		|	ВТ_ПеремещенияШапки.Дата,
		|	ВТ_ПеремещенияШапки.Ссылка,
		|	ВТ_ПеремещенияТовары.Номенклатура,
		|	ВТ_ПеремещенияТовары.НоменклатураНаименованиеПолное,
		|	ВТ_ПеремещенияТовары.НоменклатураКод,
		|	ВТ_ПеремещенияТовары.НоменклатураАртикул,
		|	ВТ_ПеремещенияТовары.ХарактеристикаНаименованиеПолное,
		|	ВТ_ПеремещенияТовары.Упаковка,
		|	ВТ_ПеремещенияТовары.НоменклатураЕдиницаИзмерения,
		|	ВТ_ПеремещенияТовары.УпаковкаЕдиницаИзмерения,
		|	ВТ_ПеремещенияТовары.УпаковкаЕдиницаИзмеренияКод,
		|	ВТ_ПеремещенияТовары.НоменклатураЕдиницаИзмеренияКод,
		|	ВТ_ПеремещенияТовары.КоличествоУпаковок,
		|	ВТ_ПеремещенияТовары.УпаковкаКоэффициент,
		|	ВТ_ПеремещенияТовары.НоменклатураВес,
		|	ВТ_ПеремещенияТовары.Количество,
		|	ВТ_ПеремещенияШапки.СкладПолучательРозничныйВидЦены,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.ВТ_Перемещения}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	ВТ_ПеремещенияШапки КАК ВТ_ПеремещенияШапки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПеремещенияТовары КАК ВТ_ПеремещенияТовары
		|		ПО ВТ_ПеремещенияШапки.Ссылка = ВТ_ПеремещенияТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Перемещения.Номенклатура КАК Товар,
		|	ВТ_Перемещения.НоменклатураНаименованиеПолное КАК ТоварНаименование,
		|	ВЫБОР
		|		КОГДА &ТоварКод = ""Код""
		|			ТОГДА ВТ_Перемещения.НоменклатураКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураАртикул
		|	КОНЕЦ КАК ТоварКод,
		|	ВТ_Перемещения.ХарактеристикаНаименованиеПолное КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.УпаковкаЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.НоменклатураЕдиницаИзмерения)
		|	КОНЕЦ КАК ЕдиницаИзмеренияНаименование,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВТ_Перемещения.УпаковкаЕдиницаИзмеренияКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураЕдиницаИзмеренияКод
		|	КОНЕЦ КАК ЕдиницаИзмеренияКодПоОКЕИ,
		|	СУММА(ВТ_Перемещения.КоличествоУпаковок) КАК Количество,
		|	СУММА((ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2))) * ВТ_Перемещения.КоличествоУпаковок) КАК Сумма,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2)) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_Перемещения.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА (ВЫРАЗИТЬ(ВЫБОР
		|							КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|									ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
		|								ТОГДА ВТ_Перемещения.НоменклатураВес
		|							ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
		|						КОНЕЦ КАК ЧИСЛО(15, 3))) * ВТ_Перемещения.Количество
		|			ИНАЧЕ (ВЫРАЗИТЬ(ВЫБОР
		|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
		|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
		|							ТОГДА ВТ_Перемещения.НоменклатураВес
		|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
		|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ВТ_Перемещения.КоличествоУпаковок
		|		КОНЕЦ) КАК МассаБрутто,
		|	СУММА(ВТ_Перемещения.НоменклатураВес * ВТ_Перемещения.Количество) КАК МассаНетто,
		|	ВТ_Перемещения.СкладОтправитель КАК СкладОтправитель,
		|	ВТ_Перемещения.СкладПолучатель КАК СкладПолучатель,
		|	ВТ_Перемещения.Организация КАК Организация,
		|	ВТ_Перемещения.Дата КАК Дата,
		|	СкладыДополнительныеРеквизиты.Значение КАК АдресАлкогольногоСклада,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьТТНЕГАИС.Результат}}"" КАК Метка
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				&ТекущийПериод,
		|				ВидЦены В
		|						(ВЫБРАТЬ
		|							ВТ.СкладПолучательРозничныйВидЦены
		|						ИЗ
		|							ВТ_РозничныйВидЦены КАК ВТ)
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТ.Номенклатура
		|						ИЗ
		|							ВТ_ФильтрНоменклатуры КАК ВТ)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_Перемещения.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ВТ_Перемещения.СкладПолучательРозничныйВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВТ_Перемещения.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""вес брутто"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|		ПО (СкладыДополнительныеРеквизиты.Свойство = &СвойствоАдресАлкогольногоСклада)
		|			И ВТ_Перемещения.СкладОтправитель = СкладыДополнительныеРеквизиты.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Перемещения.Номенклатура,
		|	ВТ_Перемещения.ХарактеристикаНаименованиеПолное,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВТ_Перемещения.УпаковкаЕдиницаИзмеренияКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураЕдиницаИзмеренияКод
		|	КОНЕЦ,
		|	ВТ_Перемещения.СкладОтправитель,
		|	ВТ_Перемещения.СкладПолучатель,
		|	ВТ_Перемещения.Организация,
		|	ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Коэффициент, 1) * ЕСТЬNULL(ВТ_Перемещения.УпаковкаКоэффициент, 1) КАК ЧИСЛО(15, 2)),
		|	ВТ_Перемещения.НоменклатураНаименованиеПолное,
		|	ВЫБОР
		|		КОГДА &ТоварКод = ""Код""
		|			ТОГДА ВТ_Перемещения.НоменклатураКод
		|		ИНАЧЕ ВТ_Перемещения.НоменклатураАртикул
		|	КОНЕЦ,
		|	ВТ_Перемещения.Дата,
		|	СкладыДополнительныеРеквизиты.Значение,
		|	ВЫБОР
		|		КОГДА ВТ_Перемещения.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.УпаковкаЕдиницаИзмерения)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_Перемещения.НоменклатураЕдиницаИзмерения)
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Товар
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(АдресАлкогольногоСклада)
		|ПО
		|	Организация,
		|	СкладПолучатель,
		|	СкладОтправитель
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ТекущийПериод", ТекущаяДата());
		Запрос.УстановитьПараметр("ПеремещениеТоваров", МассивДокументов);
		Запрос.УстановитьПараметр("ТоварКод", ТоварКод);
		Запрос.УстановитьПараметр("СвойствоАдресАлкогольногоСклада",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Адрес алкогольного склада")); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ШаблонШтрихкодНакладной = "2#%1#" + "%2";//Формат(ТекущаяДата(), "ДФ = гг");
		
		Пока Выборка.Следующий() Цикл
			
			ГодДокументов = Формат(Выборка.Дата, "ДФ = гг");
			
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Выборка.Организация, ТекущаяДата());
			ВыборкаМагазинов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаМагазинов.Следующий() Цикл
				
				ОбщийПолучатель = ВыборкаМагазинов.СкладПолучатель;
				
				ВыборкаПолучателей.Сбросить();
				НомерДокументаСтрока="";
				ОбщийНомер="+";
				Пока ВыборкаПолучателей.НайтиСледующий(Новый структура("СкладПолучатель",ОбщийПолучатель)) Цикл
					// создадим строку номеров
					// выделим номер
					ЧастьНомера="";
					НомерДокумента = ВыборкаПолучателей.номер + " " + "от" + " " + Формат(ВыборкаПолучателей.Дата, "ДЛФ = Д");
					ДлинаНомера = стрдлина(НомерДокумента);
					Для сч = 0 по ДлинаНомера Цикл
						номерсимвола = длинаномера-сч;
						Сим = сред(НомерДокумента,номерсимвола,1);
						Если сим="-" Тогда
							прервать;
						КонецЕсли;
						ЧастьНомера = сим + ЧастьНомера ;
					КонецЦикла;
					// счас уберем левые нули
					Для сч=1 по стрдлина(частьномера) Цикл
						сим = сред(частьномера,сч,1);
						Если сим<>"0" Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если СокрЛП(частьномера) <> "" Тогда
						общийномер = общийномер + прав(ЧастьНомера,стрдлина(частьномера)-сч+1) + "+";
					КонецЕсли;
					НомерДокументаСтрока = НомерДокументаСтрока + ?(Не НомерДокументаСтрока = "", " / ", "") + НомерДокумента;
					
				КонецЦикла;
				
				ОбластьШапки.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
				//Удалить старая версия, Заполняем Штрихкод
				//ЗаполнитьШтрихКодОбласть(ОбластьШапки, ОбщийНомер, ВнешняяКомпонента);
				//Если СтруктураПараметров.ВыводитьШтрихкод Тогда
				ШтрихкодНакладной = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонШтрихкодНакладной
																							, СтрЗаменить(ВыборкаПолучателей.номер, "-", "")
																							, ГодДокументов);
																							
				
				ОбластьШапки.Параметры.ШтрихкодДокумента = ШтрихкодНакладной;
				//ЗаполнитьШтрихКодОбласть(ОбластьШапки, ШтрихкодНакладной);
				//КонецЕсли; 
				ОбластьШапки.Параметры.НомерДокумента = НомерДокументаСтрока;
				ТабДокумент.Вывести(ОбластьШапки);
				
				// начнем 
				ВыборкаСкладов = ВыборкаМагазинов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				ИтогоКоличество  = 0;
				ИтогоМассаБрутто = 0;
				ИтогоМассаНетто  = 0;
				ИтогоСумма       = 0;
				
				Пока ВыборкаСкладов.Следующий() Цикл
					ОбщийОтправитель = ВыборкаСкладов.СкладОтправитель;
					// напечатаем заголовок отгрузки со склада
					// ЛВО 18.08.2020 + возможность алкогольного склада +
					Если Не ПустаяСтрока(ВыборкаСкладов.АдресАлкогольногоСклада) тогда
						ОбластьСклада.параметры.ОтправительПодразделение = ВыборкаСкладов.АдресАлкогольногоСклада;
					Иначе	
						ОбластьСклада.параметры.ОтправительПодразделение = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(ОбщийОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);//ОбщийОтправитель;
					КонецЕсли;	
					ОбластьСклада.параметры.ПолучательПодразделение = ОбщийПолучатель;
					ТабДокумент.Вывести(ОбластьСклада);
					
					выборкаСтрокТовары = выборкаскладов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					КоличествоСтрок = ВыборкаСтрокТовары.Количество();
					
					Если КоличествоСтрок = 1 Тогда
						ПереноситьПоследнююСтроку = 0;
					Иначе
						ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
						ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
						ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
					КонецЕсли;
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					ИтогМассаБруттоПоСтранице    = 0;
					ИтогМассыНеттоПоСтранице     = 0;
					ИтогСуммыПоСтранице          = 0;
					
					// инициализация итогов по документу
					
					Ном = 0;
					НомерСтраницы=1;
					ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
					ТабДокумент.Вывести(ОбластьЗаголовка);
					
					Пока выборкаСтроктовары.Следующий() Цикл
						// будем выводить товары
						Ном = Ном + 1;
						//Начинаем новую страницу, Если предыдущая строка была последней на странице
						//или пора переносить последнюю строку на последнюю страницу с подвалом.
						ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
						
						Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
							или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
							
							ОбластьИтогоПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
							ОбластьИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
							
							ТабДокумент.Вывести(ОбластьИтогоПоСтранице);
							
							// инициализация итогов по странице
							ИтогКоличествоМестПоСтранице = 0;
							ИтогМассаБруттоПоСтранице    = 0;
							ИтогМассаНеттоПоСтранице     = 0;
							ИтогСуммыПоСтранице          = 0;
							
							НомерСтраницы = НомерСтраницы + 1;
							ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ОбластьЗаголовка.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
							ТабДокумент.Вывести(ОбластьЗаголовка);
							
						КонецЕсли;
						
						ОбластьСтроки.Параметры.Заполнить(ВыборкаСтрокТовары);
						
						КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
						
						ОбластьСтроки.Параметры.КоличествоМест    = КоличествоМест;
						
						ОбластьСтроки.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
						СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
						СокрЛП(ВыборкаСтрокТовары.Характеристика));
						
						Сумма = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
						
						ОбластьСтроки.Параметры.Сумма = Сумма;
						
						ТабДокумент.Вывести(ОбластьСтроки);
						
						// Обновим итоги по странице
						ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
						ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
						ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
						ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
						
						// Обновим итогов по документу
						ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
						ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
						ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
						ИтогоСумма       = ИтогоСумма       + Сумма;
						
					КонецЦикла;
					
				КонецЦикла;		
				// завершим печать накладной
				ОбластьИтогоПоСтранице.Параметры.ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице;
				ОбластьИтогоПоСтранице.Параметры.ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице;
				
				ТабДокумент.Вывести(ОбластьИтогоПоСтранице);
				
				// Выводим итоги по документу в целом
				ОбластьМакета = Макет.ПолучитьОбласть("Всего");
				ОбластьМакета.Параметры.ИтогоКоличествоМест = ИтогоКоличество;
				ОбластьМакета.Параметры.ИтогоМассаБрутто    = ИтогоМассаБрутто;
				ОбластьМакета.Параметры.ИтогоМассаНетто     = ИтогоМассаНетто;
				ОбластьМакета.Параметры.ИтогоСумма          = ИтогоСумма;
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				// Выводим подвал документа
				ОбластьМакета  = Макет.ПолучитьОбласть("Подвал");
				//ОбластьМакета.Параметры.Заполнить(Шапка);
				
				ОбластьМакета.Параметры.ДолжностьОтправителя = "Бухгалтер-оператор";
				// 12.05.2020 +
				СтрокаДоверенность = ПараметрыСеанса.ТекущийПользователь.Наименование;
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	ПользователиДополнительныеРеквизиты.Значение
				               |ИЗ
				               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
				               |ГДЕ
				               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
				               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
				Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
				Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
				РезультатДов = Запрос.Выполнить();
				Если не РезультатДов.Пустой() тогда
					ВыборкаДоверенность = РезультатДов.Выбрать();
					Пока ВыборкаДоверенность.Следующий() цикл
						 Доверенность = ВыборкаДоверенность.Значение;
					 КонецЦикла;
					 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
				КонецЕсли;	
				//-
				ОбластьМакета.Параметры.ФИООтправителя       = СтрокаДоверенность;//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикОтправитель);
				
				ОбластьМакета.Параметры.ДолжностьПолучателя  = "";//Шапка.ДолжностьКладовщикаПолучателя;
				ОбластьМакета.Параметры.ФИОПолучателя        = "";//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.КладовщикПолучатель);
				
				//Если ЗначениеЗаполнено(Шапка.УчетныйВидЦеныВалютаЦены) Тогда
				ОбластьМакета.Параметры.ИтогоСуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(Цел(ИтогоСумма),ВалютаЦены, Истина);
				//Иначе
				//	ОбластьМакета.Параметры.ИтогоСуммаПрописью = НСтр("ru = 'Ноль'");
				//КонецЕсли;
				
				ОбластьМакета.Параметры.ИтогоСуммаКоп      = Формат(Цел((ИтогоСумма-Цел(ИтогоСумма))*100), "ЧЦ=2; ЧН=00");
				
				ТабДокумент.Вывести(ОбластьМакета);
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	СохранитьДанныеОПечати(МассивПечать, "Торг 13", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьТОРГ13()


Функция СформироватьПечатнуюФормуЗаказПоставщику(МассивОбъектов, ОбъектыПечати = Неопределено, ВыводитьБлокВодитель = Ложь, Водитель = Неопределено)
	
	Тип = "ЗаказПоставщику";
	ОбъектыПечати = Новый СписокЗначений;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ИспользоватьРучныеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка КАК Ссылка,
	|	ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказПоставщику.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщику.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьНДС,
	|	ЗаказПоставщику.Организация.Префикс КАК Префикс,
	|	ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказПоставщику.БанковскийСчет КАК БанковскийСчет,
	|	ЗаказПоставщику.БанковскийСчет.ТекстКорреспондента КАК БанковскийСчетТекстКорреспондента,
	|	ЗаказПоставщику.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ЗаказПоставщику.Валюта КАК Валюта,
	|	ЗаказПоставщику.Менеджер.ФизическоеЛицо.Наименование КАК Менеджер,
	|	ЗаказПоставщику.ДополнительнаяИнформация КАК ДополнительнаяИнформация,
	|	ЗаказПоставщику.ЭтапыГрафикаОплаты.(
	|		ДатаПлатежа КАК ДатаПлатежа
	|	),
	|	ЗаказПоставщику.Товары.(
	|		НомерСтроки КАК НомерСтроки,
	|		НоменклатураПоставщика.Наименование КАК НаименованиеНоменклатурыПоставщика,
	|		НоменклатураПоставщика.Код КАК КодПоставщика,
	|		НоменклатураПоставщика.Артикул КАК АртикулПоставщика,
	|		Номенклатура КАК Номенклатура,
	|		УсловиеЦеныПоставщика КАК УсловиеЦеныПоставщика,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|		ВЫБОР
	|			КОГДА ЗаказПоставщику.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаказПоставщику.Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаказПоставщику.Товары.Упаковка.ЕдиницаИзмерения)
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		КоличествоУпаковок КАК Количество,
	|		Цена КАК Цена,
	|		СуммаРучнойСкидки КАК СуммаСкидки,
	|		ЗаказПоставщику.Товары.Сумма + ЗаказПоставщику.Товары.СуммаРучнойСкидки КАК СуммаБезСкидки,
	|		Сумма КАК Сумма,
	|		СуммаНДС КАК СуммаНДС,
	|		ДатаПоступления КАК ДатаПоступления,
	|		Характеристика.НаименованиеПолное КАК Характеристика,
	|		Отменено КАК Отменено
	|	),
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЗаказПоставщику.Склад
	|		ИНАЧЕ ЕСТЬNULL(СоответствиеТранзитныхСкладов.СкладТранзит, ЗаказПоставщику.Склад)
	|	КОНЕЦ КАК Склад,
	|	ЗаказПоставщику.ЖелаемаяДатаПоступления КАК ЖДП
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТранзитныхСкладов КАК СоответствиеТранзитныхСкладов
	|		ПО ЗаказПоставщику.Контрагент = СоответствиеТранзитныхСкладов.Отправитель
	|			И ЗаказПоставщику.Склад = СоответствиеТранзитныхСкладов.СкладПолучатель
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ПФ_MXL_ЗаказПоставщику");
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПоставщику_ЗаказПоставщику";
		
		ТаблицаТовары = ДанныеПечати.Товары.Выгрузить();
		ТаблицаТовары.Сортировать("НомерСтроки");
		
		ВыводитьУсловиеЦены = Ложь;
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			Если ЗначениеЗаполнено(СтрокаТовары.УсловиеЦеныПоставщика) Тогда
				ВыводитьУсловиеЦены = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьСкидки    = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ТаблицаТовары, ИспользоватьРучныеСкидки);
		КолонкаКодов  = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
		ВыводитьКоды  = ЗначениеЗаполнено(КолонкаКодов);
		
		Если ЕстьСкидки И ВыводитьУсловиеЦены Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСУсловиемСоСкидкой");
		ИначеЕсли ЕстьСкидки Или ВыводитьУсловиеЦены Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСУсловиемИлиСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
		
		Если Не ВыводитьКоды Тогда
			
			Если ЕстьСкидки И ВыводитьУсловиеЦены Тогда
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.35;
			ИначеЕсли ЕстьСкидки Или ВыводитьУсловиеЦены Тогда
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.2;
			Иначе
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.14;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьСкидки И ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловиемСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловиемСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловиемСоСкидкой|ТоварСУсловиемСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловиемСоСкидкой|ДанныеСУсловиемСоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСУсловиемИлиСоСкидкой");
			
		ИначеЕсли ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловием|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловием|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловием|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицыСУсловием|ДанныеСУсловиемИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
		
		// Заполнить реквизиты шапки
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		
		ТекстЗаголовка = "Заказ поставщику" + " № " + ДанныеПечати.Номер + " от " + Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'") + " г.";
		
		ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//+a.buganov@kdvm.ru 04.04.2018
		НомерШК = ДанныеПечати.Номер + "_" + Формат(ДанныеПечати.Дата, "ДФ='гг'");
		//Попытка
		//	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
		//Исключение
		//КонецПопытки;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШК");
		//ЗаполнитьШтрихКодОбласть(ОбластьМакета, НомерШК);
		
		Если ВыводитьБлокВодитель Тогда
			Шаблон = "Плановая дата поступления: %1" + Символы.ПС
			+ 		 "Водитель				   : %2" + Символы.ПС
			+		 "Телефон				   : %3" + Символы.ПС;
			
			Телефон	   = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Водитель, Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон",, Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица));
			Мобильный = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
			
			Телефоны = ?(ЗначениеЗаполнено(Телефон), Телефон + ", ", "")
						+ ?(ЗначениеЗаполнено(Мобильный), Мобильный, "");
						
			Если Прав(Телефоны, 2) = ", " Тогда
				Телефоны = Лев(Телефоны, СтрДлина(Телефоны) - 2);
			КонецЕсли;
			
			ТекстДоставка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон
																					, Формат(ДанныеПечати.ЖДП, "ДЛФ = Д")
																					, ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Водитель)
																					, Телефоны);
			ОбластьМакета.Параметры.Доставка = ТекстДоставка;																					
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		//- 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		
		СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
		
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ОбластьМакета.Параметры.Склад					= ДанныеПечати.Склад;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			
			ОбластьКодов.Параметры.ИмяКолонкиКодов = КолонкаКодов;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
			
		КонецЕсли;
		
		ОбластьТовар.Параметры.Товар = НСтр("ru='Товары (работы, услуги)'");
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки И ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловиемСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловиемСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловиемСоСкидкой|ТоварСУсловиемСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловиемСоСкидкой|ДанныеСУсловиемСоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ДанныеСУсловиемИлиСоСкидкой");
			
		ИначеЕсли ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловием|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловием|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловием|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицыСУсловием|ДанныеСУсловиемИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
		КонецЕсли;
		
		Сумма          = 0;
		СуммаНДС       = 0;
		ВсегоСкидок    = 0;
		ВсегоБезСкидок = 0;
		
		НомерСтроки = 0;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			Если СтрокаТовары.Отменено Тогда
				Продолжить;
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				
				ИмяКолонки = КолонкаКодов;
				Если Тип = "ЗаказПоставщикуПоДаннымПоставщика" Тогда
					ИмяКолонки = ИмяКолонки + "Поставщика";
				КонецЕсли;
				
				ОбластьКодов.Параметры.Артикул = СтрокаТовары[ИмяКолонки];
				ТабличныйДокумент.Присоединить(ОбластьКодов);
				
			КонецЕсли;
			
			Если Тип = "ЗаказПоставщикуПоДаннымПоставщика" Тогда
				ОбластьТовар.Параметры.Товар = СтрокаТовары.НаименованиеНоменклатурыПоставщика;
			Иначе
				ОбластьТовар.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СтрокаТовары.НаименованиеПолное, СтрокаТовары.Характеристика);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			ОбластьДанных.Параметры.Заполнить(СтрокаТовары);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + СтрокаТовары.Сумма;
			СуммаНДС       = СуммаНДС       + СтрокаТовары.СуммаНДС;
			
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + СтрокаТовары.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + СтрокаТовары.СуммаБезСкидки;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьСкидки И ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловиемСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловиемСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловиемСоСкидкой|ТоварСУсловиемСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловиемСоСкидкой|ДанныеСУсловиемСоСкидкой");
			
		ИначеЕсли ЕстьСкидки Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСУсловиемИлиСоСкидкой");
			
		ИначеЕсли ВыводитьУсловиеЦены Тогда
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловием|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловием|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловием|ТоварСУсловиемИлиСоСкидкой");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицыСУсловием|ДанныеСУсловиемИлиСоСкидкой");
			
		Иначе
			
			ОбластьНомера = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		Если ЕстьСкидки Тогда
			
			ОбластьДанных.Параметры.ВсегоСкидок    = ВсегоСкидок;
			ОбластьДанных.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
			
		КонецЕсли;
		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Вывести ИтогоНДС
		
		Если ДанныеПечати.УчитыватьНДС Тогда
			
			ОбластьНомера      = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
			ОбластьКодов       = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
			ОбластьТовар       = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
			ОбластьДанных      = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			ОбластьДанных.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
			ОбластьДанных.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
		КонецЕсли;
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %Количество%, на сумму %Сумма%'");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Количество%", НомерСтроки);
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%Сумма%",      ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		
		ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Если ЗначениеЗаполнено(ДанныеПечати.ДополнительнаяИнформация) Тогда
			
			ОбластьМакета                                    = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
			ОбластьМакета.Параметры.ДополнительнаяИнформация = ДанныеПечати.ДополнительнаяИнформация;
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		// Вывести подписи
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалЗаказа");
		ОбластьМакета.Параметры.ФИОМенеджер = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	СохранитьДанныеОПечати(МассивОбъектов, "Заказ поставщику", Неопределено, ТабличныйДокумент.КоличествоЭкземпляров);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФорму()

Функция ПолучитьНакладнуюНаПеремещение(СтрокаМарш, МассивОбъектов = Неопределено, ВыводитьБлокВодитель = Ложь)
	
	Если МассивОбъектов = Неопределено Тогда
		МассивОбъектов = Новый Массив;
		Для Каждого Эл Из СтрокаМарш.Строки Цикл
			Если Эл.Пометка = 1 И ЗначениеЗаполнено(Эл.Автомобиль)  Тогда
				
				Если (Эл.СкладWMS И НеПечататьЛистКомплектацииДляWMS) Тогда
					Продолжить;
				КонецЕсли;
				
				МассивОбъектов.Добавить(Эл.Автомобиль);
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	Колонка = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	ВыводитьКоды = ЗначениеЗаполнено(Колонка);
	
	ИспользоватьУпаковкиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Если ВыводНаПринтер Тогда
		ТабДокумент.ИмяПринтера = ПринтерПоУмолчанию;
	КонецЕсли;
	
	//ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 1;
	//ТабДокумент.РазмерКолонтитулаСверху             = 12;
	//ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
	//ТабДокумент.ВерхнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы] из [&СтраницВсего]";
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_Накладная";
	О = РеквизитФормыВЗначение("Объект");
	Макет = О.ПолучитьМакет("ПФ_MXL_НакладнаяНаПеремещение");
	
	ШиринаДок = 0;                 
	ШиринаТовары = 0;
	ОбластьЗаголовка  = Макет.ПолучитьОбласть("Заголовок");
	ШиринаДок = ШиринаДок + Макет.Области.НомерСтроки.ШиринаКолонки -  Макет.Области.Отступ.ШиринаКолонки;
	
	
	Если ВыводитьКоды Тогда
		ОбластьКодовШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
		ОбластьКодовШапка.Параметры.ИмяКолонкиКодов = Колонка;
		
		ОбластьКодовСтрока = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
		ОбластьКодовПодвал = Макет.ПолучитьОбласть("Подвал|КолонкаКодов");
		
		ШиринаДок = ШиринаДок + Макет.Области.КолонкаКодов.ШиринаКолонки;
	Иначе
		ОбластьТовары = Макет.Область("Товар");
		ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки + Макет.Область("КолонкаКодов").ШиринаКолонки;
		
		ШиринаТовары = ОбластьТовары.ШиринаКолонки; 
	КонецЕсли;
	
	Если ИспользоватьУпаковкиНоменклатуры Тогда
		ОбластьУпаковокШапка  =  Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаУпаковок");
		ОбластьУпаковокСтрока =  Макет.ПолучитьОбласть("Строка|КолонкаУпаковок");
		ОбластьУпаковокПодвал =  Макет.ПолучитьОбласть("Подвал|КолонкаУпаковок");
		ШиринаДок = ШиринаДок + Макет.Области.КолонкаУпаковок.ШиринаКолонки;
	Иначе
		ОбластьТовары = Макет.Область("Товар");
		ОбластьТовары.ШиринаКолонки = ОбластьТовары.ШиринаКолонки 
		+ Макет.Область("КолонкаУпаковокКоличество").ШиринаКолонки
		+ Макет.Область("КолонкаУпаковокПредставление").ШиринаКолонки;
	КонецЕсли;
	
	ШиринаТовары = Макет.Области.Товар.ШиринаКолонки;
	ШиринаДок = ШиринаДок + ШиринаТовары;
	
	ОбластьГруппировкаДокумент = Макет.ПолучитьОбласть("ГруппировкаДокумент");
	Макет.Области.Док.ШиринаКолонки = ШиринаДок;
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьДанныхШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьКонецСтрокиШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|КонецСтроки");
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка|Товар");
	ОбластьКонецСтрокиСтрока = Макет.ПолучитьОбласть("Строка|КонецСтроки");
	
	ОбластьНомераПодвал = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
	ОбластьДанныхПодвал = Макет.ПолучитьОбласть("Подвал|Товар");
	ОбластьКонецСтрокиПодвал = Макет.ПолучитьОбласть("Подвал|КонецСтроки");
	
	ОбластьПодписей = Макет.ПолучитьОбласть("Подписи");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.СкладОтправитель.Наименование КАК ОтправительПредставление,
	|	ПеремещениеТоваров.СкладПолучатель.Наименование КАК ПолучательПредставление,
	|	ПеремещениеТоваров.Организация.НаименованиеСокращенное КАК ОрганизацияПредставление,
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Товары.(
	|		Номенклатура КАК Товар,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|		Номенклатура.Код КАК Код,
	|		Номенклатура.Артикул КАК Артикул,
	|		Характеристика.НаименованиеПолное КАК Характеристика,
	|		ВЫБОР
	|			КОГДА ПеремещениеТоваров.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Товары.Упаковка)
	|		КОНЕЦ КАК ПредставлениеЕдининицыИзмеренияУпаковки,
	|		ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваров.Товары.Номенклатура.ЕдиницаИзмерения) КАК ПредставлениеБазовойЕдиницыИзмерения,
	|		КоличествоУпаковок КАК КоличествоУпаковок,
	|		Количество КАК Количество
	|	) КАК ТаблицаТовары,
	|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	|	ПеремещениеТоваров.ЗаказНаПеремещение.ЖелаемаяДатаПоступления КАК ЖДП
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(ОтправительПредставление),
	|	МАКСИМУМ(ПолучательПредставление),
	|	МАКСИМУМ(ОрганизацияПредставление),
	|	МАКСИМУМ(ЖДП)
	|ПО
	|	СкладПолучатель,
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаМагазин = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПервыйПроход = Истина;
	Пока ВыборкаМагазин.Следующий() Цикл
		Если Не ПервыйПроход Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		Иначе
			ПервыйПроход = Ложь;
		КонецЕсли;
		
		Ширина = 0;
		
		ОбластьЗаголовка.Параметры.ТекстЗаголовка = "Перемещение на" + " " + СокрЛП(ВыборкаМагазин.СкладПолучатель) + " " + "от" + " " + Формат(СтрокаМарш.ЗНО.ВремяВыезда, "ДФ = дд.ММ.гггг") + " " + "г.";
		ЗаполнитьЗначенияСвойств(ОбластьЗаголовка.Параметры, ВыборкаМагазин);
		
		//+a.buganov@kdvm.ru 04.04.2018
		НомерШК = СтрокаМарш.ЗНО.Номер;
		//Попытка
		//	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
		//Исключение
		//КонецПопытки;
		
		//ЗаполнитьШтрихКодОбласть(ОбластьЗаголовка, НомерШК);
		
		Если ВыводитьБлокВодитель Тогда
			Шаблон = "Плановая дата поступления: %1" + Символы.ПС
			+ "Водитель						   : %2" + Символы.ПС
			+ "Телефон						   : %3" + Символы.ПС;
			
			Телефон	   = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМарш.Водитель, Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон",, Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица));
			Мобильный = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМарш.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
			
			Телефоны = ?(ЗначениеЗаполнено(Телефон), Телефон + ", ", "")
						+ ?(ЗначениеЗаполнено(Мобильный), Мобильный, "");
						
			Если Прав(Телефоны, 2) = ", " Тогда
				Телефоны = Лев(Телефоны, СтрДлина(Телефоны) - 2);
			КонецЕсли;
			
			ТекстДоставка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон
																					, Формат(ВыборкаМагазин.ЖДП, "ДЛФ = Д")
																					, ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМарш.Водитель)
																					, Телефоны);
			ОбластьЗаголовка.Параметры.Доставка = ТекстДоставка;																					
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьЗаголовка);
		
		
		ТабДокумент.Вывести(ОбластьНомераШапка);
		
		//		//+a.buganov@kdvm.ru 04.04.2018
		//НомерШК = СтрокаМарш.ЗНО.Номер;
		//Попытка
		//	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
		//Исключение
		//КонецПопытки;
		//ОбластьШК = Макет.ПолучитьОбласть("ШК");
		//ЗаполнитьШтрихКодОбласть(ОбластьЗаголовка, НомерШК, ВнешняяКомпонента);
		//ТабДокумент.Вывести(ОбластьШК);
		
		
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовШапка);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанныхШапка);
		
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			ТабДокумент.Присоединить(ОбластьУпаковокШапка);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьКонецСтрокиШапка);
		
		ВыборкаДокумент = ВыборкаМагазин.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДокумент.Следующий() Цикл
			//ТабДокумент.Вывести(Макет.ПолучитьОбласть("ГруппировкаДокумент|Отступ"));
			ОбластьГруппировкаДокумент.Параметры.Документ = ВыборкаДокумент.Ссылка;
			ТабДокумент.Присоединить(ОбластьГруппировкаДокумент);
			
			ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				ВыборкаСтрокТовары = ВыборкаДетальныеЗаписи.ТаблицаТовары.Выбрать();
				Пока ВыборкаСтрокТовары.Следующий() Цикл
					
					ОбластьНомераСтрока.Параметры.НомерСтроки = ВыборкаСтрокТовары.НомерСтроки;
					ТабДокумент.Вывести(ОбластьНомераСтрока);
					
					Если ВыводитьКоды Тогда
						ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары[Колонка];
						ТабДокумент.Присоединить(ОбластьКодовСтрока);
					КонецЕсли;
					
					ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
					ОбластьДанныхСтрока.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
					СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
					СокрЛП(ВыборкаСтрокТовары.Характеристика));
					
					ТабДокумент.Присоединить(ОбластьДанныхСтрока);
					
					Если ИспользоватьУпаковкиНоменклатуры Тогда
						ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
						ТабДокумент.Присоединить(ОбластьУпаковокСтрока);
					КонецЕсли;
					
					ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
					ТабДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
					
					Если Не ТабДокумент.ПроверитьВывод(ОбластьКонецСтрокиСтрока) Тогда
						ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						
						ТабДокумент.Вывести(ОбластьНомераШапка);
						
						Если ВыводитьКоды Тогда
							ТабДокумент.Присоединить(ОбластьКодовШапка);
						КонецЕсли;
						
						ТабДокумент.Присоединить(ОбластьДанныхШапка);
						
						Если ИспользоватьУпаковкиНоменклатуры Тогда
							ТабДокумент.Присоединить(ОбластьУпаковокШапка);
						КонецЕсли;
						
						ТабДокумент.Присоединить(ОбластьКонецСтрокиШапка);
						
						ОбластьГруппировкаДокумент.Параметры.Документ = "" + ОбластьГруппировкаДокумент.Параметры.Документ + " / продолжение";
						ТабДокумент.Вывести(ОбластьГруппировкаДокумент);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьНомераПодвал);
		
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодвал);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанныхПодвал);
		
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			ТабДокумент.Присоединить(ОбластьУпаковокПодвал);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
		
		// Вывести подписи.
		ТабДокумент.Вывести(ОбластьПодписей);
		
	КонецЦикла;
	
	СохранитьДанныеОПечати(МассивОбъектов, "Накладная на перемещение", СтрокаМарш.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
	
	
	Шапка = Запрос.Выполнить().Выбрать();
	ПервыйДокумент = Истина;
	
	Пока Шапка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Выводим шапку накладной
		ОбластьЗаголовка.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Шапка, "Накладная на перемещение");
		ОбластьЗаголовка.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьЗаголовка);
		
		ТабДокумент.Вывести(ОбластьНомераШапка);
		
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовШапка);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанныхШапка);
		
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			ТабДокумент.Присоединить(ОбластьУпаковокШапка);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьКонецСтрокиШапка);
		
		// Выборка товаров
		ВыборкаСтрокТовары = Шапка.ТаблицаТовары.Выбрать();
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ОбластьНомераСтрока.Параметры.НомерСтроки = ВыборкаСтрокТовары.НомерСтроки;
			ТабДокумент.Вывести(ОбластьНомераСтрока);
			
			Если ВыводитьКоды Тогда
				ОбластьКодовСтрока.Параметры.Артикул = ВыборкаСтрокТовары[Колонка];
				ТабДокумент.Присоединить(ОбластьКодовСтрока);
			КонецЕсли;
			
			ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанныхСтрока.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
			СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
			СокрЛП(ВыборкаСтрокТовары.Характеристика));
			
			ТабДокумент.Присоединить(ОбластьДанныхСтрока);
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				ОбластьУпаковокСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
				ТабДокумент.Присоединить(ОбластьУпаковокСтрока);
			КонецЕсли;
			
			ОбластьКонецСтрокиСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьКонецСтрокиСтрока);
			
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьНомераПодвал);
		
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодвал);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанныхПодвал);
		
		Если ИспользоватьУпаковкиНоменклатуры Тогда
			ТабДокумент.Присоединить(ОбластьУпаковокПодвал);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьКонецСтрокиПодвал);
		
		// Вывести подписи.
		ТабДокумент.Вывести(ОбластьПодписей);
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	СохранитьДанныеОПечати(МассивОбъектов, "Накладная на перемещение", СтрокаМарш.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
	
КонецФункции

//печать алко
&НаСервере
Функция СформироватьПечатнуюФормуСправкаНаЭтиловыйСпирт(СтрокаМаршрута)
	
	МассивДокументов = Новый Массив;
	МассивСкладов = Новый Массив;
	
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			
			ТекПеремещение = СтрЗаказ.Автомобиль;
			
			Если НЕ ЭтоАлкоДокумент(ТекПеремещение) Тогда
				Продолжить;
			КонецЕсли; 
			
			МассивДокументов.Добавить(ТекПеремещение);
			СкладПолучатель = ПолучитьСкладПолучатель(ТекПеремещение);
			Если МассивСкладов.Найти(СкладПолучатель) = Неопределено Тогда
				МассивСкладов.Добавить(СкладПолучатель);
			КонецЕсли;
			
		
		КонецЕсли;
	КонецЦикла; 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Для Каждого ТекСклад Из МассивСкладов Цикл
		ВремМассивДокументов = Новый Массив;
		
		Для Каждого ТекДок Из МассивДокументов Цикл
			СкладПолучатель = ПолучитьСкладПолучатель(ТекДок);
			Если НЕ СкладПолучатель = ТекСклад Тогда
				Продолжить;
			КонецЕсли; 
			ВремМассивДокументов.Добавить(ТекДок);
		КонецЦикла; 
		
		ВремТабДок = ПолучитьПечатнуюФорму1_Т(ВремМассивДокументов);
		ТабДок.Вывести(ВремТабДок);
		
		// ЛВО 22.03.2021 +
		//ВремТабДок = ПолучитьПечатнуюФормуСправкаНаЭтиловыйСпирт(ВремМассивДокументов);
		//ТабДок.Вывести(ВремТабДок);
		//-
		СохранитьДанныеОПечати(ВремМассивДокументов, "Справка на этиловый спирт", СтрокаМаршрута.ЗНО, ТабДок.КоличествоЭкземпляров);
		
	КонецЦикла; 
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьПечатнуюФормуСправкаНаЭтиловыйСпирт(МассивОбъектов)
	
	ТоварКод = "Код";
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ПФ_MXL_СправкаНаЭтиловыйСпирт");
	МакетИмпорт = Обработка.ПолучитьМакет("ПФ_MXL_СправкаНаЭтиловыйСпиртИмпорт");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_СправкаНаАлкоголь";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 5;
	ТабДокумент.ПолеСлева  = 5;
	ТабДокумент.ПолеСнизу  = 5;
	ТабДокумент.ПолеСправа = 5;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Перемещение.Ссылка КАК Ссылка,
	|	Перемещение.Номер КАК Номер,
	|	Перемещение.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА Перемещение.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ Перемещение.ЗаказНаПеремещение.Номер
	|	КОНЕЦ КАК НомерЗаказа,
	|	Перемещение.Организация КАК Организация,
	|	Перемещение.Организация.Префикс КАК Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.СкладОтправитель) КАК ОтправительПодразделение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Перемещение.СкладПолучатель) КАК ПолучательПодразделение,
	|	Перемещение.СкладОтправитель.ТекущийОтветственный КАК КладовщикОтправитель,
	|	Перемещение.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщикаОтправителя,
	|	Перемещение.СкладПолучатель.ТекущийОтветственный КАК КладовщикПолучатель,
	|	Перемещение.СкладПолучатель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщикаПолучателя,
	|	Перемещение.ВидЦены КАК УчетныйВидЦены,
	|	Перемещение.ВидЦены.ВалютаЦены КАК УчетныйВидЦеныВалютаЦены
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка В(&МассивПеремещений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Номер
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Склад),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СкладыДополнительныеРеквизиты.Ссылка),
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Склад.ТекущийОтветственный),
	|	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного),
	|	NULL,
	|	NULL,
	|	РеализацияТоваровУслуг.Соглашение.ВидЦен,
	|	РеализацияТоваровУслуг.Валюта
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|		ПО РеализацияТоваровУслуг.Контрагент = СкладыДополнительныеРеквизиты.Значение
	|			И (СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Контрагент склада"")
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивПеремещений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Ссылка");
	Запрос.УстановитьПараметр("МассивПеремещений", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПеремещениеТоваровДатыВыпуска.Номенклатура КАК Товар,
	|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска,
	|	СУММА(ПеремещениеТоваровДатыВыпуска.Количество) КАК Количество,
	|	ПеремещениеТоваровДатыВыпуска.НомерПартии,
	|	ПеремещениеТоваровДатыВыпуска.Ссылка.Дата КАК ДатаОтгрузки,
	|	ПеремещениеТоваровДатыВыпуска.Ссылка.Номер КАК НомерОтгрузки,
	|	ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ) КАК ЭтоПомарочныйУчет
	|ИЗ
	|	Документ.ПеремещениеТоваров.ДатыВыпуска КАК ПеремещениеТоваровДатыВыпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаДокумента,
	|				(Номенклатура, ВидЦены) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						&УчетныйВидЦены
	|					ИЗ
	|						Документ.ПеремещениеТоваров.Товары КАК Т
	|					ГДЕ
	|						Т.Ссылка = &ПеремещениеТоваров)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПеремещениеТоваровДатыВыпуска.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.астСправкиАиБ_ЕГАИС КАК астСправкиАиБ_ЕГАИС
	|		ПО ПеремещениеТоваровДатыВыпуска.НомерПартии = астСправкиАиБ_ЕГАИС.Код
	|ГДЕ
	|	ПеремещениеТоваровДатыВыпуска.Ссылка = &ПеремещениеТоваров
	|	И ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровДатыВыпуска.Номенклатура,
	|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска,
	|	ПеремещениеТоваровДатыВыпуска.НомерПартии,
	|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное,
	|	ПеремещениеТоваровДатыВыпуска.Ссылка.Дата,
	|	ПеремещениеТоваровДатыВыпуска.Ссылка.Номер,
	|	ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДатыВыпуска.Номенклатура,
	|	РеализацияТоваровУслугДатыВыпуска.Номенклатура.НаименованиеПолное,
	|	РеализацияТоваровУслугДатыВыпуска.ДатаВыпуска,
	|	СУММА(РеализацияТоваровУслугДатыВыпуска.Количество),
	|	РеализацияТоваровУслугДатыВыпуска.НомерПартии,
	|	NULL,
	|	NULL,
	|	ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ)
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДатыВыпуска КАК РеализацияТоваровУслугДатыВыпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаДокумента,
	|				(Номенклатура, ВидЦены) В
	|					(ВЫБРАТЬ
	|						Т.Номенклатура,
	|						&УчетныйВидЦены
	|					ИЗ
	|						Документ.РеализацияТоваровУслуг.Товары КАК Т
	|					ГДЕ
	|						Т.Ссылка = &ПеремещениеТоваров)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО РеализацияТоваровУслугДатыВыпуска.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.астСправкиАиБ_ЕГАИС КАК астСправкиАиБ_ЕГАИС
	|		ПО РеализацияТоваровУслугДатыВыпуска.НомерПартии = астСправкиАиБ_ЕГАИС.Код
	|ГДЕ
	|	РеализацияТоваровУслугДатыВыпуска.Ссылка = &ПеремещениеТоваров
	|	И ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ) = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугДатыВыпуска.Номенклатура,
	|	РеализацияТоваровУслугДатыВыпуска.ДатаВыпуска,
	|	РеализацияТоваровУслугДатыВыпуска.НомерПартии,
	|	РеализацияТоваровУслугДатыВыпуска.Номенклатура.НаименованиеПолное,
	|	ЕСТЬNULL(астСправкиАиБ_ЕГАИС.ЭтоПомарочныйУчет, ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товар
	|АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ТоварКод", ТоварКод);
	
	Пока Шапка.Следующий() Цикл
		//Соловьев И.В. Не печатаем не проведенные документы
		Если НЕ Шапка.Ссылка.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + Шапка.Ссылка + ". Нельзя печатать не проведенные документы!");
			Продолжить;
		КонецЕсли; 
		//Соловеьв И.В.
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Запрос.УстановитьПараметр("ПеремещениеТоваров", Шапка.Ссылка);
		Запрос.УстановитьПараметр("ДатаДокумента", Шапка.ДатаДокумента);
		Запрос.УстановитьПараметр("УчетныйВидЦены", Шапка.УчетныйВидЦены);
		
		ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();
		
		// Выводим многострочную часть докмента
		
		ОбластьМакетаРоссия = Макет.ПолучитьОбласть("Основная");
		ОбластьМакетаИмпорт = МакетИмпорт.ПолучитьОбласть("Основная");
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			
			ОбъемДал = ПолучитьОбъемДал(ВыборкаСтрокТовары.Товар);
			Если ОбъемДал = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ВидПродукции = ПолучитьВидПродукции(ВыборкаСтрокТовары.Товар);
			Если ВидПродукции = 500 ИЛИ ВидПродукции = 510 ИЛИ ВидПродукции = 520 Или ВидПродукции = 261 Или ВидПродукции = 262 Или ВидПродукции = 263  Тогда
				Продолжить;
			КонецЕсли; 
			
			//умножим объем в ДАЛ на количество бутылок
			ОбъемДал = ОбъемДал*ВыборкаСтрокТовары.Количество;			
			
			//Вывести предыдущих поставщиков
			ЕстьРазделА = Ложь;
			ВывестиПредыдущихПоставщиков(ТабДокумент, ВыборкаСтрокТовары.Товар, ВыборкаСтрокТовары.ДатаВыпуска, ВыборкаСтрокТовары.НомерПартии, ЕстьРазделА);
			
			Если ЕстьРазделА Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				СтруктураОтвет = ПолучитьПринадлежностьАлкогольнойПродукции(ВыборкаСтрокТовары.Товар, ВыборкаСтрокТовары.ДатаВыпуска, ВыборкаСтрокТовары.НомерПартии);
				Если СтруктураОтвет.Импортный Тогда
					ОбластьМакета = ОбластьМакетаИмпорт;
				Иначе
					ОбластьМакета = ОбластьМакетаРоссия;
				КонецЕсли; 
				
				//Сторона склада
				СкладОтправитель= ПолучитьСкладПолучатель(Шапка.Ссылка, "Отправитель");
				// ЛВО 18.08.2020 +
				
				ЗапросАлкогольныйСклад =  Новый Запрос;
				ЗапросАлкогольныйСклад.Текст = "ВЫБРАТЬ
				               |	СкладыДополнительныеРеквизиты.Значение
				               |ИЗ
				               |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
				               |ГДЕ
				               |	СкладыДополнительныеРеквизиты.Ссылка = &Склад
				               |	И СкладыДополнительныеРеквизиты.Свойство = &СвойствоАдресАлкогольногоСклада";
				ЗапросАлкогольныйСклад.УстановитьПараметр("Склад",СкладОтправитель);
				ЗапросАлкогольныйСклад.УстановитьПараметр("СвойствоАдресАлкогольногоСклада",ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Адрес алкогольного склада"));
				РезультатАд = ЗапросАлкогольныйСклад.Выполнить();
				Если РезультатАд.Пустой() тогда
					АдресСклада = ПолучитьАдресМагазина(СкладОтправитель);
				Иначе
					ВыборкаАд = РезультатАд.Выбрать();
					Пока ВыборкаАд.Следующий() цикл
						АдресСклада = ВыборкаАд.Значение;
					КонецЦикла;					
				КонецЕсли;	
				//-	
				
				ОбластьМакета.Параметры.НаименованиеСклада	= АдресСклада;
				ОбластьМакета.Параметры.АдресСклада			= АдресСклада;
				ИНН = ПолучитьИННСклада(СкладОтправитель);
				КПП = ПолучитьКППСклада(СкладОтправитель);
				ОбластьМакета.Параметры.ИННКППСклада = ИНН +"/" + КПП;
				ОбластьМакета.Параметры.ЛицензияСкладаОтправитель = ПолучитьАлкогольнуюЛицензиюСклада(СкладОтправитель);
				
				//Сторона Магазина
				СкладПолучатель = ПолучитьСкладПолучатель(Шапка.Ссылка);
				ОбластьМакета.Параметры.НаименованиеМагазина = СкладПолучатель;
				АдресМагазина = ПолучитьАдресМагазина(СкладПолучатель);
				ОбластьМакета.Параметры.АдресМагазина = АдресМагазина;
				ИНН = ПолучитьИННСклада(СкладПолучатель);
				КПП = ПолучитьКППСклада(СкладПолучатель);
				ОбластьМакета.Параметры.ИННКПП = ИНН +"/" + КПП;
				ОбластьМакета.Параметры.ТоварНаименование = ВыборкаСтрокТовары.ТоварНаименование;
				ОбластьМакета.Параметры.ОбъемДал = ОбъемДал;
				ОбластьМакета.Параметры.Количество = ВыборкаСтрокТовары.Количество;
				Если СтруктураОтвет.Импортный Тогда
					ОбластьМакета.Параметры.ДатаВвоза = Формат(СтруктураОтвет.ДатаВвоза, "ДЛФ=DD");
					ОбластьМакета.Параметры.КодСтраны = СтруктураОтвет.КодСтраны;
					ОбластьМакета.Параметры.НомерСправкиКТД = СтруктураОтвет.НомерСправкиКТД;
				Иначе
					ОбластьМакета.Параметры.ДатаОтгрузки = Формат(ВыборкаСтрокТовары.ДатаОтгрузки, "ДЛФ=DD");
					ОбластьМакета.Параметры.НомерДокумента = ВыборкаСтрокТовары.НомерОтгрузки;
				КонецЕсли; 
				ОбластьМакета.Параметры.ЛицензияСклада = ПолучитьАлкогольнуюЛицензиюСклада(СкладПолучатель);
				ТабДокумент.Вывести(ОбластьМакета);
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции	

&НаСервере
Функция ЭтоАлкоДокумент(ТекДок)
	
	Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если ТекДок.ЗаказНаПеремещение.УчетВЕГАИС Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	Иначе
		Если ТекДок.ЗаказКлиента.УчетВЕГАИС Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
КонецФункции 

&НаСервере
Функция ПолучитьОбъемДал(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Объем продукции (дал)""";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьВидПродукции(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВЫРАЗИТЬ(НоменклатураДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов).Вес КАК ЧИСЛО(5, 2)) КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Ссылка
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вид алкогольной продукции""";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ВывестиПредыдущихПоставщиков(ТабДок, Товар, ДатаВыпуска, НомерПартии, ЕстьРазделА)
	
	МассивАдресов = ПолучитьИзДопХранилища(Товар, ДатаВыпуска, НомерПартии);
	
	Для Каждого АдресВоВременномХранилище Из МассивАдресов Цикл
		НачальноеПоложениеКартинки = ТабДок.ВысотаТаблицы + 1;
		КонечноеПоложениеКартинки = ТабДок.ВысотаТаблицы + 90;  //90 165
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		Если Не ПустаяСтрока(АдресВоВременномХранилище) Тогда
			ДвоичныеДанныеКартинки = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			Если ДвоичныеДанныеКартинки = Неопределено Тогда
				Продолжить;
			КонецЕсли; 
			Попытка
				ДДКартинки = Новый Картинка (ДвоичныеДанныеКартинки);
			Исключение
				ТекстОшибки = "Не удалось вывести Раздел А Для "+ Символы.ПС + "Товар: "+СокрЛП(Товар)+ Символы.ПС + "Выпуск: "+ДатаВыпуска + Символы.ПС + "Партия: "+ НомерПартии;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Продолжить;
			КонецПопытки;
		КонецЕсли; 
		
		Попытка
			
			Рисунок = ТабДок.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рисунок.ГраницаСверху = Ложь;
			Рисунок.ГраницаСлева = Ложь;
			Рисунок.ГраницаСнизу = Ложь;
			Рисунок.ГраницаСправа = Ложь;
			Индекс = ТабДок.Рисунки.Индекс(Рисунок);
			ТабДок.Рисунки[Индекс].Картинка = ДДКартинки;
			ТабДок.Рисунки[Индекс].Расположить(ТабДок.Область("R" + Формат(НачальноеПоложениеКартинки,"ЧГ=0") + "C1:R" + Формат(КонечноеПоложениеКартинки, "ЧГ=0") + "C19"));  //57
			
			ЕстьРазделА = Истина;
			
		Исключение
			ТекстОшибки = "Не удалось вывести Раздел А Для: "+СокрЛП(Товар)+" выпуск "+ДатаВыпуска+" " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПринадлежностьАлкогольнойПродукции(Ссылка, ДатаВыпуска, НомерПартии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ЕСТЬNULL(ДопРеквизиты_Импортный.Значение, ЛОЖЬ) КАК Импортный,
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Комментарий КАК НомерСправкиКТД,
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопДата КАК ДатаВвоза,
	|	ДополнительныеСведения.Значение КАК СтранаПроизВодитель
	|ИЗ
	|	(ВЫБРАТЬ
	|		СпрНоменклатура.Ссылка КАК Номенклатура
	|	ИЗ
	|		Справочник.Номенклатура КАК СпрНоменклатура
	|	ГДЕ
	|		СпрНоменклатура.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДопРеквизиты_Импортный
	|		ПО ВложенныйЗапрос.Номенклатура = ДопРеквизиты_Импортный.Ссылка
	|			И (ДопРеквизиты_Импортный.Свойство.Наименование = ""ИмпортныйАлкоголь"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации.ДополнительныеСведения КАК ХранилищеДополнительнойИнформацииДополнительныеСведения
	|		ПО ВложенныйЗапрос.Номенклатура = ХранилищеДополнительнойИнформацииДополнительныеСведения.Объект
	|			И (ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ВидДанных = 0)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ВложенныйЗапрос.Номенклатура = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Наименование = ""СтранаПроисхождения"")
	|ГДЕ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата = &ДатаВыпуска
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 = """"
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер = &КодСправкиА";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаВыпуска", ДатаВыпуска);
	КодСправкиА = ПолучитьКодСправкиА(Ссылка, ДатаВыпуска, НомерПартии);
	Если ТипЗнч(КодСправкиА) = Тип("Строка") Тогда
		Запрос.УстановитьПараметр("КодСправкиА", КодСправкиА);
	Иначе
		Запрос.УстановитьПараметр("КодСправкиА", КодСправкиА.Код);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Структура("Импортный, КодСтраны, НомерСправкиКТД, ДатаВвоза", Ложь);
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ПустаяСтрока(ВыборкаДетальныеЗаписи.СтранаПроизВодитель) Тогда
			СтранаПроизВодительКодАльфа2 = ВыборкаДетальныеЗаписи.СтранаПроизВодитель.КодАльфа2;
		Иначе
			СтранаПроизВодительКодАльфа2 = "";
		КонецЕсли; 
		
		Возврат Новый Структура("Импортный, КодСтраны, НомерСправкиКТД, ДатаВвоза", 
		ВыборкаДетальныеЗаписи.Импортный, СтранаПроизВодительКодАльфа2, ВыборкаДетальныеЗаписи.НомерСправкиКТД, ВыборкаДетальныеЗаписи.ДатаВвоза);
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьСкладПолучатель(ДокументПеремещение, ТипСклада = "Получатель")
	
	Если ТипЗнч(ДокументПеремещение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Если ТипСклада = "Получатель" Тогда
			Возврат ДокументПеремещение.СкладПолучатель;
		Иначе
			Возврат ДокументПеремещение.СкладОтправитель;
		КонецЕсли; 
	Иначе
		Возврат НайтиСкладКонтрагента(ДокументПеремещение.Контрагент);
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ПолучитьАлкогольнуюЛицензиюСклада(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Наименование = ""АлкогольнаяЛицензияСклада""";
	
	Запрос.УстановитьПараметр("Объект", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецФункции // ПолучитьЛицензиюСклада(Шапка.Ссылка.СкладПолучатель);()

&НаСервере
Функция ПолучитьИзДопХранилища(Номенклатура, ДатаВыпуска = Неопределено, НомерПартии = Неопределено)
	МассивАдресов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата КАК ДатаРозлива,
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ХранилищеВСтроке КАК АдресВоВременномХранилище,
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 КАК КодСправкиБ,
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер КАК КодСправкиА
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации.ДополнительныеСведения КАК ХранилищеДополнительнойИнформацииДополнительныеСведения
	|ГДЕ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.Объект = &Объект
	|	И НАЧАЛОПЕРИОДА(ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата, ДЕНЬ) = &Дата
	|	И НЕ ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ВидДанных = 0
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 = &НомерПартии";
	
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	
	Если ДатаВыпуска = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НАЧАЛОПЕРИОДА(ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата, ДЕНЬ) = &Дата", "");
	Иначе
		Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаВыпуска));
	КонецЕсли; 
	Если НомерПартии = Неопределено ИЛИ НомерПартии = "#$888" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 = &НомерПартии", "");
	Иначе
		Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() И ЗначениеЗаполнено(ДатаВыпуска) Тогда
		
		Если НомерПартии = "#$888" Тогда
			ТекстСообщения = "Не найдено справки на: '" + Номенклатура + "', по дате розлива: " + Формат(ДатаВыпуска, "ДФ=dd.MM.yyyy");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат ПолучитьИзДопХранилища(Номенклатура);	
		Иначе
			ТекстСообщения = "Не найдено справки на: '" + Номенклатура + "', по дате розлива: " + Формат(ДатаВыпуска, "ДФ=dd.MM.yyyy") + " и № партии: " + НомерПартии;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат ПолучитьИзДопХранилища(Номенклатура, ДатаВыпуска, "#$888");	
		КонецЕсли; 
		
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ПолучилСправкуА = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Попытка
			Если НЕ ПолучилСправкуА И НЕ ПустаяСтрока(ВыборкаДетальныеЗаписи.КодСправкиА) Тогда
				МассивСправокА = ПолучитьСправкуА(Номенклатура, ДатаВыпуска, ВыборкаДетальныеЗаписи.КодСправкиА);
				Для Каждого ТекСтр Из МассивСправокА Цикл
					АдресВоВременномХранилище_СправкиА = ПоместитьВоВременноеХранилище(ТекСтр.Получить());
					МассивАдресов.Добавить(АдресВоВременномХранилище_СправкиА);
				КонецЦикла; 
				ПолучилСправкуА = Истина;
			КонецЕсли; 
			
			АдресВоВременномХранилище =  ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.АдресВоВременномХранилище.Получить());
			МассивАдресов.Добавить(АдресВоВременномХранилище);
		Исключение
			ТекстСообщения = "Нет справок Для " + Номенклатура;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			ТекстСообщения = ТекстСообщения + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("Ошибка получения справки по алкоголю", УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
		КонецПопытки;		
		
	КонецЦикла;
	
	Возврат МассивАдресов;
КонецФункции

&НаСервере
Функция ПолучитьСправкуА(Номенклатура, ДатаВыпуска, КодСправкиА)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ХранилищеВСтроке КАК АдресВоВременномХранилище
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации.ДополнительныеСведения КАК ХранилищеДополнительнойИнформацииДополнительныеСведения
	|ГДЕ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.Объект = &Объект
	|	И НАЧАЛОПЕРИОДА(ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата, ДЕНЬ) = &Дата
	|	И НЕ ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ВидДанных = 0
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер = &НомерПартии
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 = &ДопНомер1";
	
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаВыпуска));
	Если ТипЗнч(КодСправкиА) = Тип("Строка") Тогда
		Запрос.УстановитьПараметр("НомерПартии", КодСправкиА);
	иначе
		Запрос.УстановитьПараметр("НомерПартии", КодСправкиА.Код);
	КонецЕсли; 
	Запрос.УстановитьПараметр("ДопНомер1",  "");
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивСправок = Новый массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСправок.Добавить(ВыборкаДетальныеЗаписи.АдресВоВременномХранилище);
	КонецЦикла;
	
	Возврат МассивСправок;
КонецФункции 

&НаСервере
Функция ПолучитьКодСправкиА(Номенклатура, ДатаВыпуска, НомерПартии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер КАК КодСправкиА
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации.ДополнительныеСведения КАК ХранилищеДополнительнойИнформацииДополнительныеСведения
	|ГДЕ
	|	ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.Объект = &Объект
	|	И НАЧАЛОПЕРИОДА(ХранилищеДополнительнойИнформацииДополнительныеСведения.Дата, ДЕНЬ) = &Дата
	|	И НЕ ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.Ссылка.ВидДанных = 0
	|	И ХранилищеДополнительнойИнформацииДополнительныеСведения.ДопНомер1 = &НомерПартии";
	
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаВыпуска));
	Запрос.УстановитьПараметр("НомерПартии", НомерПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КодСправкиА;
КонецФункции 

//конец печать алко

//печать приложение МЛ
&НаСервере 
Функция СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОбъектов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (МассивОбъектов.Найти(СтрЗаказ.Автомобиль)=Неопределено) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивОбъектов.Добавить(СтрЗаказ.Автомобиль);
		КонецЕсли;	
	КонецЦикла;	
	
	//ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ПриложениеКМаршрутномуЛисту");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ПриложениеКМаршрутномуЛисту";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 2;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.КоличествоЭкземпляров = МассивСкладов.Количество();
	//ТабДокумент.КоличествоЭкземпляров = 1;
	ШтрихкодНакладной = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаМаршрута.ЗНО, "Номер");	
	Если Ложь Тогда //МЛ печатается в Ах
		ТаблицаШтрихкодовДокументов = НайтиШтрихкодДокументов(МассивОбъектов);
		Если ТаблицаШтрихкодовДокументов = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Печать приложения не возможна! Сначала необходимо напечатать маршрутный лист!");
			Возврат ТабДокумент;
		КонецЕсли; 
		ШтрихкодНакладной = ТаблицаШтрихкодовДокументов[0]; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
		|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
		|	ПеремещениеТоваров.СкладПолучатель.РозничныйВидЦены КАК СкладПолучательРозничныйВидЦены,
		|	ПеремещениеТоваров.Организация КАК Организация,
		|	ПеремещениеТоваров.Водитель КАК Водитель,
		|	ПеремещениеТоваров.Автомобиль КАК Автомобиль,
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.ВТ_ПеремещенияШапки}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияШапки
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваровТовары.Ссылка,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Номенклатура.Код,
		|	ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения,
		|	ПеремещениеТоваровТовары.Количество,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.ВТ_ПеремещенияВсеТовары}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияВсеТовары
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПеремещенияВсеТовары.Ссылка,
		|	ВТ_ПеремещенияВсеТовары.Номенклатура,
		|	ВТ_ПеремещенияВсеТовары.НоменклатураКод,
		|	ВТ_ПеремещенияВсеТовары.НоменклатураЕдиницаИзмерения,
		|	ВТ_ПеремещенияВсеТовары.Количество,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.ВТ_ПеремещенияТовары}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_ПеремещенияТовары
		|ИЗ
		|	ВТ_ПеремещенияВсеТовары КАК ВТ_ПеремещенияВсеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО (НоменклатураСегмента.Сегмент = &Сегмент)
		|			И ВТ_ПеремещенияВсеТовары.Номенклатура = НоменклатураСегмента.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПеремещенияШапки.Ссылка,
		|	ВТ_ПеремещенияШапки.СкладПолучатель,
		|	ВТ_ПеремещенияШапки.СкладПолучательРозничныйВидЦены,
		|	ВТ_ПеремещенияШапки.Организация,
		|	ВТ_ПеремещенияШапки.Водитель,
		|	ВТ_ПеремещенияШапки.Автомобиль,
		|	ВТ_ПеремещенияТовары.Номенклатура,
		|	ВТ_ПеремещенияТовары.Количество,
		|	ВТ_ПеремещенияТовары.НоменклатураКод,
		|	ВТ_ПеремещенияТовары.НоменклатураЕдиницаИзмерения,
		|	ЛОЖЬ КАК ХозТовары,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.ВТ_Перемещения}}"" КАК Метка
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	ВТ_ПеремещенияШапки КАК ВТ_ПеремещенияШапки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПеремещенияТовары КАК ВТ_ПеремещенияТовары
		|		ПО ВТ_ПеремещенияШапки.Ссылка = ВТ_ПеремещенияТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		| 
		|ВЫБРАТЬ
		|	ВТ_ПеремещенияШапки.Ссылка,
		|	ВТ_ПеремещенияШапки.СкладПолучатель,
		|	ВТ_ПеремещенияШапки.СкладПолучательРозничныйВидЦены,
		|	ВТ_ПеремещенияШапки.Организация,
		|	ВТ_ПеремещенияШапки.Водитель,
		|	ВТ_ПеремещенияШапки.Автомобиль,
		|	ВТ_ПеремещенияВсеТовары.Номенклатура,
		|	ВТ_ПеремещенияВсеТовары.Количество,
		|	ВТ_ПеремещенияВсеТовары.НоменклатураКод,
		|	ВТ_ПеремещенияВсеТовары.НоменклатураЕдиницаИзмерения,
		|	ИСТИНА КАК ХозТовары,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.ВТ_Перемещения}}"" КАК Метка
		|ИЗ
		|	ВТ_ПеремещенияВсеТовары КАК ВТ_ПеремещенияВсеТовары 
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПеремещенияШапки КАК ВТ_ПеремещенияШапки
		|		ПО ВТ_ПеремещенияШапки.Ссылка = ВТ_ПеремещенияВсеТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		|		ПО (НоменклатураСегмента.Сегмент = &Сегмент)
		|			И ВТ_ПеремещенияВсеТовары.Номенклатура = НоменклатураСегмента.Номенклатура
		|ГДЕ 
		|	ВТ_ПеремещенияШапки.СкладОтправитель = &СкладХозТовары
		|	И НоменклатураСегмента.Номенклатура ЕСТЬ NULL	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Перемещения.СкладПолучатель КАК СкладПолучатель,
		|	ВТ_Перемещения.Номенклатура КАК Номенклатура,
		|	ВТ_Перемещения.Количество КАК Количество,
		|	ВТ_Перемещения.Организация КАК Организация,
		|	ВТ_Перемещения.Водитель КАК Водитель,
		|	ВТ_Перемещения.Автомобиль КАК Автомобиль,
		|	ВТ_Перемещения.Ссылка КАК Ссылка,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Цена * ВТ_Перемещения.Количество КАК Сумма,
		|	ВТ_Перемещения.НоменклатураКод,
		|	ВТ_Перемещения.НоменклатураЕдиницаИзмерения,
		|	ВТ_Перемещения.ХозТовары,
		|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.СформироватьПечатнуюФормуПриложениеКМаршрутномуЛисту.Результат}}"" КАК Метка
		|ИЗ
		|	ВТ_Перемещения КАК ВТ_Перемещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_Перемещения.СкладПолучательРозничныйВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|			И ВТ_Перемещения.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладПолучатель,
		|	Номенклатура
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Водитель),
		|	МАКСИМУМ(Автомобиль),
		|	МАКСИМУМ(Ссылка),
		|	СУММА(Цена),
		|	СУММА(Сумма)
		|ПО
		|	СкладПолучатель,
		|	ХозТовары,
		|	Номенклатура ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("СкладХозТовары", Справочники.Склады.НайтиПоНаименованию("НСК Хоз. товары (WMS) - ТЛМ2"));
	Запрос.УстановитьПараметр("Сегмент", Справочники.СегментыНоменклатуры.НайтиПоКоду("01-00000727"));
	
	ГруппаТара = Справочники.Номенклатура.НайтиПоКоду("99-00000114");
	ГруппаХозТовары = Справочники.Номенклатура.НайтиПоКоду("01-00010827"); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСкладПолучатель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСкладПолучатель.Следующий() Цикл
		
		ВыборкаХозТовары = ВыборкаСкладПолучатель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаХозТовары.Следующий() Цикл
			
			ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
			СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ВыборкаХозТовары.Организация, ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыборкаХозТовары.Ссылка, "Дата"));
			ОбластьМакета.Параметры.Организация					= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.Приложение					= "Приложение к Маршрутному листу №" + Лев(ШтрихкодНакладной,11);
			ОбластьМакета.Параметры.Склад						= "В магазин " + ВыборкаХозТовары.СкладПолучатель;
			ОбластьМакета.Параметры.ШтрихкодМаршрутногоЛиста	= ШтрихкодНакладной;
			ОбластьМакета.Параметры.ФИОВодителя					= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель)
				+ ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), " / " + Символы.ПС + ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
			ОбластьМакета.Параметры.ГосНомерТС					= СтрокаМаршрута.Автомобиль.Код;
			//ЗаполнитьШтрихКодОбласть(ОбластьМакета, ШтрихкодНакладной);
			ОбластьМакета.Параметры.ХозТовары = ?(ВыборкаХозТовары.ХозТовары, "(хоз. товары)", "");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
			ОбластьИтог = Макет.ПолучитьОбласть("Итог");
			
			ВыборкаНоменклатура = ВыборкаХозТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			КоличествоВГруппе = 0;
			ВывестиИтог = Ложь;
			
			Если ВыборкаХозТовары.ХозТовары Тогда
				НПП = 1;
			КонецЕсли;
			
			Пока ВыборкаНоменклатура.Следующий() Цикл
				Если Не ВыборкаХозТовары.ХозТовары И ((ВыборкаНоменклатура.Уровень() = 3 и Не ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыборкаНоменклатура.Номенклатура, "Родитель") = ГруппаТара) Или ВыборкаНоменклатура.Номенклатура = ГруппаТара) Тогда
					Если ВывестиИтог тогда
						
						ОбластьИтог.Параметры.ИтогКоличество = КоличествоВГруппе;
						ТабДокумент.Вывести(ОбластьИтог);
						КоличествоВГруппе = 0;
						ВывестиИтог = Ложь;
					КонецЕсли;
					
					НПП = 1;
					ОбластьГруппа.Параметры.Группа = ВыборкаНоменклатура.Номенклатура;
					ТабДокумент.Вывести(ОбластьГруппа);
				ИначеЕсли НЕ ВыборкаНоменклатура.Номенклатура.ЭтоГруппа Тогда
					ОбластьСтрока.Параметры.НПП = НПП;
					ОбластьСтрока.Параметры.Заполнить(ВыборкаНоменклатура);
					ТабДокумент.Вывести(ОбластьСтрока);
					НПП = НПП + 1;
					
					КоличествовГруппе = КоличествоВГруппе+ВыборкаНоменклатура.Количество;
					ВывестиИтог = Истина;
				КонецЕсли; 
			КонецЦикла;
				
			ОбластьИтог.Параметры.ИтогКоличество = КоличествоВГруппе;
			ТабДокумент.Вывести(ОбластьИтог);
			
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			ТабДокумент.Вывести(ОбластьМакета);
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции
//конец печать приложение МЛ

//печать ТТН
&НаСервере
Функция СформироватьПечатнуюФорму1_Т(СтрокаМаршрута)
	
	МассивДокументов = Новый Массив;
	МассивСкладов = Новый Массив;
	
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			
			ТекПеремещение = СтрЗаказ.Автомобиль;
			
			Если НЕ ЭтоАлкоДокумент(ТекПеремещение) Тогда
				Продолжить;
			КонецЕсли; 
			
			МассивДокументов.Добавить(ТекПеремещение);
			СкладПолучатель = ПолучитьСкладПолучатель(ТекПеремещение);
			Если МассивСкладов.Найти(СкладПолучатель) = Неопределено Тогда
				МассивСкладов.Добавить(СкладПолучатель);
			КонецЕсли;
			
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент = Истина И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
			СкладПолучатель = ПолучитьСкладПолучатель(СтрЗаказ.ЗНО);
			Если МассивСкладов.Найти(СкладПолучатель) = Неопределено Тогда
				МассивСкладов.Добавить(СкладПолучатель);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Для Каждого ТекСклад Из МассивСкладов Цикл
		ВремМассивДокументов = Новый Массив;
		
		Для Каждого ТекДок Из МассивДокументов Цикл
			СкладПолучатель = ПолучитьСкладПолучатель(ТекДок);
			Если НЕ СкладПолучатель = ТекСклад Тогда
				Продолжить;
			КонецЕсли; 
			ВремМассивДокументов.Добавить(ТекДок);
		КонецЦикла; 
		
		
		ВремТабДок = ПолучитьПечатнуюФорму1_Т(ВремМассивДокументов);
		ТабДок.Вывести(ВремТабДок);
		
	КонецЦикла; 
	
	СохранитьДанныеОПечати(МассивДокументов, "ТТН", СтрокаМаршрута.ЗНО, ТабДок.КоличествоЭкземпляров);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьПечатнуюФорму1_Т(МассивОбъектов) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСверху = 0;
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСнизу = 0;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	// ЛВО 4.04.2022+
	//ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();	
	//-

	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТТН";
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ПФ_MXL_ТТН");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК ДатаДокумента,
	|	ПеремещениеТоваров.Проведен КАК Проведен,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.Организация.ТекущийГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.Организация.ТекущийРуководитель КАК РукоВодитель,
	|	ПеремещениеТоваров.Организация.ТекущаяДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПеремещениеТоваров.БанковскийСчетОрганизации,
	|	ПеремещениеТоваров.БанковскийСчетПеревозчика,
	|	ПеремещениеТоваров.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваров.СкладПолучатель,
	|	ЛОЖЬ КАК ОбобщенныйДокумент,
	|	NULL КАК КонтрагентИНН,
	|	NULL КАК КонтрагентКПП,
	|	NULL КАК Контрагент
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.Проведен,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Организация.ТекущийРуководитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя,
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетПеревозчика,
	|	РеализацияТоваровУслуг.Склад,
	|	СкладыДополнительныеРеквизиты.Ссылка,
	|	ЛОЖЬ,
	|	NULL,
	|	NULL,
	|	NULL
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|		ПО РеализацияТоваровУслуг.Контрагент = СкладыДополнительныеРеквизиты.Значение
	|			И (СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Контрагент склада"")
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Проведен,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер,
	|	ЗаказКлиента.Организация.ТекущийРуководитель,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаказКлиента.Склад,
	|	ЕСТЬNULL(СкладыДополнительныеРеквизиты.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	|	ЕСТЬNULL(КонтрагентыДополнительныеРеквизиты.Значение, ЛОЖЬ),
	|	ЗаказКлиента.Контрагент.ИНН,
	|	ЗаказКлиента.Контрагент.КПП,
	|	ЗаказКлиента.Контрагент
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|		ПО ЗаказКлиента.Контрагент = СкладыДополнительныеРеквизиты.Значение
	|			И (СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Контрагент склада"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	|		ПО ЗаказКлиента.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
	|			И (КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""ОбобщённыйДокумент"")
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка КАК Ссылка,
	|	ВТ.Номер,
	|	ВТ.ДатаДокумента КАК ДатаДокумента,
	|	ВТ.Проведен КАК Проведен,
	|	ВТ.Организация,
	|	ВТ.Префикс,
	|	ВТ.ГлавныйБухгалтер,
	|	ВТ.РукоВодитель,
	|	ВТ.ДолжностьРуководителя,
	|	ВТ.БанковскийСчетОрганизации,
	|	ВТ.БанковскийСчетПеревозчика,
	|	ВТ.Склад,
	|	ВТ.СкладПолучатель,
	|	ВТ.ОбобщенныйДокумент,
	|	ВТ.КонтрагентИНН,
	|	ВТ.КонтрагентКПП,
	|	ВТ.Контрагент,
	|	СкладыДополнительныеРеквизиты.Значение КАК АдресАлкогольногоСклада
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|		ПО ВТ.Склад = СкладыДополнительныеРеквизиты.Ссылка
	|			И (СкладыДополнительныеРеквизиты.Свойство = &СвойствоАдресАлкогольногоСклада)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Ссылка");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("СвойствоАдресАлкогольногоСклада", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Адрес алкогольного склада"));
	Шапка = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура КАК Товар,
	|	ПеремещениеТоваровТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ПеремещениеТоваровТовары.Номенклатура.Код КАК ТоварКод,
	|	ПеремещениеТоваровТовары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения)
	|	КОНЕЦ КАК БазоваяЕдиницаНаименование,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Упаковка.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ПеремещениеТоваровТовары.Номенклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|	ПеремещениеТоваровТовары.КоличествоУпаковок КАК Количество,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваровТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес * ПеремещениеТоваровТовары.Количество / 1000
	|		ИНАЧЕ ПеремещениеТоваровТовары.Упаковка.Вес * ПеремещениеТоваровТовары.КоличествоУпаковок / 1000
	|	КОНЕЦ КАК МассаБрутто,
	|	ПеремещениеТоваровТовары.Номенклатура.Вес * ПеремещениеТоваровТовары.Количество / 1000 КАК МассаНетто,
	|	ПеремещениеТоваровТовары.Номенклатура.Артикул КАК Артикул,
	|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьПечатнуюФорму1_Т.втПеремещениеТовары}}"" КАК Метка
	|ПОМЕСТИТЬ втПеремещениеТовары
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &ПеремещениеТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеремещениеТовары.Товар КАК Товар,
	|	втПеремещениеТовары.ТоварНаименование КАК ТоварНаименование,
	|	втПеремещениеТовары.ТоварКод КАК ТоварКод,
	|	втПеремещениеТовары.Характеристика КАК Характеристика,
	|	втПеремещениеТовары.БазоваяЕдиницаНаименование КАК БазоваяЕдиницаНаименование,
	|	втПеремещениеТовары.ЕдиницаИзмеренияКодПоОКЕИ КАК ЕдиницаИзмеренияКодПоОКЕИ,
	|	втПеремещениеТовары.Количество КАК Количество,
	|	втПеремещениеТовары.МассаБрутто КАК МассаБрутто,
	|	втПеремещениеТовары.МассаНетто КАК МассаНетто,
	|	втПеремещениеТовары.Артикул КАК Артикул,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * втПеремещениеТовары.Количество КАК Сумма,
	|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьПечатнуюФорму1_Т.Результат}}"" КАК Метка
	|ИЗ
	|	втПеремещениеТовары КАК втПеремещениеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО втПеремещениеТовары.Товар = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код,
	|	РеализацияТоваровУслугТовары.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Упаковка.ЕдиницаИзмерения.Код
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес * РеализацияТоваровУслугТовары.Количество / 1000
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Упаковка.Вес * РеализацияТоваровУслугТовары.КоличествоУпаковок / 1000
	|	КОНЕЦ,
	|	РеализацияТоваровУслугТовары.Номенклатура.Вес * РеализацияТоваровУслугТовары.Количество / 1000,
	|	РеализацияТоваровУслугТовары.Номенклатура.Артикул,
	|	РеализацияТоваровУслугТовары.Цена,
	|	РеализацияТоваровУслугТовары.Сумма,
	|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьПечатнуюФорму1_Т.Результат}}""
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &ПеремещениеТоваров
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
	|	ЗаказКлиентаТовары.Номенклатура.Код,
	|	ЗаказКлиентаТовары.Характеристика.НаименованиеПолное,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения)
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка <> ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения.Код
	|		ИНАЧЕ ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Код
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.Количество / 1000
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Вес * ЗаказКлиентаТовары.КоличествоУпаковок / 1000
	|	КОНЕЦ,
	|	ЗаказКлиентаТовары.Номенклатура.Вес * ЗаказКлиентаТовары.Количество / 1000,
	|	ЗаказКлиентаТовары.Номенклатура.Артикул,
	|	ЗаказКлиентаТовары.Цена,
	|	ЗаказКлиентаТовары.Сумма,
	|	""{{ВнешняяОбработка.АРМОператораОтгрузки.Форма.ПолучитьПечатнуюФорму1_Т.Результат}}""
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ПеремещениеТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	втПеремещениеТовары.Товар
	|ИТОГИ ПО
	|	Товар ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	
	// ЛВО 4.04.2022+
	ШаблонШтрихкодНакладной = "2#%1#" + "%2";
	//-
	
	Пока Шапка.Следующий() Цикл
		Если НЕ Шапка.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ " + Строка(Шапка.Ссылка) + " пропущен, Нельзя печатать не проведенные документы!");
			Продолжить;
		КонецЕсли; 
		
		// ЛВО 4.04.2022+
		ГодДокументов = Формат(Шапка.ДатаДокумента, "ДФ = гг");
		//-
		
		Запрос.УстановитьПараметр("ПеремещениеТоваров", Шапка.Ссылка);
		Запрос.УстановитьПараметр("Период",  Шапка.ДатаДокумента);    
		Запрос.УстановитьПараметр("ВидЦены", ОбщегоНазначения.ПолучитьЗначениеРеквизита(Шапка.СкладПолучатель, "УчетныйВидЦены"));
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		// Выводим общие реквизиты шапки.
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		//СведенияОПокупателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента,, Шапка.БанковскийСчетКонтрагента);
		
		ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		
		СкладОтправитель = ПолучитьСкладПолучатель(Шапка.Ссылка, "Отправитель");
		ИНН = ПолучитьИННСклада(СкладОтправитель);
		КПП = ПолучитьКППСклада(СкладОтправитель);
		
		// ЛВО 18.08.2020 +  Возможность алкогольного склада
		Если  НЕ ПустаяСтрока(Шапка.АдресАлкогольногоСклада) тогда
			АдресСклада = Шапка.АдресАлкогольногоСклада;
		Иначе
			
			АдресСклада = ПолучитьАдресМагазина(СкладОтправитель);		
		КонецЕсли;
		// -

		
		ПредставлениеОрганизации  = "" + Шапка.Организация + ", ИНН/КПП: " + ИНН + "/" + КПП + "  " + АдресСклада;
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
		
		ОбластьМакета.Параметры.НомерДокумента           = Шапка.Номер;
		ОбластьМакета.Параметры.ДатаДокумента            = Шапка.ДатаДокумента;
		
		//ЛВО 04.04.2022 +
		ШтрихкодНакладной = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонШтрихкодНакладной
																							, СтрЗаменить(Шапка.номер, "-", "")
																							, ГодДокументов);
		ОбластьМакета.Параметры.ШтрихкодДокумента = ШтрихкодНакладной;
		//ЗаполнитьШтрихКодОбласть(ОбластьМакета, ШтрихкодНакладной);
		//-
		
		//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, 
		//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
		
		СкладПолучатель = ПолучитьСкладПолучатель(Шапка.Ссылка);
		АдресСклада = ПолучитьАдресМагазина(СкладПолучатель);
		КодМагазинаСклада = ПолучитьКодМагазинаСклада(СкладПолучатель);
		Если Не ПустаяСтрока(КодМагазинаСклада) Тогда
			КодМагазинаСклада = СтрШаблон(" (%1)", КодМагазинаСклада);
		КонецЕсли;
			
		Если Шапка.ОбобщенныйДокумент ТОгда
			
			ПредставлениеГрузополучателя = "" + Шапка.Контрагент + ", ИНН/КПП: " + Шапка.КонтрагентИНН + "/" + Шапка.КонтрагентКПП + " " + Строка(АдресСклада) + КодМагазинаСклада;
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ПредставлениеГрузополучателя;
			
			СведенияОКонтрагенте = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента);
			ОбластьМакета.Параметры.ПредставлениеПлательщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКонтрагенте);
			ОбластьМакета.Параметры.ГрузополучательПоОКПО    = СведенияОКонтрагенте.КодПоОКПО;
			ОбластьМакета.Параметры.ПлательщикПоОКПО         = СведенияОКонтрагенте.КодПоОКПО;
	
		Иначе
			
			ИНН = ПолучитьИННСклада(СкладПолучатель);
			КПП = ПолучитьКППСклада(СкладПолучатель);
			
			ПредставлениеГрузополучателя = "" + Шапка.Организация + ", ИНН/КПП: " + ИНН + "/" + КПП + " " + АдресСклада + КодМагазинаСклада;
			ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ПредставлениеГрузополучателя;
			ОбластьМакета.Параметры.ПредставлениеПлательщика     = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
			ОбластьМакета.Параметры.ГрузополучательПоОКПО        = СведенияОбОрганизации.КодПоОКПО;
			ОбластьМакета.Параметры.ПлательщикПоОКПО             = СведенияОбОрганизации.КодПоОКПО;
	
		КонецЕсли;
		
		ОбластьМакета.Параметры.ОрганизацияПоОКПО          = СведенияОбОрганизации.КодПоОКПО;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СтрокНаСтранице = 70;  //23
		СтрокШапки      = 10;
		СтрокПодвала    = 9;
		НомерСтраницы   = 1;
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
		ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
		
		КоличествоСтрок = Выборка.Количество();
		КоличествоНаименований = КоличествоСтрок;
		
		Если КоличествоСтрок = 1 Тогда
			ПереноситьПоследнююСтроку = 0;
		Иначе
			ЦелыхСтраницСПодвалом     = Цел((СтрокШапки + КоличествоСтрок + СтрокПодвала) / СтрокНаСтранице);
			ЦелыхСтраницБезПодвала    = Цел((СтрокШапки + КоличествоСтрок - 1) / СтрокНаСтранице);
			ПереноситьПоследнююСтроку = ЦелыхСтраницСПодвалом - ЦелыхСтраницБезПодвала;
		КонецЕсли;
		
		// инициализация итогов по странице
		ИтогКоличествоМестПоСтранице = 0;
		ИтогМассаБруттоПоСтранице    = 0;
		ИтогМассыНеттоПоСтранице     = 0;
		ИтогСуммыПоСтранице          = 0;
		
		// инициализация итогов по документу
		ИтогоКоличество  = 0;
		ИтогоМассаБрутто = 0;
		ИтогоМассаНетто  = 0;
		ИтогоСумма       = 0;
		
		Ном = 0;
		
		// Выводим многострочную часть докмента
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
		
		Пока Выборка.Следующий() Цикл
			ВыборкаСтрокТовары = Выборка.Выбрать();
			КоличествоНаименований = Шапка.Ссылка.Товары.Количество();
			
			Пока ВыборкаСтрокТовары.Следующий() Цикл
				Если ВыборкаСтрокТовары.Товар.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли; 
				Ном = Ном + 1;
				
				//Начинаем новую страницу, Если предыдущая строка была последней на странице
				//или пора переносить последнюю строку на последнюю страницу с подвалом.
				ЦелаяСтраница = (СтрокШапки + Ном - 1) / СтрокНаСтранице;
				
				Если (ЦелаяСтраница = Цел(ЦелаяСтраница))
					или ((ПереноситьПоследнююСтроку = 1) и (Ном = КоличествоСтрок)) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.ИтогоКоличествоНаСтранице	   = ИтогКоличествоМестПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогоМестНаСтранице		   = ИтогМассаБруттоПоСтранице;
					ОбластьИтоговПоСтранице.Параметры.ИтогоСуммаНаСтранице         = ИтогСуммыПоСтранице;
					
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// инициализация итогов по странице
					ИтогКоличествоМестПоСтранице = 0;
					ИтогМассаБруттоПоСтранице    = 0;
					ИтогМассаНеттоПоСтранице     = 0;
					ИтогСуммыПоСтранице          = 0;
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
					
				КонецЕсли;
				
				ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
				
				КоличествоМест = Формат(ВыборкаСтрокТовары.Количество, "ЧЦ=15; ЧДЦ=3");
				
				ОбластьМакета.Параметры.КоличествоМест    = КоличествоМест;
				
				ОбластьМакета.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
				СокрЛП(ВыборкаСтрокТовары.ТоварНаименование),
				СокрЛП(ВыборкаСтрокТовары.Характеристика));
				
				Попытка
					Сумма = ВыборкаСтрокТовары.Количество * ВыборкаСтрокТовары.Цена;
				Исключение
					Сумма = 0;
				КонецПопытки;
				
				ОбластьМакета.Параметры.Сумма = Сумма;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				// Обновим итоги по странице
				ИтогКоличествоМестПоСтранице = ИтогКоличествоМестПоСтранице + ВыборкаСтрокТовары.Количество;
				ИтогМассаБруттоПоСтранице    = ИтогМассаБруттоПоСтранице    + ВыборкаСтрокТовары.МассаБрутто;
				ИтогМассыНеттоПоСтранице     = ИтогМассыНеттоПоСтранице     + ВыборкаСтрокТовары.МассаНетто;
				ИтогСуммыПоСтранице          = ИтогСуммыПоСтранице          + Сумма;
				
				// Обновим итогов по документу
				ИтогоКоличество  = ИтогоКоличество  + ВыборкаСтрокТовары.Количество;
				ИтогоМассаБрутто = ИтогоМассаБрутто + ВыборкаСтрокТовары.МассаБрутто;
				ИтогоМассаНетто  = ИтогоМассаНетто  + ВыборкаСтрокТовары.МассаНетто;
				ИтогоСумма       = ИтогоСумма       + Сумма;
				
			КонецЦикла;	
		КонецЦикла;	
		
		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьИтоговПоСтранице.Параметры.ИтогоКоличествоНаСтранице	 = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогоМестНаСтранице			 = ИтогКоличествоМестПоСтранице;
		ОбластьИтоговПоСтранице.Параметры.ИтогоСуммаНаСтранице         = ИтогСуммыПоСтранице;
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.ИтогоКоличество		= ИтогоКоличество;
		ОбластьМакета.Параметры.ИтогоМест			= ИтогоКоличество;
		ОбластьМакета.Параметры.ИтогоСумма          = ИтогоСумма;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		////
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		
		ОбластьМакета.Параметры.ДатаДокументаДень = Формат(Шапка.ДатаДокумента, "ДФ=dd");
		ОбластьМакета.Параметры.ДатаДокументаМесяц = Формат(Шапка.ДатаДокумента, "ДФ=MM");
		ОбластьМакета.Параметры.ДатаДокументаГод =  Формат(Шапка.ДатаДокумента, "ДФ=yyyy");
		
		// Главный бухгалтер
		// ЛВО 12.05.2020 проверка доверенности +
		СтрокаДоверенность =  ПараметрыСеанса.ТекущийПользователь.Наименование;
		ЗапросДов = Новый Запрос;
		ЗапросДов.Текст = "ВЫБРАТЬ
		               |	ПользователиДополнительныеРеквизиты.Значение
		               |ИЗ
		               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
		               |ГДЕ
		               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
		               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
		ЗапросДов.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
		ЗапросДов.УстановитьПараметр("Свойство", "Информация о доверенности");
		РезультатДов = ЗапросДов.Выполнить();
		Если не РезультатДов.Пустой() тогда
			ВыборкаДоверенность = РезультатДов.Выбрать();
			Пока ВыборкаДоверенность.Следующий() цикл
				 Доверенность = ВыборкаДоверенность.Значение;
			 КонецЦикла;
			 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
		КонецЕсли;
		
		//-

		
		ОбластьМакета.Параметры.ФИОГлавБухгалтера =СтрокаДоверенность; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.ГлавныйБухгалтер); // ЛВО 12.05.2020
		ОбластьМакета.Параметры.ФИОРуководителя = СтрокаДоверенность;//ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Шапка.РукоВодитель); // ЛВО 12.05.2020

		ОбластьМакета.Параметры.ДолжностьРуководителя ="бухгалтер-оператор"; //Шапка.ДолжностьРуководителя;  ЛВО 12.05.2020
		
		//ОбластьМакета.Параметры.ФИОКладовщика = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица((Шапка.Кладовщик);
		//ОбластьМакета.Параметры.ДолжностьКладовщика = ДанныеПечати.ДолжностьКладовщика;
		
		// Доверенность
		//ОбластьМакета.Параметры.ДоверенностьНомер     = ДанныеПечати.ДоверенностьНомер;
		//ОбластьМакета.Параметры.ДоверенностьДата      = Формат(ДанныеПечати.ДоверенностьДата, "ДФ='дд ММММ гггг'");
		//ОбластьМакета.Параметры.ДоверенностьВыдана    = ДанныеПечати.ДоверенностьВыдана;
		//ОбластьМакета.Параметры.ДоверенностьЧерезКого = ДанныеПечати.ДоверенностьЛицо;
		
		//Если ИтоговыеСуммы.ИтогоМест > 0 Тогда
		//	ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоМест, ,",,,,,,,,0");
		//КонецЕсли;
		
		Если  ИтогоМассаБрутто > 0 Тогда
			ОбластьМакета.Параметры.МассаГрузаБрутто = ИтогоМассаБрутто;
			ОбластьМакета.Параметры.МассаГрузаБруттоПрописью = ЧислоПрописью(Окр(ИтогоМассаБрутто*1000),"НП=Ложь",",,,,,,,,0")+ " кг.";
		КонецЕсли;
		
		Если ИтогоМассаНетто > 0 Тогда
			ОбластьМакета.Параметры.МассаГрузаНетто = ИтогоМассаНетто;
			ОбластьМакета.Параметры.МассаГрузаНеттоПрописью = ЧислоПрописью(Окр(ИтогоМассаНетто*1000),"НП=Ложь",",,,,,,,,0")+ " кг.";
		КонецЕсли;
		
		ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ЧислоПрописью(КоличествоНаименований, ,",,,,,,,,0");
		ОбластьМакета.Параметры.ВсегоНаименованийПрописью = ЧислоПрописью(КоличествоНаименований, ,",,,,,,,,0");
		ОбластьМакета.Параметры.СуммаПрописью = РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтогоСумма, Константы.ВалютаРегламентированногоУчета.Получить());
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//Транспортный раздел
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ОбластьМакета = Макет.ПолучитьОбласть("ТранспортныйРаздел");
		///////
		
		//Соловьев И.В.
		//СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Грузоотправитель, Шапка.ДатаДокумента,,Шапка.БанковскийСчетГрузоотправителя);
		//СведенияОЗаказчикеПеревозок = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Грузополучатель, Шапка.ДатаДокумента,,Шапка.БанковскийСчетГрузоПолучателя);
		ОбластьМакета.Параметры.НомерДокумента = Шапка.Номер;
		
		//СведенияОПокупателе       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Контрагент, Шапка.ДатаДокумента,, Шапка.БанковскийСчетКонтрагента);
		//ОбластьМакета.Параметры.ПредставлениеЗаказчикаПеревозок	 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, 
		//	"ПолноеНаименование,ЮридическийАдрес,Телефоны");
		АдресПунктПогрузки = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.Склад, 
		Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес склада", ,Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Склады""")));
		ТелефонПунктПогрузки = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.Склад, 
		Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон склада", ,Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Склады""")));
		
        // ЛВО 18.08.2020 +  Возможность алкогольного склада
		Если  НЕ ПустаяСтрока(Шапка.АдресАлкогольногоСклада) тогда
			ОбластьМакета.Параметры.ПунктПогрузки = Шапка.АдресАлкогольногоСклада;
		Иначе
			
			ОбластьМакета.Параметры.ПунктПогрузки	 = АдресПунктПогрузки + " ; " + ТелефонПунктПогрузки;		
		КонецЕсли;
		// -

		
		
		АдресПунктРазгрузки = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.СкладПолучатель, 
		Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес склада", ,Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Склады""")));
		ТелефонПунктРазгрузки = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Шапка.СкладПолучатель, 
		Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон склада", ,Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Склады""")));
		
		ОбластьМакета.Параметры.ПунктРазгрузки	 = АдресПунктРазгрузки + " ; " + ТелефонПунктРазгрузки;
		
		//ОбластьМакета.Параметры.ПунктРазгрузки	 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОЗаказчикеПеревозок, 
		//"ФактическийАдрес");
		
		
		////////////
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("СведенияОГрузе");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСведенийОГрузе");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПогрузочныеОперации");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ПрочиеСведения");
		ТабличныйДокумент.Вывести(ОбластьМакета);	
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьИННСклада(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Наименование = ""ИНН""";
	
	Запрос.УстановитьПараметр("Объект", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьКППСклада(Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство.Наименование = ""КПП""";
	
	Запрос.УстановитьПараметр("Объект", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЦикла;
	
КонецФункции
//конец печать ТТН

//печать транс накладная
&НаСервере
функция ПолучитьТранспортнуюНакладную(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;	
	
	
	МассивСкладов = Новый Массив;
	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе
			
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда
					
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда
						
						МассивСкладов.Добавить(ТекДок.Контрагент);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаМаршрута.ЗНО, "Номер"));

	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная");
	Область1 = Макет.ПолучитьОбласть("лицеваясторона1");
	Область2 = Макет.ПолучитьОбласть("лицеваясторона2");
	Область3 = Макет.ПолучитьОбласть("лицеваясторона3");
	Область4 = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Номер
	|	КОНЕЦ КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Дата
	|	КОНЕЦ КАК ДатаЗаказа,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация КАК Грузополучатель,
	|	ПеремещениеТоваров.Организация КАК Грузоотправитель,
	|	ПеремещениеТоваров.Организация КАК Контрагент,
	|	ПеремещениеТоваров.Организация КАК ЗаказчикПеревозок,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущийОтветственный КАК Кладовщик,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПеремещениеТоваров.Организация.ТекущийРукоВодитель КАК РукоВодитель,
	|	ПеремещениеТоваров.Организация.ТекущаяДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПеремещениеТоваров.Организация.ТекущийГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.Перевозчик КАК Перевозчик,
	|	ПеремещениеТоваров.Водитель КАК Водитель,
	|	СкладыКонтактнаяОтправитель.Представление КАК ПунктПогрузки,
	|	СкладыКонтактнаяПолучатель.Представление КАК ПунктРазгрузки,
	|	ПеремещениеТоваров.СрокДоставки КАК СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто КАК ВесНетто,
	|	ПеремещениеТоваров.Автомобиль КАК Автомобиль,
	|	ПеремещениеТоваров.СкладОтправитель КАК Отправитель,
	|	ПеремещениеТоваров.СкладПолучатель КАК Получатель,
	|	ЕСТЬNULL(ЗаказНаПеремещениеДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК Дефростация
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяПолучатель
	|		ПО ПеремещениеТоваров.СкладПолучатель = СкладыКонтактнаяПолучатель.Ссылка
	|			И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ПеремещениеТоваров.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ПеремещениеТоваровТовары.Количество) КАК ВесНетто,
	|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ПеремещениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.ДополнительныеРеквизиты КАК ЗаказНаПеремещениеДополнительныеРеквизиты
	|		ПО ПеремещениеТоваров.ЗаказНаПеремещение = ЗаказНаПеремещениеДополнительныеРеквизиты.Ссылка
	|			И (ЗаказНаПеремещениеДополнительныеРеквизиты.Свойство.Наименование = ""Дефростация"")
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	"""",
	|	"""",
	|	ЗаказКлиента.Организация.ТекущийРукоВодитель,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер,
	|	&Перевозчик,
	|	&Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	"""",
	|	ВложенныйЗапрос.ВесНетто,
	|	&Автомобиль,
	|	ЗаказКлиента.Склад,
	|	ЗаказКлиента.Контрагент,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|			И ЗаказКлиента.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ЗаказКлиентаТовары.Количество) КАК ВесНетто,
	|			ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказКлиентаТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаказКлиента.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			И ЗаказКлиента.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Дата
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Склад.ТекущийОтветственный,
	|	РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Перевозчик,
	|	РеализацияТоваровУслуг.Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяПолучатель.Представление,
	|	РеализацияТоваровУслуг.СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто,
	|	РеализацияТоваровУслуг.Автомобиль,
	|	РеализацияТоваровУслуг.Склад,
	|	РеализацияТоваровУслуг.Контрагент,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяПолучатель
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяПолучатель.Ссылка
	|			И (КонтрагентыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО РеализацияТоваровУслуг.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * РеализацияТоваровУслугТовары.Количество) КАК ВесНетто
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО РеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|ИТОГИ ПО
	|	ПунктРазгрузки";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	//
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
	//ПунктПогрузки = "Новосибирская обл, Новосибирск г, Карьер Мочище мкр, Кубовая ул, дом № 68";
	
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО
	Если Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаОтгрузкуЗаказы.Склад
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез.Склад) Тогда
				СкладОтправитель = Рез.Склад;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
		Если КодУзла = "000" Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
		Иначе
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
		КонецЕсли;
		
	КонецЕсли;
	
	//АдресГрузоОтправителя =УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
	//АдресГрузоОтправителя = ПолучитьАдресМагазина(СкладОтправитель);
	//
	//КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
	//Если КодУзла = "000" Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
	//Иначе
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
	//КонецЕсли; 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	//КонецЕсли;

	ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
	//
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	// Аникин 15.02.2022 17:20:10 -->
	ДанныеДляПечати.Колонки.Добавить("ПунктПогрузки");
	СкладНКЗЗаморозка = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	СкладНСКЗаморозка = Справочники.Склады.НайтиПоНаименованию("НСК Заморозка (WMS) - ТЛМ2");
	СкладПолучательКемерово = Справочники.Склады.НайтиПоНаименованию("Кемерово");
	СкладПолучательНовокузнецк = Справочники.Склады.НайтиПоНаименованию("Новокузнецк");
	// <-- Аникин 15.02.2022 17:20:10
	СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.ЗНО.Перевозчик, ТекущаяДата());
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		// Аникин 15.02.2022 17:20:10 -->
		НоваяСтрока.ПунктПогрузки = ПунктПогрузки;
		// <-- Аникин 15.02.2022 17:20:10
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0; 
				
		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа;
			
			Если ВесПогрузки = 0 тогда
				Область1.параметры.Пункт0_Номер = "ТН"+ОбщаяВыборка.НомерЗаказа;
				Область1.параметры.Пункт0_Дата = Формат(ТекущаяДата(), "ДЛФ=Д");
			КонецЕсли;
			
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель =  ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик =       ОбщаяВыборка.Перевозчик;
			ОбщийВодитель = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			
			// Аникин 15.02.2022 18:24:46 -->
			ПодменаСкладОтправитель = СкладОтправитель;
			// v.nagaycev@kdvm.ru 08.08.2023 закомментировал, Женя Сидоренко попросила
			//Если ОбщаяВыборка.Дефростация = ЛОЖЬ Тогда
			//	Если ОбщаяВыборка.Отправитель = СкладНСКЗаморозка Тогда
			//		Если ТипЗнч(ОбщаяВыборка.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			//			СкладПолучатель = ОбщаяВыборка.Получатель;
			//			Если СкладПолучатель.Родитель = СкладПолучательКемерово ИЛИ СкладПолучатель.Родитель = СкладПолучательНовокузнецк Тогда
			//				ПодменаСкладОтправитель = СкладНКЗЗаморозка;
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			// <-- Аникин 15.02.2022 18:24:46
				
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		// Аникин 15.02.2022 18:24:46 -->
		Если СкладОтправитель <> ПодменаСкладОтправитель Тогда
			НоваяСтрока.ПунктПогрузки = ПолучитьАдресМагазина(ПодменаСкладОтправитель);
		КонецЕсли;
		// <-- Аникин 15.02.2022 18:24:46
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		// 18.01.2021 +
		Попытка
			Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				
			Иначе
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			КонецЕсли;
		Исключение
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		КонецПопытки;
		
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
	
		//-
		
		
		Если ИнойПеревозчикЧерезКаргомарт тогда
			Область1.Параметры.Пункт1_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Справочники.Контрагенты.НайтиПоНаименованию("Бриджтаун фудс ЗАО"), ТекущаяДата()), 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Область1.Параметры.Пункт1а_1 = ПредставлениеГрузоотправителя;
			Область1.Параметры.Пункт1_3 = Истина;
		Иначе	
			Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				//ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				//"ПолноеНаименование,ИНН,ФактическийАдрес");
				Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
				//Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			Иначе
				//ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				//"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				////ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				Область1.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				//Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	//Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 ="";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1	= "ТОРГ-13 № "+СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1+Символы.ПС;
		КонецЕсли;
		Пункт4_1	=Пункт4_1 + "ТОРГ-12 № "+СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	
	//Область1.Параметры.Пункт4_3 = СтрокаЗаказов; 
	//ОбластьМакета.Параметры.Пункт6_5	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" кг.";
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ПараметрыСеанса.ТекущийПользователь.Наименование;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	//-
	
	Если НЕ ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		ТелефонВодителя        = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2       = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
		Если не ЗначениеЗаполнено(СтрокаМаршрута.Водитель2) тогда
			ПодписьВодителя = "Водитель ______________("+ПредставлениеВодителя+")";
		Иначе
			ПодписьВодителя = "";
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Водитель по маршруту!");
		Возврат ТабДокумент;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТелефонВодителя)
		И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
	КонецЕсли;
	
	ПредставлениеВодителя = "" + ПредставлениеВодителя + " / " + ПредставлениеВодителя2 + ", " + ТелефонВодителя2;

	
	
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт6_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		// Аникин 15.02.2022 18:24:46 -->
		//Область2.Параметры.Пункт6_1 = ПунктПогрузки;
		Область2.Параметры.Пункт6_1 = Запись2.ПунктПогрузки;
		// <-- Аникин 15.02.2022 18:24:46
		
		ПредставлениеГрузоотправителяУкороченые = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ИНН");
		
		Область2.Параметры.Пункт6_10 =ПредставлениеГрузоотправителя;//Укороченые+символы.ПС+ ПунктПогрузки;
		Область2.Параметры.Пункт6_8 = ПодписьВодителя;
		
		Область2.Параметры.Пункт7_1 = ПредставлениеГрузоотправителяУкороченые+символы.ПС+Запись2.ПунктРазгрузки;
		Область2.Параметры.Пункт7_8 = ПодписьВодителя;
		
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт6_6 =  СтрокаДоверенность; 
		//
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	Область3.Параметры.Пункт8_1 = "В соответствии с договором";
	Область3.Параметры.Пункт8_4 = "В соответствии с договором";
	Область3.Параметры.Пункт8_5 = "В соответствии с договором";
	ТабДокумент.Вывести(Область3);
	// 130228 колодина по указанию Хританцева и Глумова
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	Попытка
		Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			//ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			//"ПолноеНаименование,ФактическийАдрес,Телефоны");
			//Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_1 = ПредставлениеПеревозчика;
		Иначе
			//ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			//"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			//Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
		КонецЕсли;
	Исключение
		//ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		//Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
	КонецПопытки;
	
			
	
	Область4.Параметры.Пункт10_4 = ПредставлениеВодителя;
	Область4.Параметры.Пункт11_1 = Автомобиль.Марка;
	Область4.Параметры.Пункт11_2 = Автомобиль.код;
	Если НЕ ИнойПеревозчикЧерезКаргомарт и Найти(ПредставлениеПеревозчика,"Бриджтаун") = 0 Тогда
		Область4.Параметры.Пункт11_3 = ""; 
	Иначе
		Область4.Параметры.Пункт11_3 = "1";
	КонецЕсли;
	Область4.Параметры.Пункт15_1 =СтрокаДоверенность; //Грузоотправитель+"   "+ Формат(ТекущаяДата(), "ДЛФ=Д");
	//Область4.Параметры.Пункт15_2 = Перевозчик;
	Область4.Параметры.Пункт16_1 = "В соответствии с договором"; 
	Область4.Параметры.Пункт16_2 =  ПредставлениеГрузоотправителя;
	Область4.Параметры.Пункт16_3 =  СтрокаДоверенность;
	Область4.Параметры.Пункт16_5 = ПредставлениеПеревозчика;
	Область4.Параметры.Пункт16_7 = Формат(ТекущаяДата(), "ДЛФ=Д");
	Область4.Параметры.Пункт15_2 = ПодписьВодителя;
	Область4.Параметры.Пункт16_6 = ПодписьВодителя;
	

	
	ТабДокумент.Вывести(Область4);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	возврат табдокумент;
	
КонецФункции
//конец печать транс накладная

&НаСервере
функция ПолучитьТранспортнуюНакладную2020(СтрокаМаршрута, ДляНалоговой = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;	
	
	
	МассивСкладов = Новый Массив;
	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе
			
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда
					
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда
						
						МассивСкладов.Добавить(ТекДок.Контрагент);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2020");
	Область1 = Макет.ПолучитьОбласть("лицеваясторона1");
	Область2 = Макет.ПолучитьОбласть("лицеваясторона2");
	Область3 = Макет.ПолучитьОбласть("лицеваясторона3");
	Область4 = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Номер
	|	КОНЕЦ КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Дата
	|	КОНЕЦ КАК ДатаЗаказа,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация КАК Грузополучатель,
	|	ПеремещениеТоваров.Организация КАК Грузоотправитель,
	|	ПеремещениеТоваров.Организация КАК Контрагент,
	|	ПеремещениеТоваров.Организация КАК ЗаказчикПеревозок,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущийОтветственный КАК Кладовщик,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПеремещениеТоваров.Организация.ТекущийРукоВодитель КАК РукоВодитель,
	|	ПеремещениеТоваров.Организация.ТекущаяДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПеремещениеТоваров.Организация.ТекущийГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.Перевозчик КАК Перевозчик,
	|	ПеремещениеТоваров.Водитель КАК Водитель,
	|	СкладыКонтактнаяОтправитель.Представление КАК ПунктПогрузки,
	|	СкладыКонтактнаяПолучатель.Представление КАК ПунктРазгрузки,
	|	ПеремещениеТоваров.СрокДоставки КАК СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто КАК ВесНетто,
	|	ПеремещениеТоваров.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяПолучатель
	|		ПО ПеремещениеТоваров.СкладПолучатель = СкладыКонтактнаяПолучатель.Ссылка
	|			И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ПеремещениеТоваров.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ПеремещениеТоваровТовары.Количество) КАК ВесНетто,
	|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ПеремещениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	"""",
	|	"""",
	|	ЗаказКлиента.Организация.ТекущийРукоВодитель,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер,
	|	&Перевозчик,
	|	&Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	"""",
	|	ВложенныйЗапрос.ВесНетто,
	|	&Автомобиль
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|			И ЗаказКлиента.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ЗаказКлиентаТовары.Количество) КАК ВесНетто,
	|			ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказКлиентаТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаказКлиента.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			И ЗаказКлиента.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Дата
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Склад.ТекущийОтветственный,
	|	РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Перевозчик,
	|	РеализацияТоваровУслуг.Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяПолучатель.Представление,
	|	РеализацияТоваровУслуг.СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто,
	|	РеализацияТоваровУслуг.Автомобиль
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяПолучатель
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяПолучатель.Ссылка
	|			И (КонтрагентыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО РеализацияТоваровУслуг.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * РеализацияТоваровУслугТовары.Количество) КАК ВесНетто
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО РеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|ИТОГИ ПО
	|	ПунктРазгрузки";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	//
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
	//ПунктПогрузки = "Новосибирская обл, Новосибирск г, Карьер Мочище мкр, Кубовая ул, дом № 68";
	
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО
	Если Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаОтгрузкуЗаказы.Склад
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез.Склад) Тогда
				СкладОтправитель = Рез.Склад;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
		Если КодУзла = "000" Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
		Иначе
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
		КонецЕсли;
		
	КонецЕсли;
	
	//АдресГрузоОтправителя =УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
	//АдресГрузоОтправителя = ПолучитьАдресМагазина(СкладОтправитель);
	//
	//КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
	//Если КодУзла = "000" Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
	//Иначе
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
	//КонецЕсли; 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	//КонецЕсли;

	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда
			ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	
	//
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.ЗНО.Перевозчик, ТекущаяДата());
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0;
		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель =  ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик =       ОбщаяВыборка.Перевозчик;
			ОбщийВодитель = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
	КонецЦикла;	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 ="";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1	= "ТОРГ-13 № "+СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1+Символы.ПС;
		КонецЕсли;
		Пункт4_1	=Пункт4_1 + "ТОРГ-12 № "+СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	//ОбластьМакета.Параметры.Пункт6_5	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" кг.";
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор ";// + ПараметрыСеанса.ТекущийПользователь.Наименование;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ПользователиДополнительныеРеквизиты.Значение
	//			   |ИЗ
	//			   |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	//			   |ГДЕ
	//			   |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	//			   |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	//Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	//Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	//РезультатДов = Запрос.Выполнить();
	//Если не РезультатДов.Пустой() тогда
	//	ВыборкаДоверенность = РезультатДов.Выбрать();
	//	Пока ВыборкаДоверенность.Следующий() цикл
	//		 Доверенность = ВыборкаДоверенность.Значение;
	//	 КонецЦикла;
	//	 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	//КонецЕсли;
	
	//-
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт6_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		Область2.Параметры.Пункт6_1 = ПунктПогрузки;
		Область2.Параметры.Пункт7_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт6_6 =  СтрокаДоверенность; 
		//
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	ТабДокумент.Вывести(Область3);
	// 130228 колодина по указанию Хританцева и Глумова
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	Попытка
		Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_1 = ПредставлениеПеревозчика;
		Иначе
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
		КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		ТелефонВодителя        = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2       = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
	Иначе
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = "";
		ТелефонВодителя        = "";
		ТелефонВодителя2 ="";     
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Водитель по маршруту!");
		//Возврат ТабДокумент;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТелефонВодителя)
		И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
	КонецЕсли;
	
	ПредставлениеВодителя = "" + ПредставлениеВодителя + " / " + ПредставлениеВодителя2 + ", " + ТелефонВодителя2;
	//Если ЗначениеЗаполнено(ПредставлениеВодителя2) Тогда
	//	ПредставлениеВодителя = ПредставлениеВодителя + " / " + ПредставлениеВодителя2;// + ", " + ТелефонВодителя;
	//	Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
	//		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя2;
	//	КонецЕсли;
	
	//КонецЕсли;	
	
	
	Область4.Параметры.Пункт10_4 = ПредставлениеВодителя;
	Область4.Параметры.Пункт11_1 = Автомобиль.Марка;
	Область4.Параметры.Пункт11_2 = Автомобиль.код;
	
	Попытка
	 Область4.Параметры.Пункт16_1 = Грузоотправитель+"   "+ Формат(СтрокаМаршрута.ЗНО.Дата, "ДЛФ=Д");
 Исключение
	 КонецПопытки;
	 
	Область4.Параметры.Пункт16_2 = Перевозчик;
	
	ТабДокумент.Вывести(Область4);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	возврат табдокумент;
	
КонецФункции

&НаСервере
Функция ВернутьЗапросПолучитьТранспортнуюНакладную2022()
	
	Возврат
	
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Номер
	|	КОНЕЦ КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Дата
	|	КОНЕЦ КАК ДатаЗаказа,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация КАК Грузополучатель,
	|	ПеремещениеТоваров.Организация КАК Грузоотправитель,
	|	ПеремещениеТоваров.Организация КАК Контрагент,
	|	ПеремещениеТоваров.Организация КАК ЗаказчикПеревозок,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущийОтветственный КАК Кладовщик,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПеремещениеТоваров.Организация.ТекущийРуководитель КАК РукоВодитель,
	|	ПеремещениеТоваров.Организация.ТекущаяДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПеремещениеТоваров.Организация.ТекущийГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.Перевозчик КАК Перевозчик,
	|	ПеремещениеТоваров.Водитель КАК Водитель,
	|	СкладыКонтактнаяОтправитель.Представление КАК ПунктПогрузки,
	|	СкладыКонтактнаяПолучатель.Представление КАК ПунктРазгрузки,
	|	ПеремещениеТоваров.СрокДоставки КАК СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто КАК ВесНетто,
	|	ПеремещениеТоваров.Автомобиль КАК Автомобиль,
	|	ЕСТЬNULL(ЗаказНаПеремещениеДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК Дефростация,
	|	ПеремещениеТоваров.СкладПолучатель КАК Получатель,
	|	ПеремещениеТоваров.СкладОтправитель КАК Отправитель,
	|	""{{ВнешниеОбработки.АРМОператораОтгрузки.Формы.Форма.ВернутьЗапросПолучитьТранспортнуюНакладную2022.Запрос1 [n.chernyshov]}}"" КАК НаименованиеЗапроса
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяПолучатель
	|		ПО ПеремещениеТоваров.СкладПолучатель = СкладыКонтактнаяПолучатель.Ссылка
	|			И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ПеремещениеТоваров.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ПеремещениеТоваровТовары.Количество) КАК ВесНетто,
	|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ПеремещениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.ДополнительныеРеквизиты КАК ЗаказНаПеремещениеДополнительныеРеквизиты
	|		ПО ПеремещениеТоваров.ЗаказНаПеремещение = ЗаказНаПеремещениеДополнительныеРеквизиты.Ссылка
	|			И (ЗаказНаПеремещениеДополнительныеРеквизиты.Свойство.Наименование = ""Дефростация"")
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	"""",
	|	"""",
	|	ЗаказКлиента.Организация.ТекущийРуководитель,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер,
	|	&Перевозчик,
	|	&Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	"""",
	|	ВложенныйЗапрос.ВесНетто,
	|	&Автомобиль,
	|	ЛОЖЬ,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Склад,
	|	""{{ВнешниеОбработки.АРМОператораОтгрузки.Формы.Форма.ВернутьЗапросПолучитьТранспортнуюНакладную2022.Запрос1 [n.chernyshov]}}""
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|			И ЗаказКлиента.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ЗаказКлиентаТовары.Количество) КАК ВесНетто,
	|			ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказКлиентаТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаказКлиента.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			И ЗаказКлиента.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Дата
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Склад.ТекущийОтветственный,
	|	РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного,
	|	РеализацияТоваровУслуг.Организация.ТекущийРуководитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Перевозчик,
	|	РеализацияТоваровУслуг.Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяПолучатель.Представление,
	|	РеализацияТоваровУслуг.СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто,
	|	РеализацияТоваровУслуг.Автомобиль,
	|	ЛОЖЬ,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Склад,
	|	""{{ВнешниеОбработки.АРМОператораОтгрузки.Формы.Форма.ВернутьЗапросПолучитьТранспортнуюНакладную2022.Запрос1 [n.chernyshov]}}""
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяПолучатель
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяПолучатель.Ссылка
	|			И (КонтрагентыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО РеализацияТоваровУслуг.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * РеализацияТоваровУслугТовары.Количество) КАК ВесНетто
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО РеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.Номер,
	|	ЗаказПоставщику.Дата,
	|	ЗаказПоставщику.Организация,
	|	ЗаказПоставщику.Организация,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Контрагент,
	|	ЗаказПоставщику.Организация,
	|	ЗаказПоставщику.Организация.Префикс,
	|	ЗаказПоставщику.Склад.ТекущийОтветственный,
	|	ЗаказПоставщику.Склад.ТекущаяДолжностьОтветственного,
	|	ЗаказПоставщику.Организация.ТекущийРуководитель,
	|	ЗаказПоставщику.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказПоставщику.Организация.ТекущийГлавныйБухгалтер,
	|	&Перевозчик,
	|	&Водитель,
	|	КонтрагентыКонтактнаяПолучатель.Представление,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	"""",
	|	ВложенныйЗапрос.ВесНетто,
	|	&Автомобиль,
	|	ЛОЖЬ,
	|	ЗаказПоставщику.Склад,
	|	ЗаказПоставщику.Контрагент,
	|	""{{ВнешниеОбработки.АРМОператораОтгрузки.Формы.Форма.ВернутьЗапросПолучитьТранспортнуюНакладную2022.Запрос1 [n.chernyshov]}}""
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяПолучатель
	|		ПО ЗаказПоставщику.Контрагент = КонтрагентыКонтактнаяПолучатель.Ссылка
	|			И (КонтрагентыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ЗаказПоставщику.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказПоставщикуТовары.Ссылка КАК Ссылка,
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ЗаказПоставщикуТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ЗаказПоставщикуТовары.Количество) КАК ВесНетто
	|		ИЗ
	|			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ЗаказПоставщикуТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ЗаказПоставщикуТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказПоставщикуТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаказПоставщику.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ЗаказПоставщику.Ссылка В(&МассивДокументов)
	|	И ЗаказПоставщику.Склад.ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
	|ИТОГИ ПО
	|	ПунктРазгрузки";
	
КонецФункции

&НаСервере
функция ПолучитьТранспортнуюНакладную2022_Вариант1(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;	
	
	
	МассивСкладов = Новый Массив;
	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе
			
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда
					
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда
						
						МассивСкладов.Добавить(ТекДок.Контрагент);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2022");
	Область1 = Макет.ПолучитьОбласть("Область1");
	Область2 = Макет.ПолучитьОбласть("Область2");
	Область3 = Макет.ПолучитьОбласть("Область3");
	
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьЗапросПолучитьТранспортнуюНакладную2022();	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	//
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
	//ПунктПогрузки = "Новосибирская обл, Новосибирск г, Карьер Мочище мкр, Кубовая ул, дом № 68";
	
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО
	Если Истина Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаОтгрузкуЗаказы.Склад
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез.Склад) Тогда
				СкладОтправитель = Рез.Склад;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
		Если КодУзла = "000" Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
		Иначе
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
		КонецЕсли; 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
		|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";
		
		Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
		Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
		КонецЕсли;
		
	КонецЕсли;
	
	//АдресГрузоОтправителя =УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СкладОтправитель, Справочники.ВидыКонтактнойИнформации.АдресСклада);
	//АдресГрузоОтправителя = ПолучитьАдресМагазина(СкладОтправитель);
	//
	//КодУзла = ВнешнийМодульРаботаСWebПолучениеДанных.ПолучитьКодТекущегоУзла();
	//Если КодУзла = "000" Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)");
	//Иначе
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("Обх Основной (WMS)");
	//КонецЕсли; 
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеТЛМ";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеТЛМ", "ТЛМ Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТЛМ Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "ТСК Основной РЦ (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("ТСК Основной РЦ (WMS)");
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЗаказНаОтгрузкуЗаказы.НомерСтроки
	//	|ИЗ
	//	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	//	|ГДЕ
	//	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО
	//	|	И ЗаказНаОтгрузкуЗаказы.Склад.Наименование = &СкладНаименованиеЗорька";

	//Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	//Запрос.УстановитьПараметр("СкладНаименованиеЗорька", "НКЗ Заморозка (WMS)");

	//Результат = Запрос.Выполнить();
	//Если Не Результат.Пустой() Тогда
	//	СкладОтправитель = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	//КонецЕсли;

	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда
			ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	
	//
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.ЗНО.Перевозчик, ТекущаяДата());
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0;
		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель =  ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик =       ОбщаяВыборка.Перевозчик;
			ОбщийВодитель = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
	КонецЦикла;	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 ="";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1	= "ТОРГ-13 № "+СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1+Символы.ПС;
		КонецЕсли;
		Пункт4_1	=Пункт4_1 + "ТОРГ-12 № "+СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	//ОбластьМакета.Параметры.Пункт6_5	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" кг.";
	
	Попытка
		Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		Иначе
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		ТелефонВодителя        = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2       = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
	Иначе
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = "";
		ТелефонВодителя        = "";
		ТелефонВодителя2 ="";     
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Водитель по маршруту!");
		//Возврат ТабДокумент;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТелефонВодителя)
		И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
	КонецЕсли;
	
	ПредставлениеВодителя = "" + ПредставлениеВодителя + " / " + ПредставлениеВодителя2 + ", " + ТелефонВодителя2;
	//Если ЗначениеЗаполнено(ПредставлениеВодителя2) Тогда
	//	ПредставлениеВодителя = ПредставлениеВодителя + " / " + ПредставлениеВодителя2;// + ", " + ТелефонВодителя;
	//	Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
	//		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя2;
	//	КонецЕсли;
	
	//КонецЕсли;	
	
	
	Область1.Параметры.Пункт6_2 = ПредставлениеВодителя;
	Область1.Параметры.Пункт7_1 = Автомобиль.Марка;
	Область1.Параметры.Пункт7_2 = Автомобиль.код;

	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор ";// + ПараметрыСеанса.ТекущийПользователь.Наименование;
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ПользователиДополнительныеРеквизиты.Значение
	//			   |ИЗ
	//			   |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	//			   |ГДЕ
	//			   |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	//			   |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	//Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	//Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	//РезультатДов = Запрос.Выполнить();
	//Если не РезультатДов.Пустой() тогда
	//	ВыборкаДоверенность = РезультатДов.Выбрать();
	//	Пока ВыборкаДоверенность.Следующий() цикл
	//		 Доверенность = ВыборкаДоверенность.Значение;
	//	 КонецЦикла;
	//	 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	//КонецЕсли;
	
	//-
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт8_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		Область2.Параметры.Пункт8_2 = ПунктПогрузки;
		Область2.Параметры.Пункт10_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт8_7 =  СтрокаДоверенность; 
		//
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
		
	Попытка
		Область3.Параметры.Пункт12_7 = Грузоотправитель+"   "+ Формат(СтрокаМаршрута.ЗНО.Дата, "ДЛФ=Д");
 	Исключение
	КонецПопытки;
	 
	Область3.Параметры.Пункт12_6 = Перевозчик;
	
	ТабДокумент.Вывести(Область3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
функция ПолучитьТранспортнуюНакладную2022(СтрокаМаршрута, ДляНалоговой = Ложь)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	Если ДвусторонняяПечатьТранспортнойНакладной тогда
		ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	КонецЕсли;	
		//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2022");
	Область1 = Макет.ПолучитьОбласть("Область1");
	Область2 = Макет.ПолучитьОбласть("Область2");
	Область3 = Макет.ПолучитьОбласть("Область3");
	
	Если СтрокаМаршрута.Перевозчик = "Бриджтаун фудс ЗАО" Тогда 
		ОбластьПеревозчик = Область1.Область("R40C2:R40C27");
		ОбластьПеревозчик.Шрифт = Новый Шрифт(ОбластьПеревозчик.Шрифт, , , Ложь);
	КонецЕсли;
	
	РеквизитыЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Дата, Номер, ДатаОтгрузки, Перевозчик");
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, РеквизитыЗНО.Номер);

		
	МассивСкладов = Новый Массив;	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе	
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда	
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда	
						МассивСкладов.Добавить(ТекДок.Контрагент);	
					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 	
		КонецЕсли;	
	КонецЦикла;
		
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
		
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаОтгрузкуЗаказы.Склад
	|ИЗ
	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	|ГДЕ
	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
	
	Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЗначениеЗаполнено(Рез.Склад) Тогда
			СкладОтправитель = Рез.Склад;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал как архаизм по задаче #10606240
		//Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда 
		//	ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		//Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		//КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	// Аникин 27.01.2023 17:46:10 -->
	ДанныеДляПечати.Колонки.Добавить("ПунктПогрузки");
	СкладНКЗЗаморозка = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	СкладНСКЗаморозка = Справочники.Склады.НайтиПоНаименованию("НСК Заморозка (WMS) - ТЛМ2");
	СкладПолучательКемерово = Справочники.Склады.НайтиПоНаименованию("Кемерово");
	СкладПолучательНовокузнецк = Справочники.Склады.НайтиПоНаименованию("Новокузнецк");
	// <-- Аникин 27.01.2023 17:46:10
	СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(РеквизитыЗНО.Перевозчик, ТекущаяДата());
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьЗапросПолучитьТранспортнуюНакладную2022();	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВсеПунктыРазгрузкиСтрока = "";
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		// Аникин 27.01.2023 17:46:10 -->
		НоваяСтрока.ПунктПогрузки = ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		
		Если ВсеПунктыРазгрузкиСтрока <> "" Тогда
			ВсеПунктыРазгрузкиСтрока = ВсеПунктыРазгрузкиСтрока + ", ";
		КонецЕСли;
		ВсеПунктыРазгрузкиСтрока = ВсеПунктыРазгрузкиСтрока + СокрЛП(ВыборкаПунктов.ПунктРазгрузки);
		
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0; 
		
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 ОбщаяВыборка в теории может быть пустая
		ПодменаСкладОтправитель = СкладОтправитель;  
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023  

		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель =  ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик =       ОбщаяВыборка.Перевозчик;
			ОбщийВодитель = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			
			// Аникин 27.01.2023 17:46:10 -->
			// v.nagaycev@kdvm.ru 08.08.2023 закомментировал, Женя Сидоренко попросила
			//ПодменаСкладОтправитель = СкладОтправитель;
			//Если ОбщаяВыборка.Дефростация = ЛОЖЬ Тогда
			//	Если ОбщаяВыборка.Отправитель = СкладНСКЗаморозка Тогда
			//		Если ТипЗнч(ОбщаяВыборка.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			//			СкладПолучатель = ОбщаяВыборка.Получатель;
			//			Если СкладПолучатель.Родитель = СкладПолучательКемерово ИЛИ СкладПолучатель.Родитель = СкладПолучательНовокузнецк Тогда
			//				ПодменаСкладОтправитель = СкладНКЗЗаморозка;
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			// <-- Аникин 27.01.2023 17:46:10
			
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		// Аникин 27.01.2023 17:46:10 -->
		Если СкладОтправитель <> ПодменаСкладОтправитель Тогда
			НоваяСтрока.ПунктПогрузки = ПолучитьАдресМагазина(ПодменаСкладОтправитель);
		КонецЕсли;
		// <-- Аникин 27.01.2023 17:46:10
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
		КонецЕсли;
			
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
		
	КонецЦикла;	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	Область1.Параметры.Пункт2_2 = ВсеПунктыРазгрузкиСтрока;	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 ="";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1	= "ТОРГ-13 № "+СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если Не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1+Символы.ПС;
		КонецЕсли;
		Пункт4_1	=Пункт4_1 + "ТОРГ-12 № "+СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	//ОбластьМакета.Параметры.Пункт6_5	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" кг.";
	
	Попытка  
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал и добавил ИНН у перевозчика по задаче #10606240
		//Если ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//	ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//Иначе 
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
		Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если Не ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		ТелефонВодителя        = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2       = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
	Иначе
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = "";
		ТелефонВодителя        = "";
		ТелефонВодителя2 ="";     
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Водитель по маршруту!");
		//Возврат ТабДокумент;
	КонецЕсли; 
		
	//+27.06.2022 n.chernyshov@kdvm.ru если водителя 2 то оставляем пустыми 6.2, 8.8, 10.9
	ПредставлениеВодителя6_2 = "";
	ПредставлениеВодителя10_9 = "Водитель ______________";
	
	Если СокрЛП(ПредставлениеВодителя) <> "" и СокрЛП(ПредставлениеВодителя2) <> "" Тогда
		Если Найти(Врег(ПредставлениеВодителя2),"ПОДРАБОТКА")>0 Тогда
			 ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителя);
			 ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			 Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
		//Вывод двух водителей в 6_2 31.10.2022 n.chernyshov@kdvm.ru
		Иначе
			Если СокрЛП(ПредставлениеВодителя) <> "" Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителя);
				Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
				КонецЕсли;
			КонецЕсли;
			Если СокрЛП(ПредставлениеВодителя2) <> "" Тогда
				Если ПредставлениеВодителя6_2 <> "" Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + " / ";
				КонецЕсли;
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителя2);
	            Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СокрЛП(ПредставлениеВодителя) <> "" Тогда
			 ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителя);
			 ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			 Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			 КонецЕсли;
		Иначе
			 ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителя2);
			 ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя2);
              Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
			 КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	//было
		//ПредставлениеВодителя10_9 = "Водитель ______________";
		//Если ПредставлениеВодителя = "" Тогда
		//	ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + ПредставлениеВодителя2;
		//Иначе
		//	ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + ПредставлениеВодителя;
		//	Если ПредставлениеВодителя2 <> "" Тогда
		//		ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + " / " + ПредставлениеВодителя2;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//Если ЗначениеЗаполнено(ТелефонВодителя)
		//	И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
		//	ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
		//КонецЕсли;
		//
		//ПредставлениеВодителя = "" + ПредставлениеВодителя + " / " + ПредставлениеВодителя2 + ", " + ТелефонВодителя2;
		////Если ЗначениеЗаполнено(ПредставлениеВодителя2) Тогда
		////	ПредставлениеВодителя = ПредставлениеВодителя + " / " + ПредставлениеВодителя2;// + ", " + ТелефонВодителя;
		////	Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
		////		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя2;
		////	КонецЕсли;
		//
		////КонецЕсли;	
	
	//-27.06.2022 n.chernyshov@kdvm.ru
	
		
	Область1.Параметры.Пункт6_2 = ПредставлениеВодителя6_2;
	Область1.Параметры.Пункт7_1 = Автомобиль.Марка;
	Область1.Параметры.Пункт7_2 = Автомобиль.код;
	
	// 16.05.2024 v.nagaycev@gmail.com
	Область1.Параметры.Пункт7_3 = ПолучитьТипВладенияТСПеревозчика(РеквизитыЗНО.Перевозчик);
	//Если НЕ ИнойПеревозчикЧерезКаргомарт и Найти(ПредставлениеПеревозчика,"Бриджтаун") = 0 Тогда
	//	Область1.Параметры.Пункт7_3 = "";
	//Иначе
	//	Область1.Параметры.Пункт7_3 = "1";
	//КонецЕсли ;	
	
	//n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240  
	Попытка
		Если Найти(Врег(СокрЛП(РеквизитыЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
			Область1.Параметры.Пункт7_3 = "1";
		КонецЕсли;  
	Исключение
	КонецПопытки;
    //n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ?(ДляНалоговой = Истина, "", ПараметрыСеанса.ТекущийПользователь.Наименование);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	//-
	
	 Область2.Параметры.Пункт8_1	= "ООО «Камелот-А» ИНН 7017187800" ;
	
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт8_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		// Аникин 27.01.2023 17:46:10 -->
		//Область2.Параметры.Пункт8_2 = ПунктПогрузки;
		Область2.Параметры.Пункт8_2 = Запись2.ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		Если ЗначениеЗаполнено(РеквизитыЗНО.ДатаОтгрузки) Тогда
			Область2.Параметры.Пункт8_41 = Формат(РеквизитыЗНО.ДатаОтгрузки, "ДЛФ=DT; ДП=");
		КонецЕсли;
		Область2.Параметры.Пункт10_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт8_7 =  СтрокаДоверенность; 
		//		
		Область2.Параметры.Пункт10_9 = ПредставлениеВодителя10_9;
		Область2.Параметры.Пункт8_8 = ПредставлениеВодителя10_9;
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	//n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	Попытка
		Если Найти(Врег(СокрЛП(РеквизитыЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
			мСоглашениеСПоставщиком = ПолучитьДействующееСоглашениеСПоставщиком(РеквизитыЗНО.Перевозчик);
			Если мСоглашениеСПоставщиком <> Справочники.СоглашенияСПоставщиками.ПустаяСсылка() Тогда
				Область3.Параметры.Пункт12_5 = "по договору №"+СокрЛП(мСоглашениеСПоставщиком.Номер)+" от "+Формат(мСоглашениеСПоставщиком.Дата,"ДФ=dd.MM.yyyy"); 
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
    //n.chernyshov@kdvm.ru конец вставки 07.06.2023  
	
	//n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	Попытка
		
		Если Найти(Врег(СокрЛП(РеквизитыЗНО.Перевозчик)), Врег("Евтюхин")) > 0 и Найти(Врег(ПредставлениеВодителя6_2), Врег("Евтюхин")) > 0 Тогда
			
			Область3.Параметры.Пункт12_11 = "                     Евтюхин А.В.";
			
		Иначе
			
			СтруктураУполномоченногоЛицаПеревозчика = ПолучитьСтруктуруУполномоченногоЛицаПеревозчика(РеквизитыЗНО.Перевозчик, РеквизитыЗНО.Дата);
			Если СтруктураУполномоченногоЛицаПеревозчика <> Неопределено Тогда 
				Область3.Параметры.Пункт12_11 = СтруктураУполномоченногоЛицаПеревозчика.УполномоченноеЛицо;
				Область3.Параметры.Пункт12_13 = СтруктураУполномоченногоЛицаПеревозчика.РольУполномоченногоЛица;
			КонецЕсли; 
			
		КонецЕсли;
		
	Исключение
	КонецПопытки;
    //n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	Попытка
		Область3.Параметры.Пункт12_7 = Грузоотправитель+"   "+ Формат(РеквизитыЗНО.Дата, "ДЛФ=Д");
 	Исключение
	КонецПопытки; 
	Область3.Параметры.Пункт12_6 = Перевозчик;
	
	ТабДокумент.Вывести(Область3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции  

&НаСервере
Функция ПолучитьДействующееСоглашениеСПоставщиком(мКонтрагент)
	
	Если мКонтрагент <> Неопределено и ТипЗнч(мКонтрагент) = Тип("СправочникСсылка.Контрагенты") и мКонтрагент <> Справочники.Контрагенты.ПустаяСсылка() Тогда   
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СоглашенияСПоставщиками.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
		|ГДЕ
		|	СоглашенияСПоставщиками.Контрагент = &Контрагент
		|	И СоглашенияСПоставщиками.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСПоставщиками.Действует)
		|	И СоглашенияСПоставщиками.ПометкаУдаления <> ИСТИНА";
		Запрос.УстановитьПараметр("Контрагент",мКонтрагент);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Возврат Результат.Ссылка;
		Иначе  
			мПартнер = мКонтрагент.Партнер;
			
			Если мПартнер <> Неопределено и ТипЗнч(мПартнер) = Тип("СправочникСсылка.Партнеры") и мПартнер <> Справочники.Партнеры.ПустаяСсылка() Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	МАКСИМУМ(СоглашенияСПоставщиками.Ссылка) КАК Ссылка
				|ИЗ
				|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
				|ГДЕ
				|	СоглашенияСПоставщиками.Партнер = &Партнер
				|	И СоглашенияСПоставщиками.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСПоставщиками.Действует)
				|	И СоглашенияСПоставщиками.ПометкаУдаления <> ИСТИНА";
				Запрос.УстановитьПараметр("Партнер",мПартнер);
				Результат = Запрос.Выполнить().Выбрать();
				Если Результат.Следующий() Тогда
					Возврат Результат.Ссылка;
	            КонецЕсли;
			КонецЕсли;
				
		КонецЕсли; 
		
		Возврат Справочники.СоглашенияСПоставщиками.ПустаяСсылка();
	Иначе
		
		Возврат Справочники.СоглашенияСПоставщиками.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

//n.chernyshov@kdvm.ru начало вставки 01.08.2023 
//Есть 3 вида перевозок. Зависят они от перевозчика и условий договора:
//1.            Перевозчик Бриджтаун фудс ЗАО (БТФ)
//2.            Иной перевозчик, через Каргомарт – для этого варианта создавали отдельную галку в АРМ (на скрине ниже)
//3.            Иной перевозчик, минуя Каргомарт (т.е. прямой договор с перевозчиком) 
//Для трех видов перевозок нужно разное заполнение ТН.

&НаСервере
функция ПолучитьТранспортнуюНакладную_01082023(СтрокаМаршрута, ПараметрыФормированияТН)
	
	Если СтрокаМаршрута.Перевозчик = "Бриджтаун фудс ЗАО" Тогда
		//Перевозчик Бриджтаун фудс ЗАО (БТФ) 
		Возврат ПолучитьТранспортнуюНакладнуюПеревозчикБТФ(СтрокаМаршрута, ПараметрыФормированияТН);
	ИначеЕсли ИнойПеревозчикЧерезКаргомарт = Истина Тогда
		//Иной перевозчик, через Каргомарт – для этого варианта создавали отдельную галку в АРМ  
		Возврат ПолучитьТранспортнуюНакладнуюИнойПеревозчикЧерезКаргомарт(СтрокаМаршрута, ПараметрыФормированияТН);
	Иначе
		//Иной перевозчик, минуя Каргомарт (т.е. прямой договор с перевозчиком)
		Возврат ПолучитьТранспортнуюНакладнуюИнойПеревозчикМинуяКаргомарт(СтрокаМаршрута, ПараметрыФормированияТН);
	КонецЕсли;	
		
КонецФункции  

&НаСервере
Функция ПолучитьТранспортнуюНакладнуюПеревозчикБТФ(СтрокаМаршрута, ПараметрыФормированияТН)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОчиститьЭкспедитора = ПараметрыФормированияТН.ОчиститьЭкспедитора;
	ОчиститьПеревозчика = ПараметрыФормированияТН.ОчиститьПеревозчика;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	Если ДвусторонняяПечатьТранспортнойНакладной тогда
		ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	КонецЕсли;	
		//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2022");
	Область1 = Макет.ПолучитьОбласть("Область1");
	Область2 = Макет.ПолучитьОбласть("Область2");
	Область3 = Макет.ПолучитьОбласть("Область3");
	
	ОбластьПеревозчик = Область1.Область("R40C2:R40C27");
	ОбластьПеревозчик.Шрифт = Новый Шрифт(ОбластьПеревозчик.Шрифт, , , Ложь);
	
	РеквизитыЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Дата, Номер, ДатаОтгрузки, Перевозчик");
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО) = Тип("ДокументСсылка.ЗаказПоставщику") И СтрЗаказ.Пометка = 1 И ЗначениеЗаполнено(СтрЗаказ.Водитель)
			И ТипЗнч(СтрЗаказ.Водитель) = Тип("СправочникСсылка.Склады") И ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.Водитель, "ТИпСклада") = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, РеквизитыЗНО.Номер);
	
	МассивСкладов = Новый Массив;	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе	
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда	
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда	
						МассивСкладов.Добавить(ТекДок.Контрагент);	
					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 	
		КонецЕсли;	
	КонецЦикла;
		
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов = "";
	СтрокаПеремещений = "";
	СтрокаПеремещенийДата = "";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
		
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаОтгрузкуЗаказы.Склад
	|ИЗ
	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	|ГДЕ
	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
	
	Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЗначениеЗаполнено(Рез.Склад) Тогда
			СкладОтправитель = Рез.Склад;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал как архаизм по задаче #10606240
		//Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда 
		//	ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		//Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		//КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	// Аникин 27.01.2023 17:46:10 -->
	ДанныеДляПечати.Колонки.Добавить("ПунктПогрузки");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузоотправителе");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузополучателе");
	СкладНКЗЗаморозка = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	СкладНСКЗаморозка = Справочники.Склады.НайтиПоНаименованию("НСК Заморозка (WMS) - ТЛМ2");
	СкладПолучательКемерово = Справочники.Склады.НайтиПоНаименованию("Кемерово");
	СкладПолучательНовокузнецк = Справочники.Склады.НайтиПоНаименованию("Новокузнецк");
	// <-- Аникин 27.01.2023 17:46:10
	СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(РеквизитыЗНО.Перевозчик, ТекущаяДата());
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьЗапросПолучитьТранспортнуюНакладную2022();	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель",   СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВсеПунктыРазгрузкиСтрока = "";
	ОбщийГрузоотправитель    = Неопределено;
	ОбщийГрузополучатель 	 = Неопределено;
	ОбщаяДата = Дата(1, 1, 1);
		
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		// Аникин 27.01.2023 17:46:10 -->
		НоваяСтрока.ПунктПогрузки = ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		
		Если СтрНайти(ВсеПунктыРазгрузкиСтрока, СокрЛП(ВыборкаПунктов.ПунктРазгрузки)) = 0 Тогда 
			ВсеПунктыРазгрузкиСтрока = ВсеПунктыРазгрузкиСтрока + ?(ПустаяСтрока(ВсеПунктыРазгрузкиСтрока), "", ", ") + СокрЛП(ВыборкаПунктов.ПунктРазгрузки);
		КонецЕсли;
		
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0; 
		
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 ОбщаяВыборка в теории может быть пустая
		ПодменаСкладОтправитель = СкладОтправитель;  
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023  
		
		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			ИначеЕсли ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			
			// v.nagaycev@kdvm.ru 16.11.2023
			НоваяСтрока.СведенияОГрузополучателе  = СведенияОГрузополучателе;
			НоваяСтрока.СведенияОГрузоотправителе = СведенияОГрузоотправитель;
			
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				НоваяСтрока.ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
				
			СведенияОВодителе     = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель  = ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик       = ОбщаяВыборка.Перевозчик;
			ОбщийВодитель 		  = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
					ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ОбщаяДата = ОбщаяВыборка.Дата;
			
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			
			// Аникин 27.01.2023 17:46:10 -->
			// v.nagaycev@kdvm.ru 08.08.2023 закомментировал, Женя Сидоренко попросила
			//ПодменаСкладОтправитель = СкладОтправитель;
			//Если ОбщаяВыборка.Дефростация = ЛОЖЬ Тогда
			//	Если ОбщаяВыборка.Отправитель = СкладНСКЗаморозка Тогда
			//		Если ТипЗнч(ОбщаяВыборка.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			//			СкладПолучатель = ОбщаяВыборка.Получатель;
			//			Если СкладПолучатель.Родитель = СкладПолучательКемерово ИЛИ СкладПолучатель.Родитель = СкладПолучательНовокузнецк Тогда
			//				ПодменаСкладОтправитель = СкладНКЗЗаморозка;
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			// <-- Аникин 27.01.2023 17:46:10
			
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		// Аникин 27.01.2023 17:46:10 -->
		Если СкладОтправитель <> ПодменаСкладОтправитель Тогда
			НоваяСтрока.ПунктПогрузки = ПолучитьАдресМагазина(ПодменаСкладОтправитель);
		КонецЕсли;
		// <-- Аникин 27.01.2023 17:46:10
				
	КонецЦикла;
	
	ПредставлениеГрузоотправителя = "";
	ПредставлениеПеревозчика      = "";
	ПредставлениеЭкспедитора      = "";
	Перевозчик                    = "";
	Грузоотправитель              = "";
		
	Если ОбщийГрузополучатель <> Неопределено Тогда
		
		СведенияОГрузополучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузополучатель, ОбщаяДата); 
		
		Если ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
				"ПолноеНаименование,ФактическийАдрес,ИНН");
		КонецЕсли;
		
	КонецЕсли;
	
	Пункт1_1 = "";
	
	Если ОбщийГрузоотправитель <> Неопределено Тогда
		
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузоотправитель, ОбщаяДата); 
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,ИНН");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаМаршрута.Экспедитор) Или ОчиститьЭкспедитора Тогда
		
		Область1.Параметры.Пункт1_0  = "✔";
		Область1.Параметры.Пункт1а_1 = Пункт1_1;
		
		Если Не ОчиститьЭкспедитора Тогда
			ПредставлениеЭкспедитора = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.Экспедитор, ОбщаяДата), 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Пункт1_1 = ПредставлениеЭкспедитора;
			Область3.Параметры.Пункт12_10 = ПредставлениеЭкспедитора;
		Иначе
			Пункт1_1 = "";	
		КонецЕсли;
			
	КонецЕсли;
	
	Область1.Параметры.Пункт1_1 = Пункт1_1; 
	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	Область1.Параметры.Пункт2_2 = ВсеПунктыРазгрузкиСтрока;	
	Область1.Параметры.Пункт3_3	= "Масса нетто " + Формат(МассаНетто,"ЧДЦ=3")+ " (" + ПрописьМассаНетто + ")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 = "";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) Тогда
		Пункт4_1 = "ТОРГ-13 № " + СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаРеализацийДата) Тогда
		Если Не ПустаяСтрока(Пункт4_1) Тогда
			Пункт4_1 = Пункт4_1 + Символы.ПС;
		КонецЕсли;
		Пункт4_1 = Пункт4_1 + "ТОРГ-12 № " + СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	
	Попытка  
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал и добавил ИНН у перевозчика по задаче #10606240
		//Если ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//	ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//Иначе 
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
		Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
	КонецПопытки; 
	
	Если Не ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		
		ПредставлениеВодителяПолное  = СокрЛП(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2Полное = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), СокрЛП(СтрокаМаршрута.Водитель2), "");
		
		ТелефонВодителя  = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
		
		ВУВодителя  = ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель);
		ВУВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель2), "");
		
	Иначе
		
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = ""; 
		
		ПредставлениеВодителяПолное  = "";
		ПредставлениеВодителя2Полное = "";
		
		ТелефонВодителя  = "";
		ТелефонВодителя2 = "";
		
		ВУВодителя  = ""; 
		ВУВодителя2 = "";
		
	КонецЕсли; 
		
	//+27.06.2022 n.chernyshov@kdvm.ru если водителя 2 то оставляем пустыми 6.2, 8.8, 10.9
	ПредставлениеВодителя6_2 = "";
	ПредставлениеВодителя10_9 = "Водитель ______________";
	
	Если СокрЛП(ПредставлениеВодителя) <> "" и СокрЛП(ПредставлениеВодителя2) <> "" Тогда
		Если Найти(Врег(ПредставлениеВодителя2),"ПОДРАБОТКА") > 0 Тогда
			ПредставлениеВодителя6_2  = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
			//Вывод двух водителей в 6_2 31.10.2022 n.chernyshov@kdvm.ru
		Иначе
			Если СокрЛП(ПредставлениеВодителяПолное) <> "" Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителяПолное);
				Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
				КонецЕсли;
			КонецЕсли;
			Если СокрЛП(ПредставлениеВодителя2Полное) <> "" Тогда
				Если ПредставлениеВодителя6_2 <> "" Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + " / ";
				КонецЕсли;
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителя2Полное);
				Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СокрЛП(ПредставлениеВодителя) <> "" Тогда
			ПредставлениеВодителя6_2  = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
		Иначе
			ПредставлениеВодителя6_2  = СокрЛП(ПредставлениеВодителя2Полное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя2);
			Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	//-27.06.2022 n.chernyshov@kdvm.ru
	
	РеквизитыАвтомобиля = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Автомобиль, "Код, Марка, Прицеп, ГосударственныйНомерПрицепа");
	
	Пункт7_1 = "";
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Марка) Тогда
		Пункт7_1 = СтрШаблон("Тягач, %1", РеквизитыАвтомобиля.Марка); 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Прицеп) Тогда
		Пункт7_1 = СтрШаблон("%1%2%3", Пункт7_1, ?(ПустаяСтрока(Пункт7_1), "", " / "), СтрШаблон("Полуприцеп, %1", РеквизитыАвтомобиля.Прицеп)); 		
	КонецЕсли; 
	
	Пункт7_2 = "";
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Код) Тогда
		Пункт7_2 = СтрШаблон("Тягач, %1", РеквизитыАвтомобиля.Код); 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.ГосударственныйНомерПрицепа) Тогда
		Пункт7_2 = СтрШаблон("%1%2%3", Пункт7_2, ?(ПустаяСтрока(Пункт7_2), "", " / "), СтрШаблон("Полуприцеп, %1", РеквизитыАвтомобиля.ГосударственныйНомерПрицепа)); 		
	КонецЕсли;
	
	Область1.Параметры.Пункт6_2 = ПредставлениеВодителя6_2;
	Область1.Параметры.Пункт7_1 = Пункт7_1;
	Область1.Параметры.Пункт7_2 = Пункт7_2;
	//Если НЕ ИнойПеревозчикЧерезКаргомарт и Найти(ПредставлениеПеревозчика,"Бриджтаун") = 0 Тогда
	//	Область1.Параметры.Пункт7_3 = "";
	//Иначе
	// 16.05.2024 v.nagaycev@kdvm.ru для БТФ всегда "1"
		Область1.Параметры.Пункт7_3 = ПолучитьТипВладенияТСПеревозчика(РеквизитыЗНО.Перевозчик);
	//КонецЕсли ;	
	
	Если ОчиститьПеревозчика Тогда
		Область1.Параметры.Пункт6_1 = "";
		Область1.Параметры.Пункт6_2 = "";
	КонецЕсли;
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240  
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
	//		Область1.Параметры.Пункт7_3 = "1";
	//	КонецЕсли;  
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ПараметрыСеанса.ТекущийПользователь.Наименование;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	//-
	
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		
		КраткоеОписаниеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(Запись2.СведенияОГрузоотправителе, "ПолноеНаименование,ИНН");
		ПолноеОписаниеГрузоотправителя =  ФормированиеПечатныхФорм.ОписаниеОрганизации(Запись2.СведенияОГрузоотправителе, "ПолноеНаименование,ЮридическийАдрес,ИНН");
		
		Область2.Параметры.Пункт8_0 = ПолноеОписаниеГрузоотправителя;
		Область2.Параметры.Пункт8_1	= КраткоеОписаниеГрузоотправителя;
		Область2.Параметры.Пункт8_5	= "Масса нетто " + Формат(Запись2.Веснетто, "ЧДЦ=3") + " кг.";
		// Аникин 27.01.2023 17:46:10 -->
		//Область2.Параметры.Пункт8_2 = ПунктПогрузки;
		Область2.Параметры.Пункт8_2 = Запись2.ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		Если ЗначениеЗаполнено(РеквизитыЗНО.ДатаОтгрузки) Тогда
			Область2.Параметры.Пункт8_41 = Формат(РеквизитыЗНО.ДатаОтгрузки,"ДЛФ=DT; ДП=");
		КонецЕсли;
		Область2.Параметры.Пункт10_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт8_7 =  СтрокаДоверенность; 
		//		
		Область2.Параметры.Пункт10_9 = ПредставлениеВодителя10_9;
		Область2.Параметры.Пункт8_8 = ПредставлениеВодителя10_9;
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
	//		мСоглашениеСПоставщиком = ПолучитьДействующееСоглашениеСПоставщиком(СтрокаМаршрута.ЗНО.Перевозчик);
	//		Если мСоглашениеСПоставщиком <> Справочники.СоглашенияСПоставщиками.ПустаяСсылка() Тогда
	//			Область3.Параметры.Пункт12_5 = "по договору №"+СокрЛП(мСоглашениеСПоставщиком.Номер)+" от "+Формат(мСоглашениеСПоставщиком.Дата,"ДФ=dd.MM.yyyy"); 
	//		КонецЕсли;
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023 
	Область3.Параметры.Пункт12_5 = "по договору";
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 и Найти(Врег(ПредставлениеВодителя6_2),Врег("Евтюхин"))>0 Тогда
	//		Область3.Параметры.Пункт12_11 = "                     Евтюхин А.В."; 
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
		
	СтруктураУполномоченногоЛицаПеревозчика = ПолучитьСтруктуруУполномоченногоЛицаПеревозчика(РеквизитыЗНО.Перевозчик, ОбщаяДата);
	Если СтруктураУполномоченногоЛицаПеревозчика <> Неопределено Тогда 
		Область3.Параметры.Пункт12_11 = СтруктураУполномоченногоЛицаПеревозчика.УполномоченноеЛицо;
		Область3.Параметры.Пункт12_13 = СтруктураУполномоченногоЛицаПеревозчика.РольУполномоченногоЛица;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаМаршрута.Экспедитор) И Не ОчиститьЭкспедитора Тогда 
		Область3.Параметры.Пункт12_7 = "";	
	Иначе
		Область3.Параметры.Пункт12_7 = ПредставлениеГрузоотправителя + "   " + Формат(РеквизитыЗНО.Дата, "ДЛФ=Д");
	КонецЕсли;
	
	Область3.Параметры.Пункт12_6 = Перевозчик;
	
	ТабДокумент.Вывести(Область3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции  

&НаСервере
Функция ПолучитьТранспортнуюНакладнуюИнойПеревозчикЧерезКаргомарт(СтрокаМаршрута, ПараметрыФормированияТН)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДляНалоговой = ПараметрыФормированияТН.ДляНалоговой;
	ОчиститьЭкспедитора = ПараметрыФормированияТН.ОчиститьЭкспедитора;
	ОчиститьПеревозчика = ПараметрыФормированияТН.ОчиститьПеревозчика;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	Если ДвусторонняяПечатьТранспортнойНакладной тогда
		ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	КонецЕсли;	
		//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2022");
	Область1 = Макет.ПолучитьОбласть("Область1");
	Область2 = Макет.ПолучитьОбласть("Область2");
	Область3 = Макет.ПолучитьОбласть("Область3");
	
	РеквизитыЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Дата, Номер, ДатаОтгрузки, Перевозчик");
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказПоставщику") И СтрЗаказ.Пометка = 1 И ЗначениеЗаполнено(СтрЗаказ.Водитель)
			И ТипЗнч(СтрЗаказ.Водитель) = Тип("СправочникСсылка.Склады") И ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.Водитель, "ТИпСклада") = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, РеквизитыЗНО.Номер);
	
	МассивСкладов = Новый Массив;	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе	
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда	
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда	
						МассивСкладов.Добавить(ТекДок.Контрагент);	
					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 	
		КонецЕсли;	
	КонецЦикла;
		
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
		
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаОтгрузкуЗаказы.Склад
	|ИЗ
	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	|ГДЕ
	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
	
	Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЗначениеЗаполнено(Рез.Склад) Тогда
			СкладОтправитель = Рез.Склад;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал как архаизм по задаче #10606240
		//Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда 
		//	ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		//Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		//КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	// Аникин 27.01.2023 17:46:10 -->
	ДанныеДляПечати.Колонки.Добавить("ПунктПогрузки");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузоотправителе");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузополучателе");
	СкладНКЗЗаморозка = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	СкладНСКЗаморозка = Справочники.Склады.НайтиПоНаименованию("НСК Заморозка (WMS) - ТЛМ2");
	СкладПолучательКемерово = Справочники.Склады.НайтиПоНаименованию("Кемерово");
	СкладПолучательНовокузнецк = Справочники.Склады.НайтиПоНаименованию("Новокузнецк");
	// <-- Аникин 27.01.2023 17:46:10
	
	СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(РеквизитыЗНО.Перевозчик, ТекущаяДата());
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьЗапросПолучитьТранспортнуюНакладную2022();	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВсеПунктыРазгрузкиСтрока = "";
	ОбщийГрузоотправитель = Неопределено;
	ОбщийГрузополучатель  = Неопределено;
	ОбщаяДата = Дата(1, 1, 1);
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		// Аникин 27.01.2023 17:46:10 -->
		НоваяСтрока.ПунктПогрузки = ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		
		Если СтрНайти(ВсеПунктыРазгрузкиСтрока, СокрЛП(ВыборкаПунктов.ПунктРазгрузки)) = 0 Тогда 
			ВсеПунктыРазгрузкиСтрока = ВсеПунктыРазгрузкиСтрока + ?(ПустаяСтрока(ВсеПунктыРазгрузкиСтрока), "", ", ") + СокрЛП(ВыборкаПунктов.ПунктРазгрузки);
		КонецЕсли;
		
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0; 
		
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 ОбщаяВыборка в теории может быть пустая
		ПодменаСкладОтправитель = СкладОтправитель;  
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023  

		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			// v.nagaycev@kdvm.ru 16.11.2023
			НоваяСтрока.СведенияОГрузополучателе  = СведенияОГрузополучателе;
			НоваяСтрока.СведенияОГрузоотправителе = СведенияОГрузоотправитель;
			
			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				НоваяСтрока.ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			
			СведенияОВодителе     = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель  = ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик 	  = ОбщаяВыборка.Перевозчик;
			ОбщийВодитель 		  = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ОбщаяДата 	= ОбщаяВыборка.Дата;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто  = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			
			// Аникин 27.01.2023 17:46:10 -->
			// v.nagaycev@kdvm.ru 08.08.2023 закомментировал, Женя Сидоренко попросила
			//ПодменаСкладОтправитель = СкладОтправитель;
			//Если ОбщаяВыборка.Дефростация = ЛОЖЬ Тогда
			//	Если ОбщаяВыборка.Отправитель = СкладНСКЗаморозка Тогда
			//		Если ТипЗнч(ОбщаяВыборка.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			//			СкладПолучатель = ОбщаяВыборка.Получатель;
			//			Если СкладПолучатель.Родитель = СкладПолучательКемерово ИЛИ СкладПолучатель.Родитель = СкладПолучательНовокузнецк Тогда
			//				ПодменаСкладОтправитель = СкладНКЗЗаморозка;
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			// <-- Аникин 27.01.2023 17:46:10
			
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		// Аникин 27.01.2023 17:46:10 -->
		Если СкладОтправитель <> ПодменаСкладОтправитель Тогда
			НоваяСтрока.ПунктПогрузки = ПолучитьАдресМагазина(ПодменаСкладОтправитель);
		КонецЕсли;
		// <-- Аникин 27.01.2023 17:46:10
				
	КонецЦикла;
	
	ПредставлениеГрузоотправителя = "";
	ПредставлениеПеревозчика      = "";
	Перевозчик                    = "";
	Грузоотправитель              = "";
		
	Если ОбщийГрузополучатель <> Неопределено Тогда
		
		СведенияОГрузополучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузополучатель, ОбщаяДата); 
		
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
				"ПолноеНаименование,ФактическийАдрес,Телефоны,ИНН");
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщийГрузоотправитель <> Неопределено Тогда
		
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузоотправитель, ОбщаяДата); 
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			//Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,ИНН");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			//Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;	
		
	КонецЕсли;
	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция"; 
	Область1.Параметры.Пункт1_0	= "✔"; 
	Область1.Параметры.Пункт1_1 = "Акционерное общество ""Корса"", ИНН 7017477919, 634034,обл Томская, г Томск, пер Инструментальный, дом 51А, каб414, 78002500200"; 
	Область1.Параметры.Пункт1а_1 = ПредставлениеГрузоотправителя;
	Область1.Параметры.Пункт1а_2 = "Транспортной экспедиции, 2/2022, 10.03.2022";																										
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	Область1.Параметры.Пункт2_2 = ВсеПунктыРазгрузкиСтрока;	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 = "";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) Тогда
		Пункт4_1 = "ТОРГ-13 № " + СтрокаПеремещенийДата; //СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаРеализацийДата) Тогда
		Если Не ПустаяСтрока(Пункт4_1) Тогда
			Пункт4_1 = Пункт4_1 + Символы.ПС;
		КонецЕсли;
		Пункт4_1 = Пункт4_1 + "ТОРГ-12 № " + СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	
	Попытка  
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал и добавил ИНН у перевозчика по задаче #10606240
		//Если ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//	ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//Иначе 
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
		Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если Не ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		
		ПредставлениеВодителяПолное  = СокрЛП(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2Полное = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), СокрЛП(СтрокаМаршрута.Водитель2), "");
		
		ТелефонВодителя  = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
		
		ВУВодителя  = ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель);
		ВУВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель2), "");
		
	Иначе 
		
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = "";
		
		ПредставлениеВодителяПолное  = "";
		ПредставлениеВодителя2Полное = "";

		ТелефонВодителя  = "";
		ТелефонВодителя2 = "";
		
		ВУВодителя  = "";
		ВУВодителя2 = "";
		
	КонецЕсли; 
		
	//+27.06.2022 n.chernyshov@kdvm.ru если водителя 2 то оставляем пустыми 6.2, 8.8, 10.9
	ПредставлениеВодителя6_2  = "";
	ПредставлениеВодителя10_9 = "Водитель ______________";
	
	Если СокрЛП(ПредставлениеВодителя) <> "" и СокрЛП(ПредставлениеВодителя2) <> "" Тогда
		Если Найти(Врег(ПредставлениеВодителя2), "ПОДРАБОТКА") > 0 Тогда
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
			//Вывод двух водителей в 6_2 31.10.2022 n.chernyshov@kdvm.ru
		Иначе
			Если СокрЛП(ПредставлениеВодителяПолное) <> "" Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителяПолное);
				Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
				КонецЕсли;
			КонецЕсли;
			Если СокрЛП(ПредставлениеВодителя2Полное) <> "" Тогда
				Если ПредставлениеВодителя6_2 <> "" Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + " / ";
				КонецЕсли;
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителя2Полное);
				Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СокрЛП(ПредставлениеВодителя) <> "" Тогда
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
		Иначе
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителя2Полное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя2);
			Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;	
	//-27.06.2022 n.chernyshov@kdvm.ru
		
	Область1.Параметры.Пункт6_2 = ПредставлениеВодителя6_2;
	
	// v.nagaycev@kdvm.ru 08/08/2023
	//Область1.Параметры.Пункт7_1 = Автомобиль.Марка;
	//Область1.Параметры.Пункт7_2 = Автомобиль.Код;
	РеквизитыАвтомобиля = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Автомобиль, "Код, Марка, Прицеп, ГосударственныйНомерПрицепа");
	Строка7_1 = "Тягач " + РеквизитыАвтомобиля.Марка + ?(ПустаяСтрока(РеквизитыАвтомобиля.Прицеп), "", " / прицеп " + РеквизитыАвтомобиля.Прицеп);
	Строка7_2 = "Тягач " + РеквизитыАвтомобиля.Код + ?(ПустаяСтрока(РеквизитыАвтомобиля.ГосударственныйНомерПрицепа), "", " / прицеп " + РеквизитыАвтомобиля.ГосударственныйНомерПрицепа);
	Область1.Параметры.Пункт7_1 = Строка7_1;
	Область1.Параметры.Пункт7_2 = Строка7_2;
	
	// 16.05.2024 v.nagaycev@kdvm.ru
	Область1.Параметры.Пункт7_3 = ПолучитьТипВладенияТСПеревозчика(РеквизитыЗНО.Перевозчик);	
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240  
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
	//		Область1.Параметры.Пункт7_3 = "1";
	//	КонецЕсли;  
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	Если ОчиститьПеревозчика Тогда
		Область1.Параметры.Пункт6_1 = "";
		Область1.Параметры.Пункт6_2 = "";
	КонецЕсли;
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ?(ДляНалоговой = Истина, "", ПараметрыСеанса.ТекущийПользователь.Наименование);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	//-
	 Область2.Параметры.Пункт8_0 	= ПредставлениеГрузоотправителя;
	 Область2.Параметры.Пункт8_1	= "ООО «Камелот-А» ИНН 7017187800" ;
	
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт8_5	= "Масса нетто " + Формат(Запись2.Веснетто,"ЧДЦ=3") + " кг.";
		// Аникин 27.01.2023 17:46:10 -->
		//Область2.Параметры.Пункт8_2 = ПунктПогрузки;
		Область2.Параметры.Пункт8_2 = Запись2.ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		Если ЗначениеЗаполнено(РеквизитыЗНО.ДатаОтгрузки) Тогда
			Область2.Параметры.Пункт8_41 = Формат(РеквизитыЗНО.ДатаОтгрузки, "ДЛФ=DT; ДП=");
		КонецЕсли;
		Область2.Параметры.Пункт10_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт8_7 =  СтрокаДоверенность; 
		//		
		Область2.Параметры.Пункт10_9 = ПредставлениеВодителя10_9;
		Область2.Параметры.Пункт8_8 = ПредставлениеВодителя10_9;
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
	//		мСоглашениеСПоставщиком = ПолучитьДействующееСоглашениеСПоставщиком(СтрокаМаршрута.ЗНО.Перевозчик);
	//		Если мСоглашениеСПоставщиком <> Справочники.СоглашенияСПоставщиками.ПустаяСсылка() Тогда
	//			Область3.Параметры.Пункт12_5 = "по договору №"+СокрЛП(мСоглашениеСПоставщиком.Номер)+" от "+Формат(мСоглашениеСПоставщиком.Дата,"ДФ=dd.MM.yyyy"); 
	//		КонецЕсли;
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023      
	
	Область3.Параметры.Пункт12_5 = "по договору";
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 и Найти(Врег(ПредставлениеВодителя6_2),Врег("Евтюхин"))>0 Тогда
	//		Область3.Параметры.Пункт12_11 = "                     Евтюхин А.В."; 
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	СтруктураУполномоченногоЛицаПеревозчика = ПолучитьСтруктуруУполномоченногоЛицаПеревозчика(РеквизитыЗНО.Перевозчик, ОбщаяДата);
	Если СтруктураУполномоченногоЛицаПеревозчика <> Неопределено Тогда 
		Область3.Параметры.Пункт12_11 = СтруктураУполномоченногоЛицаПеревозчика.УполномоченноеЛицо;
		Область3.Параметры.Пункт12_13 = СтруктураУполномоченногоЛицаПеревозчика.РольУполномоченногоЛица;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаМаршрута.Экспедитор) И Не ОчиститьЭкспедитора Тогда 
		Область3.Параметры.Пункт12_7 = "";	
	Иначе
		Область3.Параметры.Пункт12_7 = "Акционерное общество ""Корса"", ИНН 7017477919, 634034,обл Томская, г Томск, пер Инструментальный, дом 51А, каб414, 78002500200" + "   " + Формат(РеквизитыЗНО.Дата, "ДЛФ=Д"); 
	КонецЕсли;
	
	Область3.Параметры.Пункт12_6 = Перевозчик;
	
	ТабДокумент.Вывести(Область3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтрокаМаршрута.Напечатано = Истина;
	СтрокаМаршрута.НомерМЛ = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции  

&НаСервере
Функция ПолучитьТранспортнуюНакладнуюИнойПеревозчикМинуяКаргомарт(СтрокаМаршрута, ПараметрыФормированияТН)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДляНалоговой = ПараметрыФормированияТН.ДляНалоговой;
	ОчиститьЭкспедитора = ПараметрыФормированияТН.ОчиститьЭкспедитора;
	ОчиститьПеревозчика = ПараметрыФормированияТН.ОчиститьПеревозчика;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет; 
	Если ДвусторонняяПечатьТранспортнойНакладной тогда
		ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	КонецЕсли;	
		//ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная2022");
	Область1 = Макет.ПолучитьОбласть("Область1");
	Область2 = Макет.ПолучитьОбласть("Область2");
	Область3 = Макет.ПолучитьОбласть("Область3");

	РеквизитыЗНО = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаМаршрута.ЗНО, "Дата, Номер, ДатаОтгрузки, Перевозчик");
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль) = Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказПоставщику") И СтрЗаказ.Пометка = 1 И ЗначениеЗаполнено(СтрЗаказ.Водитель)
			И ТипЗнч(СтрЗаказ.Водитель) = Тип("СправочникСсылка.Склады") И ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрЗаказ.Водитель, "ТИпСклада") = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;
	
	ШтрихкодНакладной = СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, РеквизитыЗНО.Номер);
	
	МассивСкладов = Новый Массив;	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе	
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда	
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда	
						МассивСкладов.Добавить(ТекДок.Контрагент);	
					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 	
		КонецЕсли;	
	КонецЦикла;
		
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// это самый верхний уровень - по машинкам
	Автомобиль = СтрокаМаршрута.Автомобиль;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов 		  = "";
	СтрокаПеремещений 	  = "";
	СтрокаПеремещенийДата = "";
	СтрокаРеализацийДата  = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
		
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказНаОтгрузкуЗаказы.Склад
	|ИЗ
	|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	|ГДЕ
	|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
	
	Запрос.УстановитьПараметр("ЗНО", СтрокаМаршрута.ЗНО);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		Если ЗначениеЗаполнено(Рез.Склад) Тогда
			СкладОтправитель = Рез.Склад;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(СкладОтправитель) тогда
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал как архаизм по задаче #10606240
		//Если СкладОтправитель.ПринадлежитЭлементу(Справочники.Склады.НайтиПоНаименованию("Склады Обухово")) тогда 
		//	ПунктПогрузки = "142440, Московская Область, Ногинский р-н, Обухово рп, Кудиновское ш., 4Б";	
		//Иначе	
			ПунктПогрузки = ПолучитьАдресМагазина(СкладОтправитель);
		//КонецЕсли;
	Иначе
		ПунктПогрузки = "";
	КонецЕсли;	
	
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	// Аникин 27.01.2023 17:46:10 -->
	ДанныеДляПечати.Колонки.Добавить("ПунктПогрузки");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузоотправителе");
	ДанныеДляПечати.Колонки.Добавить("СведенияОГрузополучателе");
	СкладНКЗЗаморозка = Справочники.Склады.НайтиПоНаименованию("НКЗ Заморозка (WMS)");
	СкладНСКЗаморозка = Справочники.Склады.НайтиПоНаименованию("НСК Заморозка (WMS) - ТЛМ2");
	СкладПолучательКемерово = Справочники.Склады.НайтиПоНаименованию("Кемерово");
	СкладПолучательНовокузнецк = Справочники.Склады.НайтиПоНаименованию("Новокузнецк");
	// <-- Аникин 27.01.2023 17:46:10
	
	СведенияОПеревозчике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(РеквизитыЗНО.Перевозчик, ТекущаяДата());
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = ВернутьЗапросПолучитьТранспортнуюНакладную2022();	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", СтрокаМаршрута.Перевозчик);
	Запрос.УстановитьПараметр("Водитель", СтрокаМаршрута.Водитель);
	Запрос.УстановитьПараметр("Автомобиль", СтрокаМаршрута.Автомобиль);

	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ВсеПунктыРазгрузкиСтрока = "";
	ОбщийГрузоотправитель = Неопределено;
	ОбщийГрузополучатель = Неопределено;
	ОбщаяДата = Дата(1, 1, 1);
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		// Аникин 27.01.2023 17:46:10 -->
		НоваяСтрока.ПунктПогрузки = ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		
		Если СтрНайти(ВсеПунктыРазгрузкиСтрока, СокрЛП(ВыборкаПунктов.ПунктРазгрузки)) = 0 Тогда 
			ВсеПунктыРазгрузкиСтрока = ВсеПунктыРазгрузкиСтрока + ?(ПустаяСтрока(ВсеПунктыРазгрузкиСтрока), "", ", ") + СокрЛП(ВыборкаПунктов.ПунктРазгрузки);
		КонецЕсли;
		
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0; 
		
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 ОбщаяВыборка в теории может быть пустая
		ПодменаСкладОтправитель = СкладОтправитель;  
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023  

		Пока ОбщаяВыборка.Следующий() Цикл
			// присвоим общие значения Для ТТН
			//ОбластьМакета.Параметры.Пункт0_1	= ОбщаяВыборка.Номер;
			//
			//ОбластьМакета.Параметры.Пункт0_2	= ОбщаяВыборка.ДатаЗаказа; 
			//ОбластьМакета.Параметры.Пункт0_3	= ОбщаяВыборка.НомерЗаказа; 
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			// v.nagaycev@kdvm.ru 16.11.2023
			НоваяСтрока.СведенияОГрузополучателе  = СведенияОГрузополучателе;
			НоваяСтрока.СведенияОГрузоотправителе = СведенияОГрузоотправитель;
			
			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
				НоваяСтрока.ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			
			СведенияОВодителе     = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель  = ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик 	  = ОбщаяВыборка.Перевозчик;
			ОбщийВодитель 		  = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ОбщаяДата   = ОбщаяВыборка.Дата;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто  = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			
			// Аникин 27.01.2023 17:46:10 -->
			// v.nagaycev@kdvm.ru 08.08.2023 закомментировал, Женя Сидоренко попросила
			//ПодменаСкладОтправитель = СкладОтправитель;
			//Если ОбщаяВыборка.Дефростация = ЛОЖЬ Тогда
			//	Если ОбщаяВыборка.Отправитель = СкладНСКЗаморозка Тогда
			//		Если ТипЗнч(ОбщаяВыборка.Получатель) = Тип("СправочникСсылка.Склады") Тогда
			//			СкладПолучатель = ОбщаяВыборка.Получатель;
			//			Если СкладПолучатель.Родитель = СкладПолучательКемерово ИЛИ СкладПолучатель.Родитель = СкладПолучательНовокузнецк Тогда
			//				ПодменаСкладОтправитель = СкладНКЗЗаморозка;
			//			КонецЕсли;
			//		КонецЕсли;
			//	КонецЕсли;
			//КонецЕсли;
			// <-- Аникин 27.01.2023 17:46:10
			
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		// Аникин 27.01.2023 17:46:10 -->
		Если СкладОтправитель <> ПодменаСкладОтправитель Тогда
			НоваяСтрока.ПунктПогрузки = ПолучитьАдресМагазина(ПодменаСкладОтправитель);
		КонецЕсли;
		// <-- Аникин 27.01.2023 17:46:10
		
	КонецЦикла;	
	
	ПредставлениеГрузоотправителя = "";
	ПредставлениеПеревозчика      = "";
	ПредставлениеЭкспедитора      = "";
	Перевозчик                    = "";
	Грузоотправитель              = "";
		
	Если ОбщийГрузополучатель <> Неопределено Тогда
		
		СведенияОГрузополучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузополучатель, ОбщаяДата); 
		
		Если ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
				"ПолноеНаименование,ФактическийАдрес,ИНН");
		КонецЕсли;
		
	КонецЕсли;
	
	Пункт1_1 = "";
	
	Если ОбщийГрузоотправитель <> Неопределено Тогда
		
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщийГрузоотправитель, ОбщаяДата); 
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
			Пункт1_1 = ПредставлениеГрузоотправителя;
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ФактическийАдрес,ИНН");
			//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Пункт1_1 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаМаршрута.Экспедитор) Или ОчиститьЭкспедитора Тогда
		
		Область1.Параметры.Пункт1_0  = "✔";
		Область1.Параметры.Пункт1а_1 = Пункт1_1;
		
		Если Не ОчиститьЭкспедитора Тогда
			ПредставлениеЭкспедитора = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.Экспедитор, ОбщаяДата), 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Пункт1_1 = ПредставлениеЭкспедитора;
			Область3.Параметры.Пункт12_10 = ПредставлениеЭкспедитора;
		КонецЕсли;
			
	КонецЕсли;
	
	Область1.Параметры.Пункт1_1 = Пункт1_1;
	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	Область1.Параметры.Пункт2_2 = ВсеПунктыРазгрузкиСтрока;	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 = "";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1 = "ТОРГ-13 № " + СтрокаПеремещенийДата; //СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если Не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если Не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1 + Символы.ПС;
		КонецЕсли;
		Пункт4_1 = Пункт4_1 + "ТОРГ-12 № " + СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	
	Попытка  
		//n.chernyshov@kdvm.ru начало вставки 07.06.2023 закомментировал и добавил ИНН у перевозчика по задаче #10606240
		//Если ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		//	ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		//	"ПолноеНаименование,ФактическийАдрес,Телефоны");
		//	Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		//	Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//Иначе 
		//n.chernyshov@kdvm.ru конец вставки 07.06.2023
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
			Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
		//КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН");
		Область1.Параметры.Пункт6_1 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если Не ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(СтрокаМаршрута.Водитель2), "");
		
		ПредставлениеВодителяПолное  = СокрЛП(СтрокаМаршрута.Водитель);
		ПредставлениеВодителя2Полное = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), СокрЛП(СтрокаМаршрута.Водитель2), "");
		
		ТелефонВодителя  = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(СтрокаМаршрута.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
		
		ВУВодителя  = ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель);
		ВУВодителя2 = ?(ЗначениеЗаполнено(СтрокаМаршрута.Водитель2), ПолучитьВодительскоеУдостоверениеВодителя(РеквизитыЗНО.ДатаОтгрузки, СтрокаМаршрута.Водитель2), "");
		
	Иначе
		
		ПредставлениеВодителя  = "";
		ПредставлениеВодителя2 = "";   
		
		ПредставлениеВодителяПолное  = "";
		ПредставлениеВодителя2Полное = "";

		ТелефонВодителя  = "";
		ТелефонВодителя2 = "";
		
		ВУВодителя  = "";
		ВУВодителя2 = "";
		
	КонецЕсли; 
		
	//+27.06.2022 n.chernyshov@kdvm.ru если водителя 2 то оставляем пустыми 6.2, 8.8, 10.9
	ПредставлениеВодителя6_2  = "";
	ПредставлениеВодителя10_9 = "Водитель ______________";
	
	Если СокрЛП(ПредставлениеВодителя) <> "" и СокрЛП(ПредставлениеВодителя2) <> "" Тогда
		Если Найти(Врег(ПредставлениеВодителя2),"ПОДРАБОТКА")>0 Тогда
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
			//Вывод двух водителей в 6_2 31.10.2022 n.chernyshov@kdvm.ru
		Иначе
			Если СокрЛП(ПредставлениеВодителяПолное) <> "" Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителяПолное);
				Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
				КонецЕсли;
			КонецЕсли;
			Если СокрЛП(ПредставлениеВодителя2Полное) <> "" Тогда
				Если ПредставлениеВодителя6_2 <> "" Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + " / ";
				КонецЕсли;
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + СокрЛП(ПредставлениеВодителя2Полное);
				Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
				КонецЕсли;
				Если ЗначениеЗаполнено(ВУВодителя2) Тогда
					ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если СокрЛП(ПредставлениеВодителя) <> "" Тогда
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителяПолное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя);
			Если ЗначениеЗаполнено(ТелефонВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя);
			КонецЕсли;
		Иначе
			ПредставлениеВодителя6_2 = СокрЛП(ПредставлениеВодителя2Полное);
			ПредставлениеВодителя10_9 = ПредставлениеВодителя10_9 + СокрЛП(ПредставлениеВодителя2);
			Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ТелефонВодителя2);
			КонецЕсли;
			Если ЗначениеЗаполнено(ВУВодителя2) Тогда
				ПредставлениеВодителя6_2 = ПредставлениеВодителя6_2 + ", " + СокрЛП(ВУВодителя2);
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;	
	
	//-27.06.2022 n.chernyshov@kdvm.ru
	
	РеквизитыАвтомобиля = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Автомобиль, "Код, Марка, Прицеп, ГосударственныйНомерПрицепа");
	
	Пункт7_1 = "";
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Марка) Тогда
		Пункт7_1 = СтрШаблон("Тягач, %1", РеквизитыАвтомобиля.Марка); 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Прицеп) Тогда
		Пункт7_1 = СтрШаблон("%1%2%3", Пункт7_1, ?(ПустаяСтрока(Пункт7_1), "", " / "), СтрШаблон("Полуприцеп, %1", РеквизитыАвтомобиля.Прицеп)); 		
	КонецЕсли; 
	
	Пункт7_2 = "";
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.Код) Тогда
		Пункт7_2 = СтрШаблон("Тягач, %1", РеквизитыАвтомобиля.Код); 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитыАвтомобиля.ГосударственныйНомерПрицепа) Тогда
		Пункт7_2 = СтрШаблон("%1%2%3", Пункт7_2, ?(ПустаяСтрока(Пункт7_2), "", " / "), СтрШаблон("Полуприцеп, %1", РеквизитыАвтомобиля.ГосударственныйНомерПрицепа)); 		
	КонецЕсли;
		
	Область1.Параметры.Пункт6_2 = ПредставлениеВодителя6_2;
	Область1.Параметры.Пункт7_1 = Пункт7_1;
	Область1.Параметры.Пункт7_2 = Пункт7_2;
	
	// 16.05.2024 v.nagaycev@kdvm.ru получаем тип владения ТС
	Область1.Параметры.Пункт7_3 = ПолучитьТипВладенияТСПеревозчика(РеквизитыЗНО.Перевозчик);
	
	Если ОчиститьПеревозчика Тогда
		Область1.Параметры.Пункт6_1 = "";
		Область1.Параметры.Пункт6_2 = "";
	КонецЕсли;	
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240  
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
	//		Область1.Параметры.Пункт7_3 = "1";
	//	КонецЕсли;  
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ?(ДляНалоговой = Истина, "", ПараметрыСеанса.ТекущийПользователь.Наименование);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	Область2.Параметры.Пункт8_0	= ПредставлениеГрузоотправителя;
	Область2.Параметры.Пункт8_1	= "ООО «Камелот-А» ИНН 7017187800" ;
	
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт8_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		// Аникин 27.01.2023 17:46:10 -->
		//Область2.Параметры.Пункт8_2 = ПунктПогрузки;
		Область2.Параметры.Пункт8_2 = Запись2.ПунктПогрузки;
		// <-- Аникин 27.01.2023 17:46:10
		Если ЗначениеЗаполнено(РеквизитыЗНО.ДатаОтгрузки) Тогда
			Область2.Параметры.Пункт8_41 = Формат(РеквизитыЗНО.ДатаОтгрузки,"ДЛФ=DT; ДП=");
		КонецЕсли;
		Область2.Параметры.Пункт10_1 = Запись2.ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт8_7 =  СтрокаДоверенность; 
		//		
		Область2.Параметры.Пункт10_9 = ПредставлениеВодителя10_9;
		Область2.Параметры.Пункт8_8 = ПредставлениеВодителя10_9;
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	Область3.Параметры.Пункт12_5 = "по договору";
	Попытка
		//Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 Тогда
			мСоглашениеСПоставщиком = ПолучитьДействующееСоглашениеСПоставщиком(РеквизитыЗНО.Перевозчик);
			Если мСоглашениеСПоставщиком <> Справочники.СоглашенияСПоставщиками.ПустаяСсылка() Тогда
				Область3.Параметры.Пункт12_5 = "по договору №"+СокрЛП(мСоглашениеСПоставщиком.Номер)+" от "+Формат(мСоглашениеСПоставщиком.Дата,"ДФ=dd.MM.yyyy"); 
			КонецЕсли;
		//КонецЕсли;
	Исключение
	КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023  
	
	////n.chernyshov@kdvm.ru начало вставки 07.06.2023 по задаче #10606240 
	//Попытка
	//	Если Найти(Врег(СокрЛП(СтрокаМаршрута.ЗНО.Перевозчик)),Врег("Евтюхин"))>0 и Найти(Врег(ПредставлениеВодителя6_2),Врег("Евтюхин"))>0 Тогда
	//		Область3.Параметры.Пункт12_11 = "                     Евтюхин А.В."; 
	//	КонецЕсли;
	//Исключение
	//КонецПопытки;
	////n.chernyshov@kdvm.ru конец вставки 07.06.2023
	
	СтруктураУполномоченногоЛицаПеревозчика = ПолучитьСтруктуруУполномоченногоЛицаПеревозчика(РеквизитыЗНО.Перевозчик, РеквизитыЗНО.Дата);
	Если СтруктураУполномоченногоЛицаПеревозчика <> Неопределено Тогда 
		Область3.Параметры.Пункт12_11 = СтруктураУполномоченногоЛицаПеревозчика.УполномоченноеЛицо;
		Область3.Параметры.Пункт12_13 = СтруктураУполномоченногоЛицаПеревозчика.РольУполномоченногоЛица;
	КонецЕсли;
	
	Попытка 
		Если ЗначениеЗаполнено(СтрокаМаршрута.Экспедитор) И Не ОчиститьЭкспедитора Тогда 
			Область3.Параметры.Пункт12_7 = "";	
		Иначе
			Область3.Параметры.Пункт12_7 = ПредставлениеГрузоотправителя + "   " + Формат(РеквизитыЗНО.Дата, "ДЛФ=Д");
		КонецЕсли;
 	Исключение
	КонецПопытки; 
	
	Область3.Параметры.Пункт12_6 = Перевозчик;
	
	ТабДокумент.Вывести(Область3);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	СтрокаМаршрута.Напечатано 	 = Истина;
	СтрокаМаршрута.НомерМЛ 		 = ШтрихкодНакладной;
	СтрокаМаршрута.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	Возврат ТабДокумент;
	
КонецФункции  

//n.chernyshov@kdvm.ru конец вставки 01.08.2023

&НаСервере
Функция ПолучитьСтруктуруУполномоченногоЛицаПеревозчика(Знач Партнер, ДатаДокумента)
	
	СтруктураУполномоченногоЛица = Неопределено;
	
	Если ТипЗнч(Партнер) = Тип("СправочникСсылка.Контрагенты") Тогда
		Партнер = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Партнер, "Партнер");
	КонецЕсли;
	
	Если ТипЗнч(Партнер) = Тип("СправочникСсылка.Партнеры") И ЗначениеЗаполнено(Партнер) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Владелец", 	   		 Партнер);
		Запрос.УстановитьПараметр("ДатаДокумента", 		 ДатаДокумента);
		Запрос.УстановитьПараметр("РольКонтактногоЛица", Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию("Генеральный директор"));
		Запрос.Текст = "ВЫБРАТЬ
		|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
		|	КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи
		|ПОМЕСТИТЬ втКонтактныеЛица
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Владелец = &Владелец
		|	И КонтактныеЛицаПартнеров.ПометкаУдаления = ЛОЖЬ
		|	И (КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КонтактныеЛицаПартнеров.ДатаПрекращенияСвязи > &ДатаДокумента)
		|	И (КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ КонтактныеЛицаПартнеров.ДатаРегистрацииСвязи <= &ДатаДокумента)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	втКонтактныеЛица.Ссылка КАК УполномоченноеЛицо,
		|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица КАК РольУполномоченногоЛица
		|ИЗ
		|	втКонтактныеЛица КАК втКонтактныеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
		|		ПО втКонтактныеЛица.Ссылка = КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаРегистрацииСвязи УБЫВ";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			СтруктураУполномоченногоЛица = Новый Структура;
			СтруктураУполномоченногоЛица.Вставить("УполномоченноеЛицо", 	 Выборка.УполномоченноеЛицо);
			СтруктураУполномоченногоЛица.Вставить("РольУполномоченногоЛица", Выборка.РольУполномоченногоЛица);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураУполномоченногоЛица;
	
КонецФункции

&НаСервере
Функция ПолучитьТипВладенияТСПеревозчика(Перевозчик)
	
	ТипВладенияТС = УправлениеСвойствамиПовтИсп.ЗначениеДополнительногоРеквизитаПоНаименованию(Перевозчик, "Тип владения ТС (для перевозчика)");
	Если ТипВладенияТС = Неопределено Тогда
		ТипВладенияТС = "";
	КонецЕсли;
	
	Возврат Строка(ТипВладенияТС);
	
КонецФункции

&НаСервере
Функция ПолучитьВодительскоеУдостоверениеВодителя(Период, Водитель)
	
	ВодительскоеУдостоверение = "";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",  Период);
	Запрос.УстановитьПараметр("Физлицо", Водитель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокументыФизическихЛицСрезПоследних.Серия,
	               |	ДокументыФизическихЛицСрезПоследних.Номер
	               |ИЗ
	               |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	               |			&Период,
	               |			Физлицо = &Физлицо
	               |				И ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВодительскоеУдостоверение)) КАК ДокументыФизическихЛицСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ВодительскоеУдостоверение = СтрШаблон("ВУ %1 %2", Выборка.Серия, Выборка.Номер);
	КонецЕсли;
	
	Возврат ВодительскоеУдостоверение; 
	
КонецФункции

//печать внут перемещение
&НаСервере
Функция СформироватьПечатнуюФормуПриложениеКВнутренемуПеремещению(СтрокаМаршрута)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивДокументов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") И МассивДокументов.Найти(СтрЗаказ.Автомобиль)=Неопределено И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		КонецЕсли;	
	КонецЦикла;	
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ПФ_MXL_ВнутренееПеремещение");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПеремещениеТоваров_ПриложениеКВнутренемуПеремещению";
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Перемещение.Ссылка КАК Документ,
	|	Перемещение.Номер КАК НомерДокумента,
	|	Перемещение.Дата КАК ДатаДокумента,
	|	Перемещение.Организация КАК Организация
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Перемещение
	|ГДЕ
	|	Перемещение.Ссылка В(&МассивПеремещений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Документ");
	
	Запрос.УстановитьПараметр("МассивПеремещений", МассивДокументов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка = &ПеремещениеТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|АВТОУПОРЯДОЧИВАНИЕ");
	
	Пока Шапка.Следующий() Цикл
		НПП = 1;
		Если НЕ Шапка.Документ.Проведен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нельзя печатать не проведенные документы!");
			Продолжить;
		КонецЕсли; 
		
		Запрос.УстановитьПараметр("ПеремещениеТоваров", Шапка.Документ);
		ВыборкаСтрокТовары = Запрос.Выполнить().Выбрать();
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// Выводим общие реквизиты шапки.
		ОбластьМакета         = Макет.ПолучитьОбласть("Шапка");
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента);
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.Организация		= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации);
		ОбластьМакета.Параметры.НомерДокумента	= ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Шапка.НомерДокумента, Ложь, Истина);
		ОбластьМакета.Параметры.ДатаДокумента	= Шапка.ДатаДокумента;
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(ЗаголовокТаблицы);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьМакета.Параметры.Номенклатура = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СокрЛП(ВыборкаСтрокТовары.Номенклатура));
			
			ОбластьМакета.Параметры.НПП = НПП;
			СтруктураХарактеристик = ПолучитьСтруктуруДополнительныхХарактеристик(ВыборкаСтрокТовары.Номенклатура);
			ОбластьМакета.Параметры.Изготовитель = СтруктураХарактеристик.Изготовитель;
			ОбластьМакета.Параметры.РегистрационныйНомер = СтруктураХарактеристик.РегистрационныйНомер;
			ОбластьМакета.Параметры.ОрганСертификации = СтруктураХарактеристик.ОрганСертификации;
			
			ОбластьМакета.Параметры.ДатаВыдачиСертификата = СтруктураХарактеристик.ДатаВыдачиСертификата;
			ОбластьМакета.Параметры.ДатаОкончанияСертификата = СтруктураХарактеристик.ДатаОкончанияСертификата;
			
			ТабДокумент.Вывести(ОбластьМакета);
			НПП = НПП + 1;
		КонецЦикла; 
		
		// Выводим подвал документа
		ОбластьМакета  = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(ОбластьМакета);
		
		//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДополнительныхХарактеристик(Номенклатура)
	
	СтруктураРекизитов = Новый Структура("Изготовитель, РегистрационныйНомер, ОрганСертификации, ДатаВыдачиСертификата, ДатаОкончанияСертификата");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение,
	|	НоменклатураДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ОбъектДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Для Каждого ТекСтр Из ОбъектДокумент.ДополнительныеРеквизиты Цикл
		Если ТекСтр.Свойство.Наименование = "ДатаВыдачиСертификата"  Тогда
			СтруктураРекизитов.ДатаВыдачиСертификата = Формат(ТекСтр.Значение, "ДФ=dd.MM.yy");
		ИначеЕсли ТекСтр.Свойство.Наименование = "ДатаОкончанияСертификата" Тогда
			СтруктураРекизитов.ДатаОкончанияСертификата = Формат(ТекСтр.Значение, "ДФ=dd.MM.yy");
		ИначеЕсли ТекСтр.Свойство.Наименование = "Регистрационный номер сертификата" Тогда
			СтруктураРекизитов.РегистрационныйНомер = ТекСтр.Значение;
		ИначеЕсли ТекСтр.Свойство.Наименование = "Наименование органа сертификации" Тогда
			СтруктураРекизитов.ОрганСертификации = ТекСтр.Значение;
		ИначеЕсли ТекСтр.Свойство.Наименование = "Основной произВодитель" Тогда
			СтруктураРекизитов.Изготовитель = ТекСтр.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СтруктураРекизитов;
КонецФункции 
//конец печать внут перемещение 

//печать торг12
&НаСервере 
Функция СформироватьПечатнуюФормуТОРГ12(МассивДокументов, СтруктураПараметров)
	
	ОбъектыПечати = Новый СписокЗначений;
	Для Каждого ТекСтр Из МассивДокументов Цикл
		ОбъектыПечати.Добавить(ТекСтр);
	КонецЦикла; 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// ЛВО + 31.07.2019
	//ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ12(Новый Структура("ВыводитьУслуги", Ложь), МассивДокументов);
	Если СтруктураПараметров.ПечатьПоРеализации тогда
		  ДокументыРеализации = ПолучитьРеализацииПоЗаказамКлиента(МассивДокументов);
		  
		  Если ДокументыРеализации.Количество() = 0 тогда
			  ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ12(Новый Структура("ВыводитьУслуги", Ложь), МассивДокументов);
		  Иначе
			  ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ12_Осн(Новый Структура("ВыводитьУслуги", Ложь), ДокументыРеализации);
		  КонецЕсли;	  
	Иначе
		  ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыТОРГ12(Новый Структура("ВыводитьУслуги", Ложь), МассивДокументов);
	КонецЕсли;
	//-
	ЗаполнитьТабличныйДокументТОРГ12(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати);
	
	ДанныеДляПечати = Неопределено;
	
	//+a.buganov@kdvm.ru 03.05.2018
	КоличествоЭкземпляров = 0;
	Если ТабличныйДокумент.КоличествоЭкземпляров = 0 Тогда
		СтрПФ = НастройкаПечати.НайтиСтроки(Новый Структура("ДокументПечати", "ТОРГ-12"));
		Если СтрПФ.Количество() > 0 Тогда
			КоличествоЭкземпляров = СтрПФ[0].Количество;
		Иначе
			КоличествоЭкземпляров = Неопределено;
		КонецЕсли;
	Иначе
		КоличествоЭкземпляров = ТабличныйДокумент.КоличествоЭкземпляров;
	КонецЕсли;
	Попытка
		СохранитьДанныеОПечати(МассивДокументов, "ТОРГ 12", СтруктураПараметров.ЗНО, КоличествоЭкземпляров);
	Исключение
	КонецПопытки;
	//- 
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуТОРГ12()

// Функция получает данные для формирования печатной формы ТОРГ - 12.
//
Функция ПолучитьДанныеДляПечатнойФормыТОРГ12(ПараметрыПечати, МассивОбъектов) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|////////////////////////////////////////////////////////////////////////////
	|// ВРЕМЕННАЯ ТАБЛИЦА
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТ_ТаблицаКорректировок
	|ИЗ 
	|	&ТаблицаВВалютеРегл КАК ТаблицаВВалютеРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ШАПКЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка                                                 КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер                                                  КАК Номер,
	|	РеализацияТоваровУслуг.Дата                                                   КАК Дата,
	|	РеализацияТоваровУслуг.Партнер                                                КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент                                             КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация                                            КАК Организация,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель.Наименование           КАК РукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя               КАК ДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер.Наименование       КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Отпустил.Наименование                                  КАК Кладовщик,
	|	РеализацияТоваровУслуг.ОтпустилДолжность                                      КАК ДолжностьКладовщика,
	|	РеализацияТоваровУслуг.Организация.Префикс                                    КАК Префикс,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Контрагент
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Организация
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации                             КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента                             КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя                        КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя                         КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.АдресДоставки                                         КАК АдресДоставки,
	|	Неопределено                                                                 КАК Подразделение,
	|
	|	// При взаиморасчетах в иностранной валюте в обработку передаем суммы в валюте регл. учета.
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Ссылка В (&МассивДокументовВВалютеРегл) ТОГДА
	|		&ВалютаРегламентированногоУчета
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Валюта
	|	КОНЕЦ						                                                 КАК Валюта,
	|
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС                                       КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.ДоверенностьНомер                                     КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата                                      КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана                                    КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо                                      КАК ДоверенностьЛицо,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		Истина
	|	ИНАЧЕ
	|		Ложь
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Партнер,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.ТекущийРукоВодитель.Наименование,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер.Наименование,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаказКлиента.Организация.Префикс,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаказКлиента.БанковскийСчет,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗаказКлиента.АдресДоставки,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Ссылка В (&МассивДокументовВВалютеРегл)
	|			ТОГДА &ВалютаРегламентированногоУчета
	|		ИНАЧЕ ЗаказКлиента.Валюта
	|	КОНЕЦ,
	|	ЗаказКлиента.ЦенаВключаетНДС,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|

	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ТАБЛИЧНЫМ ЧАСТЯМ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка                                                     КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура                                               КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                            КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура." + КолонкаКодов + "                          КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                             КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Код                                       КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения                                           КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление                         КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент              КАК КоличествоВОдномМесте,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное                          КАК Характеристика,
	|	ВложенныйЗапрос.СтавкаНДС                                                  КАК СтавкаНДС,
	|	ВЫБОР КОГДА ТаблицаКорректировок.Сумма ЕСТЬ NULL ТОГДА
	|		ВложенныйЗапрос.Цена
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировок.Сумма / ВложенныйЗапрос.Количество
	|			КАК ЧИСЛО(15,2))
	|	КОНЕЦ 																	   КАК Цена,
	|	ВложенныйЗапрос.ЦенаБезСкидки                                              КАК ЦенаБезСкидки,
	|	ВложенныйЗапрос.Количество                                                 КАК Количество,
	|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоМест, 0)                                КАК КоличествоМест,
	|	ЕСТЬNULL(ТаблицаКорректировок.Сумма, ВложенныйЗапрос.Сумма)                КАК Сумма,
	|	ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, ВложенныйЗапрос.СуммаНДС)          КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки                                                КАК НомерСтроки,
	|	ВложенныйЗапрос.МассаБрутто                                                КАК МассаБрутто,
	|	Ложь                                                                       КАК ЭтоВозвратнаяТара,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, 0) КАК ПризнакВетКонтроля,                            //++Банников Е.А. 07.05.2020
	|	ЕСТЬNULL(ВложенныйЗапросДатаВыпуска.ДатаВыпуска, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПроизводства                    //--Банников Е.А. 07.05.2020
	|ИЗ (
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслуг.Номенклатура КАК Номенклатура,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			1
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.Коэффициент
	|		КОНЕЦ КАК Коэффициент,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			1
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.Коэффициент
	|		КОНЕЦ КАК КоэффициентМест,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмеренияМест,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка.Вес ЕСТЬ NULL ТОГДА
	|			РеализацияТоваровУслуг.Количество * РеализацияТоваровУслуг.Номенклатура.Вес
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.КоличествоУпаковок * РеализацияТоваровУслуг.Упаковка.Вес
	|		КОНЕЦ КАК МассаБрутто,
	|
	|		РеализацияТоваровУслуг.Характеристика     КАК Характеристика,
	|		РеализацияТоваровУслуг.СтавкаНДС          КАК СтавкаНДС,
	|		ВЫБОР
	|			КОГДА
	|				РеализацияТоваровУслуг.СуммаРучнойСкидки + РеализацияТоваровУслуг.СуммаАвтоматическойСкидки = 0
	|				ИЛИ РеализацияТоваровУслуг.КоличествоУпаковок = 0
	|			ТОГДА
	|				РеализацияТоваровУслуг.Цена
	|			ИНАЧЕ
	|				РеализацияТоваровУслуг.Сумма / РеализацияТоваровУслуг.КоличествоУпаковок
	|		КОНЕЦ КАК Цена,
	|		РеализацияТоваровУслуг.Цена 			  КАК ЦенаБезСкидки,
	|		РеализацияТоваровУслуг.КоличествоУпаковок КАК Количество,
	|		РеализацияТоваровУслуг.КоличествоУпаковок КАК КоличествоМест,
	|		РеализацияТоваровУслуг.Сумма			  КАК Сумма,
	|		РеализацияТоваровУслуг.СуммаНДС           КАК СуммаНДС,
	|		РеализацияТоваровУслуг.НомерСтроки        КАК НомерСтроки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|		" + ?(Не ПараметрыПечати.ВыводитьУслуги, " И РеализацияТоваровУслуг.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ", "") + "
	|	
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказКлиентаТовары.Ссылка,
	|		ЗаказКлиентаТовары.Номенклатура,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Коэффициент
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ ЗаказКлиентаТовары.Упаковка.Коэффициент
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ЗаказКлиентаТовары.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Упаковка.Вес ЕСТЬ NULL 
	|				ТОГДА ЗаказКлиентаТовары.Количество * ЗаказКлиентаТовары.Номенклатура.Вес
	|			ИНАЧЕ ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Упаковка.Вес
	|		КОНЕЦ,
	|		ЗаказКлиентаТовары.Характеристика,
	|		ЗаказКлиентаТовары.СтавкаНДС,
	|		ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.СуммаРучнойСкидки + ЗаказКлиентаТовары.СуммаАвтоматическойСкидки = 0
	|					ИЛИ ЗаказКлиентаТовары.КоличествоУпаковок = 0
	|				ТОГДА ЗаказКлиентаТовары.Цена
	|			ИНАЧЕ ЗаказКлиентаТовары.Сумма / ЗаказКлиентаТовары.КоличествоУпаковок
	|		КОНЕЦ,
	|		ЗаказКлиентаТовары.Цена,
	|		ЗаказКлиентаТовары.КоличествоУпаковок,
	|		ЗаказКлиентаТовары.КоличествоУпаковок,
	|		ЗаказКлиентаТовары.Сумма,
	|		ЗаказКлиентаТовары.СуммаНДС,
	|		ЗаказКлиентаТовары.НомерСтроки
	|	ИЗ
	|		Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|	ГДЕ
	|		ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|		" + ?(Не ПараметрыПечати.ВыводитьУслуги, " И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ", "") + "
	|	) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаКорректировок КАК ТаблицаКорректировок
	|			ПО ВложенныйЗапрос.Ссылка = ТаблицаКорректировок.ДокументСсылка
	|				И ВложенныйЗапрос.НомерСтроки = ТаблицаКорректировок.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты       //++Банников Е.А. 07.05.2020
	|			ПО ВложенныйЗапрос.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|				И (НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоВетКонтроль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка КАК Ссылка,
	|				РеализацияТоваровУслугДатыВыпуска.Номенклатура КАК Номенклатура,
	|				МИНИМУМ(РеализацияТоваровУслугДатыВыпуска.ДатаВыпуска) КАК ДатаВыпуска
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.ДатыВыпуска КАК РеализацияТоваровУслугДатыВыпуска
	|			ГДЕ
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка В(&МассивДокументов)
	|	
	|			СГРУППИРОВАТЬ ПО
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка,
	|				РеализацияТоваровУслугДатыВыпуска.Номенклатура) КАК ВложенныйЗапросДатаВыпуска
	|		ПО ВложенныйЗапрос.Ссылка = ВложенныйЗапросДатаВыпуска.Ссылка                                                    
	|			И ВложенныйЗапрос.Номенклатура = ВложенныйЗапросДатаВыпуска.Номенклатура                                     //--Банников Е.А. 07.05.2020
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.Номенклатура.Категория.Наименование,                                                //++Банников Е.А. 07.05.2020
	|	ВложенныйЗапрос.Номенклатура.Наименование
	|
	|ИТОГИ ПО
	|	Ссылка
	|");                                 
		
	ТаблицаВВалютеРегл = ПолучитьТабличнуюЧастьВВалютеРеглУчета(МассивОбъектов);
	МассивДокументовВВалютеРегл = ТаблицаВВалютеРегл.ВыгрузитьКолонку("ДокументСсылка");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос.УстановитьПараметр("МассивДокументов", 				МассивОбъектов);
	Запрос.УстановитьПараметр("ТаблицаВВалютеРегл",				ТаблицаВВалютеРегл);
	Запрос.УстановитьПараметр("МассивДокументовВВалютеРегл", 	МассивДокументовВВалютеРегл);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	//++Банников Е.А. 07.05.2020
	Запрос.УстановитьПараметр("СвойствоВетКонтроль", 			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ВетКонтроль"));
	//--Банников Е.А. 07.05.2020
	
	ТаблицаКурсовВалют = ПолучитьТаблицуКурсовВалют(МассивОбъектов);
	
	МассивРезультатов 			= Запрос.ВыполнитьПакет();
	// МассивРезультатов[0] - временная таблица "Таблица корректировок"
	РезультатПоШапке			= МассивРезультатов[1];
	РезультатПоТабличнойЧасти 	= МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют",
												   РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют);
												   
	Если ПривилегированныйРежим() Тогда
	    УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
	
	Возврат СтруктураДанныхДляПечати;

КонецФункции // СформироватьПечатнуюФормуТОРГ12()

// ЛВО + 31.07.2019
 Функция ПолучитьРеализацииПоЗаказамКлиента(МассивОбъектов) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТовары.Распоряжение КАК Реализация
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары КАК РасходныйОрдерНаТовары
		|ГДЕ
		|	РасходныйОрдерНаТовары.ЗаказКлиента В(&ЗаказыКлиента)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерНаТовары.Распоряжение";

	Запрос.УстановитьПараметр("ЗаказыКлиента", МассивОбъектов);

	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Реализация");
	
	 Возврат Результат;
КонецФункции	 
// -

// Процедура заполнения реквизитов шапки ТОРГ-12.
//
// Параметры:
//	ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
//	Макет - Макет ТОРГ-12
//	ТабличныйДокумент - Табличный документ
//
&НаСервере 
Процедура ЗаполнитьРеквизитыШапкиТОРГ12(ДанныеПечати, Макет, ТабличныйДокумент)
	
	// Выводим общие реквизиты шапки
	СведенияОПоставщике       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация,      ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетОрганизации);
	СведенияОПокупателе       = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент,       ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетКонтрагента);
	СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетГрузополучателя);
	СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата,, ДанныеПечати.БанковскийСчетГрузоотправителя);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	// ЛВО + 01.08.2019
		//ОбластьМакета.Параметры.НомерДокумента = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Истина);
		ОбластьМакета.Параметры.НомерДокумента =ДанныеПечати.Номер;
	//-
	
	ОбластьМакета.Параметры.ДатаДокумента  = ДанныеПечати.Дата;
	
	Если ДанныеПечати.Организация = ДанныеПечати.Грузоотправитель Тогда
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Иначе
		ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПодразделения = ДанныеПечати.Подразделение;
	
	Если ДанныеПечати.Контрагент = ДанныеПечати.Грузополучатель Тогда
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе,
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;
	//ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
	//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	
	// ЛВО 01.08.2019 +
		//ОбластьМакета.Параметры.АдресДоставки			 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,
		//"ФактическийАдрес");
	//-
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика  = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,
	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	
	ОбластьМакета.Параметры.ПредставлениеПлательщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе);
	
	// Выводим всевозможные коды
	ОбластьМакета.Параметры.ОрганизацияПоОКПО          = СведенияОГрузоотправитель.КодПоОКПО;
	ОбластьМакета.Параметры.ВидДеятельностиПоОКДП      = "";
	ОбластьМакета.Параметры.ГрузополучательПоОКПО      = СведенияОГрузополучателе.КодПоОКПО;
	ОбластьМакета.Параметры.ПоставщикПоОКПО            = СведенияОПоставщике.КодПоОКПО;
	ОбластьМакета.Параметры.ПлательщикПоОКПО           = СведенияОПокупателе.КодПоОКПО;
	ОбластьМакета.Параметры.ОснованиеНомер             = "";
	ОбластьМакета.Параметры.ОснованиеДата              = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяНомер = "";
	ОбластьМакета.Параметры.ТранспортнаяНакладнаяДата  = "";
	
	//ОбластьМакета.Параметры.Основание = "Договор № " + ДанныеПечати.Ссылка.Соглашение.Номер + " от " + Формат(ДанныеПечати.Ссылка.Соглашение.Дата, "ДФ=dd.MM.yyyy");
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры // ЗаполнитьРеквизитыШапкиТОРГ12()

// Процедура заполнения реквизитов подвала ТОРГ-12.
//
// Параметры:
//	ДанныеПечати - ВыборкаИзРезультатаЗапроса - Данные шапки документа
//	ИтоговыеСуммы - Структура - Структура итоговых сумм документа
//	Макет - Макет ТОРГ-12
//	ТабличныйДокумент - Табличный документ
//
&НаСервере 
Процедура ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЕдиницаИзмеренияВеса = Неопределено)
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ПолнаяДатаДокумента = Формат(ДанныеПечати.Дата, "ДФ=""дд ММММ гггг """"года""""""");
	ДлинаСтроки = СтрДлина(ПолнаяДатаДокумента);
	ПервыйРазделитель = Найти(ПолнаяДатаДокумента, " ");
	ВторойРазделитель = Найти(Прав(ПолнаяДатаДокумента, ДлинаСтроки - ПервыйРазделитель), " ") + ПервыйРазделитель;
	ОбластьМакета.Параметры.ДатаДокументаДень = """" + Лев(ПолнаяДатаДокумента, ПервыйРазделитель -1 ) + """";
	ОбластьМакета.Параметры.ДатаДокументаМесяц = Сред(ПолнаяДатаДокумента, ПервыйРазделитель + 1, ВторойРазделитель - ПервыйРазделитель - 1);
	ОбластьМакета.Параметры.ДатаДокументаГод = Прав(ПолнаяДатаДокумента, ДлинаСтроки - ВторойРазделитель);
	//ЛВО +
	Доверенность = "";
			ЗапросПол = Новый Запрос;
			ЗапросПол.Текст = "ВЫБРАТЬ
			               |	ПользователиДополнительныеРеквизиты.Значение
			               |ИЗ
			               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
			               |ГДЕ
			               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
			               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
			ЗапросПол.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
			ЗапросПол.УстановитьПараметр("Свойство", "Информация о доверенности");
			РезультатДов = ЗапросПол.Выполнить();
			Если не РезультатДов.Пустой() тогда
				ВыборкаДоверенность = РезультатДов.Выбрать();
				Пока ВыборкаДоверенность.Следующий() цикл
					 Доверенность = ВыборкаДоверенность.Значение;
				 КонецЦикла;
			
			 КонецЕсли;
      //-
	
	
	// Главный бухгалтер
	ОбластьМакета.Параметры.ФИОГлавБухгалтера =ПараметрыСеанса.ТекущийПользователь.Наименование +Символы.ПС+" по доверенности " + Доверенность; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
	
	// Отпуск товара разрешил
	ОбластьМакета.Параметры.ФИОРуководителя =ПараметрыСеанса.ТекущийПользователь.Наименование+Символы.ПС+" по доверенности " + Доверенность; //ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель);
	ОбластьМакета.Параметры.ДолжностьРуководителя ="бухгалтер-оператор";// ДанныеПечати.ДолжностьРуководителя;
	
	ОбластьМакета.Параметры.ФИОКладовщика = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.Кладовщик);
	ОбластьМакета.Параметры.ДолжностьКладовщика = ДанныеПечати.ДолжностьКладовщика;
	
	// Доверенность
	// ЛВО 29.05.2020 +
	//ОбластьМакета.Параметры.ДоверенностьНомер     = ДанныеПечати.ДоверенностьНомер;
	//ОбластьМакета.Параметры.ДоверенностьДата      = Формат(ДанныеПечати.ДоверенностьДата, "ДФ='дд ММММ гггг'");
	//ОбластьМакета.Параметры.ДоверенностьВыдана    = ДанныеПечати.ДоверенностьВыдана;
	//ОбластьМакета.Параметры.ДоверенностьЧерезКого = ДанныеПечати.ДоверенностьЛицо;
	// -
	Если ИтоговыеСуммы.ИтогоМест > 0 Тогда
		ОбластьМакета.Параметры.ВсегоМестПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоМест, ,",,,,,,,,0");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) И ИтоговыеСуммы.ИтогоМассаБрутто > 0 Тогда
		ОбластьМакета.Параметры.МассаГрузаПрописью = ЧислоПрописью(ИтоговыеСуммы.ИтогоМассаБрутто, ,",,,,,,,,0")+ " " + СокрЛП(ЕдиницаИзмеренияВеса) + ".";
	КонецЕсли;
	
	ОбластьМакета.Параметры.КоличествоПорядковыхНомеровЗаписейПрописью = ИтоговыеСуммы.КоличествоПорядковыхНомеровЗаписейПрописью;
	ОбластьМакета.Параметры.СуммаПрописью = ИтоговыеСуммы.СуммаПрописью;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры // ЗаполнитьРеквизитыПодвалаТОРГ12()

// Процедура заполняет табличный документ ТОРГ-12.
//
&НаСервере 
Процедура ЗаполнитьТабличныйДокументТОРГ12(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати) 
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ЕдиницаИзмеренияВеса           = Константы.ЕдиницаИзмеренияВеса.Получить();
	
	ТабличныйДокумент.ПолеСлева = 5;
	ТабличныйДокумент.ПолеСправа = 5;
	ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.КоличествоЭкземпляров = 2;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ДанныеПечати      	= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКурсовВалют  = ДанныеДляПечати.ТаблицаКурсовВалют;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПФ_MXL_ТОРГ12");
	//Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьОбщихФорм.ПФ_MXL_ТОРГ12");
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		ВыборкаПоДокументам.Сбросить();
		Если НЕ ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска) Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В документе %1 отсутствуют товары. Печать товарной накладной без услуг не требуется'"),
			ДанныеПечати.Ссылка
			);
			
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			//	Текст,
			//	ДанныеПечати.Ссылка
			//);
			Продолжить;
		КонецЕсли;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ЗаполнитьРеквизитыШапкиТОРГ12(ДанныеПечати, Макет, ТабличныйДокумент);
		
		НомерСтраницы = 1;
		ИтоговыеСуммы = СтруктураИтоговыеСуммы();
		
		КоэффициентПересчета = КоэффициентПересчетаВалюты(ДанныеПечати, ТаблицаКурсовВалют, ВалютаРегламентированногоУчета);
		ДанныеСтроки = СтруктураДанныеСтроки(КоэффициентПересчета);
		
		// Создаем массив Для проверки вывода
		МассивВыводимыхОбластей = Новый Массив;
		
		// Выводим многострочную часть докмента
		ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаб");
		ОбластьМакета           = Макет.ПолучитьОбласть("Строка");
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьВсего            = Макет.ПолучитьОбласть("Всего");
		ОбластьПодвала          = Макет.ПолучитьОбласть("Подвал");
		
		
		КоличествоСтрок = ВыборкаПоДокументам.Количество();
		
		СтрокаТовары = ВыборкаПоДокументам.Выбрать();
		Пока СтрокаТовары.Следующий() Цикл
			
			ДанныеСтроки.Номер = ДанныеСтроки.Номер + 1;
			
			ЗаполнитьРеквизитыСтрокиТовара(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета, ЕдиницаИзмеренияВеса);
			
			Если ДанныеСтроки.Номер = 1 Тогда // первая строка
				
				ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы; 
				ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
				
			Иначе
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакета);
				МассивВыводимыхОбластей.Добавить(ОбластьИтоговПоСтранице);
				
				Если ДанныеСтроки.Номер = КоличествоСтрок Тогда
					
					МассивВыводимыхОбластей.Добавить(ОбластьВсего);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
					
				КонецЕсли;
				
				Если ДанныеСтроки.Номер <> 1 И Не ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					
					ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
					ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
					
					// Очистим итоги по странице.
					ОбнулитьИтогиПоСтранице(ИтоговыеСуммы);
					
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ОбластьЗаголовокТаблицы.Параметры.НомерСтраницы = "Страница " + НомерСтраницы;
					ТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			РассчитатьИтоговыеСуммы(ИтоговыеСуммы, ДанныеСтроки);
			
		КонецЦикла;
		
		// Выводим итоги по последней странице
		ОбластьИтоговПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьИтоговПоСтранице.Параметры.Заполнить(ИтоговыеСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьИтоговПоСтранице);
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Всего");
		ОбластьМакета.Параметры.Заполнить(ИтоговыеСуммы);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подвал документа
		ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ДанныеСтроки.Номер, ВалютаРегламентированногоУчета);
		ЗаполнитьРеквизитыПодвалаТОРГ12(ДанныеПечати, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЕдиницаИзмеренияВеса);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТабличныйДокументТОРГ12()

&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиТовара(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета, ЕдиницаИзмеренияВеса = Неопределено)
	
	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
	ОбластьМакета.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
	СтрокаТовары.ТоварНаименование,
	СтрокаТовары.Характеристика
	)
	+ ?(СтрокаТовары.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
	
	ДанныеСтроки.Мест = СтрокаТовары.КоличествоМест;
	ДанныеСтроки.Количество  = СтрокаТовары.Количество;
	
	Если ЕдиницаИзмеренияВеса <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
			ДанныеСтроки.МассаБрутто = 0;
		Иначе
			ДанныеСтроки.МассаБрутто = СтрокаТовары.МассаБрутто;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеСтроки.СуммаСНДС   = Окр((СтрокаТовары.Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СтрокаТовары.СуммаНДС)) * ДанныеСтроки.КоэффициентПересчета, 2);
	ДанныеСтроки.СуммаНДС    = Окр(СтрокаТовары.СуммаНДС * ДанныеСтроки.КоэффициентПересчета, 2);
	ДанныеСтроки.СуммаБезНДС = ДанныеСтроки.СуммаСНДС - ДанныеСтроки.СуммаНДС;
	
	Если ДанныеПечати.ЦенаВключаетНДС Тогда
		ДанныеСтроки.Цена = ?(ДанныеСтроки.Количество = 0, 0, ДанныеСтроки.СуммаБезНДС / ДанныеСтроки.Количество);
	Иначе
		ДанныеСтроки.Цена = СтрокаТовары.Цена * ДанныеСтроки.КоэффициентПересчета;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
	
	//Заполним цену без скидки
	Попытка
		ОбластьМакета.Параметры.ЦенаБезСкидки = СтрокаТовары.ЦенаБезСкидки;
	Исключение
	КонецПопытки;
	
КонецПроцедуры // ЗаполнитьРеквизитыСтрокиТовара()


&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиТовараСФ(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета, ЕдиницаИзмеренияВеса = Неопределено, ЭтоСчетФактураНаАванс = Ложь, ЭтоСчетФактура = Ложь)
	
	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
	ОбластьМакета.Параметры.ТоварНаименование = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
	СтрокаТовары.ТоварНаименование,
	СтрокаТовары.Характеристика
	//, //ninch 24.01.2012
	//СтрокаТовары.Упаковка //ninch 24.01.2012
	) + ?(СтрокаТовары.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
	
	Если ЭтоСчетФактураНаАванс Тогда
		ОбластьМакета.Параметры.Акциз = "";
	ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) И ЭтоСчетФактура Тогда
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТовары.ЕдиницаИзмерения, "Код");
		ОбластьМакета.Параметры.Акциз = "без акциза"; //ninch 24.01.2012
		//ОбластьМакета.Параметры.Акциз = "--"; //ninch 24.01.2012
	ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) И Не ЭтоСчетФактура Тогда
		ОбластьМакета.Параметры.БазоваяЕдиницаКодПоОКЕИ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТовары.ЕдиницаИзмерения, "Код"); 
	Иначе
		
		Если ЭтоСчетФактура Тогда
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "";
			ОбластьМакета.Параметры.Акциз = "без акциза"; //ninch 24.01.2012
			//ОбластьМакета.Параметры.Акциз = "--"; //ninch 24.01.2012
		Иначе
			ОбластьМакета.Параметры.БазоваяЕдиницаКодПоОКЕИ = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТовары.СтранаПроисхождения) Тогда
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = ОбщегоНазначения.ПолучитьЗначениеРеквизита(СтрокаТовары.СтранаПроисхождения, "Код");
	Иначе
		ОбластьМакета.Параметры.СтранаПроисхожденияКод = "";
	КонецЕсли;
	
	ДанныеСтроки.Мест = СтрокаТовары.КоличествоМест;
	ДанныеСтроки.Количество  = СтрокаТовары.Количество;
	
	ЭтоСтранаСНГ = ПроверитьСтрануПроисхождения(СтрокаТовары.Номенклатура);
	Если ЭтоСтранаСНГ Тогда
		ОбластьМакета.Параметры.КоличествоПрослеживаемое = 0;
	Иначе
		ДанныеСтроки.КоличествоПрослеживаемое = СтрокаТовары.Количество;
	КонецЕсли;
	
	Если ЕдиницаИзмеренияВеса <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияВеса) Тогда
			ДанныеСтроки.МассаБрутто = 0;
		Иначе
			ДанныеСтроки.МассаБрутто = СтрокаТовары.МассаБрутто;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеСтроки.СуммаСНДС   = Окр((СтрокаТовары.Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СтрокаТовары.СуммаНДС)) * ДанныеСтроки.КоэффициентПересчета, 2);
	ДанныеСтроки.СуммаНДС    = Окр(СтрокаТовары.СуммаНДС * ДанныеСтроки.КоэффициентПересчета, 2);
	ДанныеСтроки.СуммаБезНДС = ДанныеСтроки.СуммаСНДС - ДанныеСтроки.СуммаНДС;
	
	Если ДанныеПечати.ЦенаВключаетНДС Тогда
		ДанныеСтроки.Цена = ?(ДанныеСтроки.Количество = 0, 0, ДанныеСтроки.СуммаБезНДС / ДанныеСтроки.Количество);
	Иначе
		ДанныеСтроки.Цена = СтрокаТовары.Цена * ДанныеСтроки.КоэффициентПересчета;
	КонецЕсли;
	
	ОбластьМакета.Параметры.Заполнить(ДанныеСтроки);
	
	Если СтрокаТовары.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ОбластьМакета.Параметры.СтавкаНДС = НСтр("ru='без НДС'"); 
		ОбластьМакета.Параметры.СуммаНДС  = НСтр("ru='без НДС'"); 
	КонецЕсли; 
	
	//d.valuysky@kdvm.ru начало вставки 23.12.2013 14:22:59 
	//смотрим на название элемента справочника, а не на содежание.
	Если Найти(СтрокаТовары.ТоварНаименование,"Маркетинговые услуги")>0 Тогда
		ОбластьМакета.Параметры.ЕдиницаИзмеренияКод    = "--";
		ОбластьМакета.Параметры.ЕдиницаИзмерения    = "--";
		ОбластьМакета.Параметры.Количество    = "--";
		ОбластьМакета.Параметры.Цена    = "--";
		ОбластьМакета.Параметры.ТоварНаименование = СокрЛП(ОбластьМакета.Параметры.ТоварНаименование)+"("+СокрЛП(ДанныеПечати.Ссылка.Комментарий)+")";
	КонецЕсли;
	//d.valuysky@kdvm.ru конец вставки 23.12.2013 14:23:03 
	
КонецПроцедуры // ЗаполнитьРеквизитыСтрокиТовара()


Функция ПроверитьСтрануПроисхождения(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ДополнительныеСведения.Значение В (&МассивСтранСНГ)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоСтранаСНГ
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство = &Свойство";
		
	МассивСтранСНГ = Новый Массив;
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("РОССИЯ"));
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("УЗБЕКИСТАН"));
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("КАЗАХСТАН"));
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("КИРГИЗИЯ"));
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("АРМЕНИЯ"));
	МассивСтранСНГ.Добавить(Справочники.СтраныМира.НайтиПоНаименованию("БЕЛАРУСЬ"));


	Запрос.УстановитьПараметр("МассивСтранСНГ", МассивСтранСНГ);
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СтранаПроисхождения"));

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЭтоСтранаСНГ;
	Иначе
		Возврат Истина;
	КонецЕсли;;	

КонецФункции 


&НаСервере
Процедура ОбнулитьИтогиПоСтранице(ИтоговыеСуммы)
	
	ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице = 0;
	ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице  = 0;
	ИтоговыеСуммы.ИтогоМестНаСтранице        = 0;
	ИтоговыеСуммы.ИтогоКоличествоНаСтранице  = 0;
	ИтоговыеСуммы.ИтогоСуммаНаСтранице       = 0;
	ИтоговыеСуммы.ИтогоНДСНаСтранице         = 0;
	ИтоговыеСуммы.ИтогоСуммаСНДСНаСтранице   = 0;
	
КонецПроцедуры // ОбнулитьИтогиПоСтранице()

&НаСервере
Функция КоэффициентПересчетаВалюты(ДанныеПечати, ТаблицаКурсовВалют, ВалютаРегламентированногоУчета)
	
	КоэффициентПересчета = 1;
	Если ДанныеПечати.Валюта <> ВалютаРегламентированногоУчета Тогда
		
		СтруктураПоиска = Новый Структура("Валюта, Дата", ДанныеПечати.Валюта, НачалоДня(ДанныеПечати.Дата));
		Массив = ТаблицаКурсовВалют.НайтиСтроки(СтруктураПоиска);
		Если Массив.Количество() > 0 Тогда
			КоэффициентПересчета = ?(Массив[0].Кратность <> 0, Массив[0].Курс / Массив[0].Кратность, 1);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КоэффициентПересчета;
	
КонецФункции // КоэффициентПересчетаВалюты()
//конец печать торг12

//печать СФ
&НаСервере 
Функция СформироватьПечатнуюФормуСчетФактура(МассивДокументов, СтруктураПараметров)
	
	ОбъектыПечати = Новый СписокЗначений;
	Для Каждого ТекСтр Из МассивДокументов Цикл
		ОбъектыПечати.Добавить(ТекСтр);
	КонецЦикла; 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактура";
	
	// Зададим параметры Макета
	ТабличныйДокумент.ПолеСверху = 10;
	ТабличныйДокумент.ПолеСлева  = 10;
	ТабличныйДокумент.ПолеСнизу  = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КоличествоЭкземпляров = 2;
	
	ПараметрыПечати = Новый Структура("ВыводитьУслуги, ПечатьВВалюте", Ложь, Ложь);
	// ЛВО + 31.07.2019	
	//ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивДокументов);//Документы.РеализацияТоваровУслуг.ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивДокументов);
	Если СтруктураПараметров.ПечатьПоРеализации тогда
		ДокументыРеализации = ПолучитьРеализацииПоЗаказамКлиента(МассивДокументов);
		Если ДокументыРеализации.Количество() = 0 тогда
			ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивДокументов);
		Иначе
			ДанныеДляПечати = Документы.РеализацияТоваровУслуг.ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, ДокументыРеализации);
		КонецЕсли;
	Иначе
		ДанныеДляПечати = ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивДокументов);//Документы.РеализацияТоваровУслуг.ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивДокументов);
	КонецЕсли;
	//-
	ЗаполнитьТабличныйДокументСчетФактура(ТабличныйДокумент, ДанныеДляПечати,ОбъектыПечати);

	КоличествоЭкземпляров = 0;
	Если ТабличныйДокумент.КоличествоЭкземпляров = 0 Тогда
		СтрПФ = НастройкаПечати.НайтиСтроки(Новый Структура("ДокументПечати", "Счет-фактура"));
		Если СтрПФ.Количество() > 0 Тогда
			КоличествоЭкземпляров = СтрПФ[0].Количество;
		Иначе
			КоличествоЭкземпляров = Неопределено;
		КонецЕсли;
		ТабличныйДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	Иначе
		КоличествоЭкземпляров = ТабличныйДокумент.КоличествоЭкземпляров;
	КонецЕсли;
	
	СохранитьДанныеОПечати(МассивДокументов, "Счет-фактура", СтруктураПараметров.ЗНО, КоличествоЭкземпляров);
	
	ДанныеДляПечати = Неопределено;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФормуСчетФактура()

// Функция формирует печатную форму Счета-фактуры.
//
Функция ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, МассивОбъектов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|////////////////////////////////////////////////////////////////////////////
	|// ВРЕМЕННАЯ ТАБЛИЦА НоменклатураДокументов
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	МАКСИМУМ(
	|		ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	|			Истина
	|		ИНАЧЕ
	|			Ложь
	|		КОНЕЦ
	|	) КАК ЕстьУслуги,
	|	МАКСИМУМ(
	|		ВЫБОР КОГДА ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ТОГДА
	|			Истина
	|		ИНАЧЕ
	|			Ложь
	|		КОНЕЦ
	|	)КАК ЕстьТовары
	|
	|ПОМЕСТИТЬ НоменклатураДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка В (&МассивДокументов)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ),
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////
	|// ВРЕМЕННАЯ ТАБЛИЦА ВТ_ТаблицаКорректировок
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТ_ТаблицаКорректировок
	|ИЗ 
	|	&ТаблицаВВалютеРегл КАК ТаблицаВВалютеРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ШАПКЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка                                                КАК Ссылка,
	|	ЕСТЬNULL(СчетФактура.Номер, Неопределено)                                    КАК Номер,
	|	ЕСТЬNULL(СчетФактура.Дата, Неопределено)                                     КАК Дата,
	|	ЕСТЬNULL(СчетФактура.СтрокаПлатежноРасчетныеДокументы, """")                 КАК СтрокаПоДокументу,
	|	РеализацияТоваровУслуг.Партнер                                               КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент                                            КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация                                           КАК Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс                                   КАК Префикс,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель.Наименование          КАК РукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя              КАК ДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер.Наименование      КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Склад.ТекущийОтветственный.Наименование               КАК Кладовщик,
	|	РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного                  КАК ДолжностьКладовщика,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Контрагент
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Организация
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|
	|	РеализацияТоваровУслуг.АдресДоставки КАК АдресДоставки,
	|
	|	// При взаиморасчетах в иностранной валюте в обработку передаем суммы в валюте регл. учета.
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Ссылка В (&МассивДокументовВВалютеРегл) ТОГДА
	|		&ВалютаРегламентированногоУчета
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Валюта
	|	КОНЕЦ КАК Валюта,
	|
	|	Истина КАК ЦенаВключаетНДС,
	|
	|	ВЫБОР КОГДА НоменклатураДокументов.ЕстьУслуги
	|		И Не НоменклатураДокументов.ЕстьТовары
	|	ТОГДА
	|		Истина
	|	ИНАЧЕ
	|		Ложь
	|	КОНЕЦ КАК ТолькоУслуги,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		Истина
	|	ИНАЧЕ
	|		Ложь
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НоменклатураДокументов КАК НоменклатураДокументов
	|	ПО
	|		РеализацияТоваровУслуг.Ссылка = НоменклатураДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Документ.СчетФактураВыданный КАК СчетФактура
	|	ПО
	|		РеализацияТоваровУслуг.Ссылка = СчетФактура.ДокументОснование
	|		И РеализацияТоваровУслуг.Организация = СчетФактура.Организация
	|		И Не СчетФактура.ПометкаУдаления
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	"""",
	|	ЗаказКлиента.Партнер,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	ЗаказКлиента.Организация.ТекущийРукоВодитель.Наименование,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер.Наименование,
	|	ЗаказКлиента.Склад.ТекущийОтветственный.Наименование,
	|	ЗаказКлиента.Склад.ТекущаяДолжностьОтветственного,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.АдресДоставки,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.Ссылка В (&МассивДокументовВВалютеРегл)
	|			ТОГДА &ВалютаРегламентированногоУчета
	|		ИНАЧЕ ЗаказКлиента.Валюта
	|	КОНЕЦ,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА НоменклатураДокументов.ЕстьУслуги
	|				И НЕ НоменклатураДокументов.ЕстьТовары
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДокументов КАК НоменклатураДокументов
	|		ПО ЗаказКлиента.Ссылка = НоменклатураДокументов.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ТАБЛИЧНЫМ ЧАСТЯМ
	|
	|ВЫБРАТЬ
	|	ТаблицаВидыЗапасов.Ссылка КАК Ссылка,
	|	ТаблицаВидыЗапасов.Номенклатура КАК Номенклатура,
	|	ТаблицаВидыЗапасов.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаВидыЗапасов.Номенклатура.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	ТаблицаВидыЗапасов.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаВидыЗапасов.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ТаблицаВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТаблицаВидыЗапасов.НомерГТД.СтранаПроисхождения КАК СтранаПроисхождения,
	|	0 КАК Цена,
	|	0 КАК КоличествоМест,
	|	СУММА(ТаблицаВидыЗапасов.Количество) КАК Количество,
	|
	|	СУММА(
	|		ВЫБОР КОГДА ТаблицаКорректировок.Сумма ЕСТЬ NULL ТОГДА
	|			ТаблицаВидыЗапасов.СуммаСНДС
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ТаблицаВидыЗапасов.Ссылка.ЦенаВключаетНДС ТОГДА
	|				ТаблицаКорректировок.Сумма
	|			ИНАЧЕ
	|				ТаблицаКорректировок.Сумма + ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, 0)
	|			КОНЕЦ
	|		КОНЕЦ
	|	) КАК Сумма,
	|
	|	СУММА(ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, ТаблицаВидыЗапасов.СуммаНДС)) КАК СуммаНДС,
	|	МАКСИМУМ(ТаблицаВидыЗапасов.НомерСтроки) КАК НомерСтроки,
	|	Ложь КАК ЭтоВозвратнаяТара
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТаблицаВидыЗапасов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТ_ТаблицаКорректировок КАК ТаблицаКорректировок
	|	ПО
	|		ТаблицаВидыЗапасов.Ссылка = ТаблицаКорректировок.ДокументСсылка
	|		И ТаблицаВидыЗапасов.НомерСтроки = ТаблицаКорректировок.НомерСтроки
	|		И ТаблицаКорректировок.ВидыЗапасов
	|ГДЕ
	|	ТаблицаВидыЗапасов.Ссылка В (&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВидыЗапасов.Ссылка,
	|	ТаблицаВидыЗапасов.Номенклатура,
	|	ТаблицаВидыЗапасов.Характеристика,
	|	ТаблицаВидыЗапасов.СтавкаНДС,
	|	ТаблицаВидыЗапасов.НомерГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	ТаблицаТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаТовары.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК НомерГТД,
	|	"""" КАК СтранаПроисхождения,
	|	0 КАК Цена,
	|	0 КАК КоличествоМест,
	|	СУММА(ТаблицаТовары.Количество) КАК Количество,
	|
	|	СУММА(
	|		ВЫБОР КОГДА ТаблицаКорректировок.Сумма ЕСТЬ NULL ТОГДА
	|			ВЫБОР КОГДА ТаблицаТовары.Ссылка.ЦенаВключаетНДС ТОГДА
	|				ТаблицаТовары.Сумма
	|			ИНАЧЕ
	|				ТаблицаТовары.Сумма + ТаблицаТовары.СуммаНДС
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ВЫБОР КОГДА ТаблицаТовары.Ссылка.ЦенаВключаетНДС ТОГДА
	|				ТаблицаКорректировок.Сумма
	|			ИНАЧЕ
	|				ТаблицаКорректировок.Сумма + ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, 0)
	|			КОНЕЦ
	|		КОНЕЦ
	|	) КАК Сумма,
	|
	|	СУММА(ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, ТаблицаТовары.СуммаНДС)) КАК СуммаНДС,
	|	МАКСИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки,
	|	Ложь КАК ЭтоВозвратнаяТара
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВТ_ТаблицаКорректировок КАК ТаблицаКорректировок
	|	ПО
	|		ТаблицаТовары.Ссылка = ТаблицаКорректировок.ДокументСсылка
	|		И ТаблицаТовары.НомерСтроки = ТаблицаКорректировок.НомерСтроки
	|		И НЕ ТаблицаКорректировок.ВидыЗапасов
	|ГДЕ
	|	ТаблицаТовары.Ссылка В (&МассивДокументов)
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.СтавкаНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
	|	ЗаказКлиентаТовары.Характеристика.НаименованиеПолное,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	"""",
	|	"""",
	|	0,
	|	0,
	|	СУММА(ЗаказКлиентаТовары.Количество),
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаКорректировок.Сумма ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаВключаетНДС
	|							ТОГДА ЗаказКлиентаТовары.Сумма
	|						ИНАЧЕ ЗаказКлиентаТовары.Сумма + ЗаказКлиентаТовары.СуммаНДС
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЗаказКлиентаТовары.Ссылка.ЦенаВключаетНДС
	|						ТОГДА ТаблицаКорректировок.Сумма
	|					ИНАЧЕ ТаблицаКорректировок.Сумма + ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, 0)
	|				КОНЕЦ
	|		КОНЕЦ),
	|	СУММА(ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, ЗаказКлиентаТовары.СуммаНДС)),
	|	МАКСИМУМ(ЗаказКлиентаТовары.НомерСтроки),
	|	0
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаКорректировок КАК ТаблицаКорректировок
	|		ПО ЗаказКлиентаТовары.Ссылка = ТаблицаКорректировок.ДокументСсылка
	|			И ЗаказКлиентаТовары.НомерСтроки = ТаблицаКорректировок.НомерСтроки
	|			И (НЕ ТаблицаКорректировок.ВидыЗапасов)
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика,
	|	ЗаказКлиентаТовары.СтавкаНДС,
	|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Представление,
	|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
	|	ЗаказКлиентаТовары.Характеристика.НаименованиеПолное
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|
	|ИТОГИ ПО
	|	Ссылка
	|");
	
	Если НЕ ПараметрыПечати.ПечатьВВалюте Тогда
		ТаблицаВВалютеРегл = ПолучитьТабличнуюЧастьВВалютеРеглУчета(МассивОбъектов, Истина);
	Иначе
		ТаблицаВВалютеРегл = ИнициализироватьТаблицуКорректировок();
	КонецЕсли;
	МассивДокументовВВалютеРегл = ТаблицаВВалютеРегл.ВыгрузитьКолонку("ДокументСсылка");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос.УстановитьПараметр("МассивДокументов", 				МассивОбъектов);
	Запрос.УстановитьПараметр("ТаблицаВВалютеРегл",				ТаблицаВВалютеРегл);
	Запрос.УстановитьПараметр("МассивДокументовВВалютеРегл", 	МассивДокументовВВалютеРегл);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	ТаблицаКурсовВалют = ПолучитьТаблицуКурсовВалют(МассивОбъектов);
	
	МассивРезультатов 			= Запрос.ВыполнитьПакет();
	// МассивРезультатов[0] - временная таблица "Номенклатура документов"
	// МассивРезультатов[1] - временная таблица "Таблица корректировок"
	РезультатПоШапке			= МассивРезультатов[2];
	РезультатПоТабличнойЧасти 	= МассивРезультатов[3];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют",
												   РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют);
												   
	Если ПривилегированныйРежим() Тогда
	    УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
												   
	Возврат СтруктураДанныхДляПечати;
	
КонецФункции // СформироватьПечатнуюФормуСчетФактура()

// Функция формирует таблицу с рассчитанными рублевыми суммами построчно, с учетом зачтенных предоплат.
//
// Параметры:
// МассивОбъектов		      - Массив		    - Список документов с типом "РеализацияТоваровУслуг"
// ТаблицаКорректировок       - ТаблицаЗначений - Таблица со следующей структурой колонок:
//													ДокументСсылка	(ДокументСсылка.РеализацияТоваровУслуг)
//													НомерСтроки		(Число(15))
//													Сумма			(Число(15,2))
//													СуммаНДС		(Число(15,2))
// НеУчитыватьВалютуДокумента - Булево		    - Признак для печатных форм, формирующихся в валюте документа
//
// Возвращаемое значение:
// ТаблицаКорректировок - ТаблицаЗначений - Таблица по табличной части "Товары" с суммами в валюте регламентированного учета
//
Функция ПолучитьТабличнуюЧастьВВалютеРеглУчета(МассивОбъектов, ПоВидамЗапасов = Ложь)
	
	ТаблицаКорректировок = ИнициализироватьТаблицуКорректировок();
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	КэшКурсовВалют = МодульВалютногоУчета.ИнициализироватьКэшКурсовВалют();
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.Регистратор В(&МассивДокументов)
	|	И РасчетыСКлиентами.Активность
	|");
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
	
	ТаблицаАналитик = Запрос.Выполнить().Выгрузить();
	МассивАналитикУчетаПоПартнерам = ТаблицаАналитик.ВыгрузитьКолонку("АналитикаУчетаПоПартнерам");
	
	ВзаиморасчетыСервер.ВыполнитьПроведениеДокументовПоРасчетамСКлиентами(МассивАналитикУчетаПоПартнерам);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДанныеДокумента.Ссылка КАК ДокументСсылка,
	               |	ДанныеДокумента.Дата КАК Дата,
	               |	ДанныеДокумента.Валюта КАК Валюта,
	               |	ДанныеДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	               |	ДанныеДокумента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	               |	ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаПриход, 0) КАК Предоплата,
	               |	ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаРеглПриход, 0) КАК ПредоплатаРегл
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоДокументам.Обороты(, , Регистратор, АналитикаУчетаПоПартнерам В (&АналитикаУчетаПоПартнерам)) КАК ТаблицаПредоплаты
	               |		ПО ДанныеДокумента.Ссылка = ТаблицаПредоплаты.Регистратор
	               |ГДЕ
	               |	ДанныеДокумента.Ссылка В(&МассивДокументов)
	               |	И ДанныеДокумента.Валюта <> &ВалютаРегламентированногоУчета
	               |	И ДанныеДокумента.ВалютаВзаиморасчетов <> &ВалютаРегламентированногоУчета
	               |	И ДанныеДокумента.ХозяйственнаяОперация <> &ПередачаНаКомиссию
	               |	И ЕСТЬNULL(ТаблицаПредоплаты.ПредоплатаРеглПриход, 0) <> 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВидыЗапасов.Ссылка КАК ДокументСсылка,
	               |	ТаблицаВидыЗапасов.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
	               |	ТаблицаВидыЗапасов.СуммаСНДС - ТаблицаВидыЗапасов.СуммаНДС КАК Сумма,
	               |	ТаблицаВидыЗапасов.СуммаНДС КАК СуммаНДС,
	               |	ИСТИНА КАК ВидыЗапасов
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТаблицаВидыЗапасов
	               |ГДЕ
	               |	ТаблицаВидыЗапасов.Ссылка В(&МассивДокументов)
	               |	И &ПоВидамЗапасов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТаблицаТовары.Ссылка,
	               |	ТаблицаТовары.НомерСтроки,
	               |	ТаблицаТовары.СтавкаНДС,
	               |	ТаблицаТовары.Сумма,
	               |	ТаблицаТовары.СуммаНДС,
	               |	ЛОЖЬ
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	               |ГДЕ
	               |	ТаблицаТовары.Ссылка В(&МассивДокументов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументСсылка
	               |ИТОГИ
	               |	СУММА(Сумма),
	               |	СУММА(СуммаНДС)
	               |ПО
	               |	ДокументСсылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПоВидамЗапасов",					ПоВидамЗапасов);
	Запрос.УстановитьПараметр("МассивДокументов",				МассивОбъектов);
	Запрос.УстановитьПараметр("ПередачаНаКомиссию",				Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);	
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",		МассивАналитикУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	
	МассивРезультатов		  = Запрос.ВыполнитьПакет();
	ДанныеДокументов		  = МассивРезультатов[0];
	РезультатПоТабличнойЧасти = МассивРезультатов[1];
	
	ДанныеДокумента = ДанныеДокументов.Выбрать();
	ВыборкаПоДокументам = РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ДанныеДокумента.Следующий() Цикл
		
		КурсВалютыДокумента		 = МодульВалютногоУчета.ПолучитьКурсВалютыИзКэша(ДанныеДокумента.Валюта, ДанныеДокумента.Дата, КэшКурсовВалют);
		КурсВалютыВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалютыИзКэша(ДанныеДокумента.ВалютаВзаиморасчетов, ДанныеДокумента.Дата, КэшКурсовВалют);
		
		ОтборПоДокументу = Новый Структура("ДокументСсылка", ДанныеДокумента.ДокументСсылка);
		Пока ВыборкаПоДокументам.НайтиСледующий(ОтборПоДокументу) Цикл
			
			СуммаДокумента = ?(ДанныеДокумента.ЦенаВключаетНДС,
				ВыборкаПоДокументам.Сумма,
				ВыборкаПоДокументам.Сумма + ВыборкаПоДокументам.СуммаНДС);
				
			СуммаВзаиморасчетов = СуммаДокумента * КурсВалютыДокумента / КурсВалютыВзаиморасчетов;
			
			Если СуммаВзаиморасчетов > ДанныеДокумента.Предоплата Тогда
				СуммаДокументаРегл = ДанныеДокумента.ПредоплатаРегл
					+ (СуммаВзаиморасчетов - ДанныеДокумента.Предоплата) * КурсВалютыВзаиморасчетов;
			Иначе
				СуммаДокументаРегл = ДанныеДокумента.ПредоплатаРегл;
			КонецЕсли;
				
			МассивСумм = Новый Массив;
			
			Выборка = ВыборкаПоДокументам.Выбрать();		
			Пока Выборка.Следующий() Цикл
				МассивСумм.Добавить(?(ВыборкаПоДокументам.ДокументСсылка.ЦенаВключаетНДС,
					Выборка.Сумма,
					Выборка.Сумма + Выборка.СуммаНДС));
			КонецЦикла;
			
			МассивНовыхСумм = ОбщегоНазначенияУТ.РаспределитьПропорционально(СуммаДокументаРегл, МассивСумм);
			
			Выборка.Сбросить();
			Индекс = 0;
			Пока Выборка.Следующий() Цикл
				
				Если НЕ МассивНовыхСумм = Неопределено Тогда
					СуммаСНДС = МассивНовыхСумм[Индекс]
				Иначе
					СуммаСНДС = ?(ВыборкаПоДокументам.ДокументСсылка.ЦенаВключаетНДС,
						Выборка.Сумма,
						Выборка.Сумма + Выборка.СуммаНДС) * КурсВалютыДокумента;
				КонецЕсли;
				
				СтрокаРезультата = ТаблицаКорректировок.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультата, Выборка);
				
				СтавкаНДСЧислом = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(Выборка.СтавкаНДС);
				СтрокаРезультата.СуммаНДС = Окр(
					СуммаСНДС / (1 + СтавкаНДСЧислом) * СтавкаНДСЧислом
					,2);
				
				СтрокаРезультата.Сумма = ?(ВыборкаПоДокументам.ДокументСсылка.ЦенаВключаетНДС,
					СуммаСНДС,
					СуммаСНДС - СтрокаРезультата.СуммаНДС);
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	Возврат ТаблицаКорректировок;
	
КонецФункции // ПолучитьТабличнуюЧастьВВалютеРеглУчета()

// Функция создает таблицу значений с необходимой структурой данных
//
// Возвращаемое значение:
// Таблица - Таблица значений
//
Функция ИнициализироватьТаблицуКорректировок()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ДокументСсылка",	Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	Таблица.Колонки.Добавить("НомерСтроки",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,0)));
	Таблица.Колонки.Добавить("Сумма",			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СуммаНДС",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ВидыЗапасов",		Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции // ИнициализироватьТаблицуКорректировок()

// Функция формирует таблицу курсов валют по дням.
//
Функция ПолучитьТаблицуКурсовВалют(МассивДокументов)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) КАК Дата,
		|	РеализацияТоваровУслуг.Валюта КАК Валюта
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
		|	И РеализацияТоваровУслуг.Валюта <> &ВалютаРегламентированногоУчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Валюта,
		|	Дата
		|");
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	ТаблицаКурсовВалют = Новый ТаблицаЗначений;
	ТаблицаКурсовВалют.Колонки.Добавить("Валюта",    Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаКурсовВалют.Колонки.Добавить("Дата",      Новый ОписаниеТипов("Дата"));
	ТаблицаКурсовВалют.Колонки.Добавить("Курс",      Новый ОписаниеТипов("Число"));
	ТаблицаКурсовВалют.Колонки.Добавить("Кратность", Новый ОписаниеТипов("Число"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаКурсовВалют.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		КурсыВалюты = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Выборка.Дата);
		НоваяСтрока.Курс = КурсыВалюты.Курс;
		НоваяСтрока.Кратность = КурсыВалюты.Кратность;
		
	КонецЦикла;
	
	Возврат ТаблицаКурсовВалют;
	
КонецФункции // ПолучитьТаблицуКурсовВалют()

&НаСервере 
Процедура ЗаполнитьТабличныйДокументСчетФактураСтар(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ЭтоСчетФактураНаАванс = Ложь, ПечатьВВалюте = Ложь)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Макет = УправлениеПечатью.ПолучитьМакет("Обработка.ПечатьОбщихФорм.ПФ_MXL_СчетФактура1137");
	
	ДанныеПечати      	= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКурсовВалют  = ДанныеДляПечати.ТаблицаКурсовВалют;
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Если ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 не требуется печатать счет-фактуру'"),
			ДанныеПечати.Ссылка
			);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеПечати.Номер) Тогда
			
			Если ДанныеПечати.Номер = Неопределено Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не введен счет-фактура'"),
				ДанныеПечати.Ссылка
				);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				, // "ТекстСчетФактура",
				"ТекстСчетФактура"
				);
			Иначе
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не заполнены данные предъявленной счет-фактуры поставщика'"),
				ДанныеПечати.Ссылка
				);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				"ПредъявленСчетФактура"
				);
			КонецЕсли;
			
		ИначеЕсли ПечатьВВалюте И ДанныеПечати.Валюта = ВалютаРегламентированногоУчета Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 не требуется печатать счет-фактуру в валюте'"),
			ДанныеПечати.Ссылка
			);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			
		Иначе
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки
			СведенияОбОрганизации = Новый Структура;
			ЗаполнитьРеквизитыШапкиСчетФактура(ДанныеПечати, СведенияОбОрганизации, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс, ПечатьВВалюте);
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			НомерСтраницы   = 1;
			
			// Инициализация итогов в документе
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			
			Если ПечатьВВалюте Тогда
				КоэффициентПересчета = 1;
			Иначе
				КоэффициентПересчета = КоэффициентПересчетаВалюты(ДанныеПечати, ТаблицаКурсовВалют, ВалютаРегламентированногоУчета);
			КонецЕсли;
			ДанныеСтроки = СтруктураДанныеСтроки(КоэффициентПересчета);
			
			// Создаем массив Для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;
			
			// Выводим многострочную часть документа
			ОбластьМакета  = Макет.ПолучитьОбласть("Строка");
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			Пока СтрокаТовары.Следующий() Цикл
				
				ДанныеСтроки.Номер = ДанныеСтроки.Номер + 1;
				
				ЗаполнитьРеквизитыСтрокиТовара(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета,);
				ЗаполнитьРеквизитыСтрокиТовараГТД(СтрокаТовары, ОбластьМакета);
				
				Если ЭтоСчетФактураНаАванс Тогда
					// В счетах-фактурах на аванс колонки 3,4,5 не выводятся
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Количество,Цена,СуммаБезНДС",0,0,0));
				КонецЕсли;
				
				ПроставитьПрочеркиВПустыеПоляСтрокиСчетФактура(ОбластьМакета);
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакета);
				
				Если ДанныеСтроки.Номер = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьИтого);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
				КонецЕсли;
				
				Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, ДанныеСтроки);
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ДанныеСтроки.Номер, ВалютаРегламентированногоУчета);
			ЗаполнитьРеквизитыПодвалаСчетФактура(ДанныеПечати, СведенияОбОрганизации, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыСтрокиТовараГТД(СтрокаТовары, ОбластьМакета)
	
	НомерГТД = СтрЗаменить(СтрокаТовары.НомерГТД, "/", "");
	Если Не ПустаяСтрока(НомерГТД) Тогда
		ОбластьМакета.Параметры.ПредставлениеГТД = Строка(СтрокаТовары.НомерГТД);
		ОбластьМакета.Параметры.ПредставлениеСтраны = СокрЛП(СтрокаТовары.СтранаПроисхождения);
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГТД = "";
		ОбластьМакета.Параметры.ПредставлениеСтраны = "";
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРеквизитыСтрокиТовараГТД()

&НаСервере
Процедура ПроставитьПрочеркиВПустыеПоляСтрокиСчетФактура(ОбластьМакета)
	
	Для т = 0 По ОбластьМакета.Параметры.Количество() - 1 Цикл
		
		ТекПараметр = ОбластьМакета.Параметры.Получить(т);
		
		Если НЕ ЗначениеЗаполнено(ТекПараметр) Тогда
			ОбластьМакета.Параметры.Установить(т, "--");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПодвалаСчетФактураСтар(ДанныеПечати, СведенияОбОрганизации, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс)
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоСуммаНДС = ИтоговыеСуммы.ИтогоНДС;
	ОбластьИтого.Параметры.ИтогоВсего = ИтоговыеСуммы.ИтогоСуммаСНДС;
	
	Если НЕ ЭтоСчетФактураНаАванс Тогда
		ОбластьИтого.Параметры.ИтогоСуммаБезНДС = ИтоговыеСуммы.ИтогоСумма;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
	
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		//ninch 24.01.2012 нач
		//ОбластьПодвала.Параметры.ФИОРуководителя = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель);
		//ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
		ОбластьПодвала.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель);
		ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
		
		ВрФизЛицо	= ДанныеПечати.Ссылка.Менеджер.ФизическоеЛицо;
		Если ЗначениеЗаполнено(ВрФизЛицо) Тогда
			Доверенность	= ВернутьДоверенностьФизЛица(ВрФизЛицо);
			Если Доверенность <> "" Тогда
				ОбластьПодвала.Параметры.ФИОРуководителя		= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВрФизЛицо) + Символы.ПС + "(на основании доверенности " + Символы.ПС + Доверенность +")";
				ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера	= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВрФизЛицо) + Символы.ПС + "(на основании доверенности " + Символы.ПС + Доверенность +")";
			КонецЕсли	
		КонецЕсли	
		//ninch 24.01.2012 кон
	Иначе
		//ОбластьПодвала.Параметры.ФИОПБОЮЛ = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель); //ninch 24.01.2012
		ОбластьПодвала.Параметры.ФИОПБОЮЛ = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель); //ninch 24.01.2012
		ОбластьПодвала.Параметры.Свидетельство = СведенияОбОрганизации.Свидетельство;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры // ЗаполнитьРеквизитыПодвалаСчетФактура()

&НаСервере
Функция ВернутьДоверенностьФизЛица(ВрФизЛицо)
	ЗнчДоверенности	= "";
	
	Запрос	= Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект Как ФЛ,
	|	ДополнительныеСведения.Свойство	Как СввоДовер,
	|	ДополнительныеСведения.Значение Как ЗнчДовер
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = ""Доверенность""
	|	И ДополнительныеСведения.Объект = &ФизЛицо";
	Запрос.УстановитьПараметр("ФизЛицо", ВрФизЛицо);
	ВыборкаРЗ	= Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРЗ.Следующий() Тогда
		ЗнчДоверенности	= СокрЛП(ВыборкаРЗ.ЗнчДовер);
	КонецЕсли;	
	
	Возврат ЗнчДоверенности;
КонецФункции

&НаСервере
Процедура ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ВсегоНомеров, ВалютаРегламентированногоУчета)
	
	ИтоговыеСуммы.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", ЧислоПрописью(ВсегоНомеров, ,",,,,,,,,0"));
	ИтоговыеСуммы.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(ИтоговыеСуммы.ИтогоСуммаСНДС, ВалютаРегламентированногоУчета));
	
КонецПроцедуры // ДобавитьИтоговыеДанныеПодвала()

&НаСервере
Процедура РассчитатьИтоговыеСуммы(ИтоговыеСуммы, ДанныеСтроки)
	
	// Увеличим итоги по странице.
	ИтоговыеСуммы.ИтогоМестНаСтранице        = ИтоговыеСуммы.ИтогоМестНаСтранице        + ДанныеСтроки.Мест;
	ИтоговыеСуммы.ИтогоКоличествоНаСтранице  = ИтоговыеСуммы.ИтогоКоличествоНаСтранице  + ДанныеСтроки.Количество;
	ИтоговыеСуммы.ИтогоСуммаНаСтранице       = ИтоговыеСуммы.ИтогоСуммаНаСтранице       + ДанныеСтроки.СуммаБезНДС;
	ИтоговыеСуммы.ИтогоНДСНаСтранице         = ИтоговыеСуммы.ИтогоНДСНаСтранице         + ДанныеСтроки.СуммаНДС;
	ИтоговыеСуммы.ИтогоСуммаСНДСНаСтранице   = ИтоговыеСуммы.ИтогоСуммаСНДСНаСтранице   + ДанныеСтроки.СуммаСНДС;
	ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице = ИтоговыеСуммы.ИтогоМассаБруттоНаСтранице + ДанныеСтроки.МассаБрутто;
	ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице  = ИтоговыеСуммы.ИтогоМассаНеттоНаСтранице  + ДанныеСтроки.МассаНетто;
	
	// Увеличим итоги по документу.
	ИтоговыеСуммы.ИтогоМест        = ИтоговыеСуммы.ИтогоМест        + ДанныеСтроки.Мест;
	ИтоговыеСуммы.ИтогоКоличество  = ИтоговыеСуммы.ИтогоКоличество  + ДанныеСтроки.Количество;
	ИтоговыеСуммы.ИтогоСумма       = ИтоговыеСуммы.ИтогоСумма       + ДанныеСтроки.СуммаБезНДС;
	ИтоговыеСуммы.ИтогоНДС         = ИтоговыеСуммы.ИтогоНДС         + ДанныеСтроки.СуммаНДС;
	ИтоговыеСуммы.ИтогоСуммаСНДС   = ИтоговыеСуммы.ИтогоСуммаСНДС   + ДанныеСтроки.СуммаСНДС;
	ИтоговыеСуммы.ИтогоМассаБрутто = ИтоговыеСуммы.ИтогоМассаБрутто + ДанныеСтроки.МассаБрутто;
	ИтоговыеСуммы.ИтогоМассаНетто  = ИтоговыеСуммы.ИтогоМассаНетто  + ДанныеСтроки.МассаНетто;
	
КонецПроцедуры // РассчитатьИтоговыеСуммы()

&НаСервере
Функция СтруктураДанныеСтроки(КоэффициентПересчета)
	
	Структура = Новый Структура;
	Структура.Вставить("Номер", 0);
	Структура.Вставить("Мест", 0);
	Структура.Вставить("Количество", 0);
	Структура.Вставить("Цена", 0);
	Структура.Вставить("СуммаБезНДС", 0);
	Структура.Вставить("СуммаНДС", 0);
	Структура.Вставить("СуммаСНДС", 0);
	Структура.Вставить("КоэффициентПересчета", КоэффициентПересчета);
	Структура.Вставить("МассаБрутто", 0);
	Структура.Вставить("МассаНетто", 0);
	Структура.Вставить("КоличествоПрослеживаемое", 0);

	
	Возврат Структура;
	
КонецФункции // СтруктураДанныеСтроки()

&НаСервере
Функция СтруктураИтоговыеСуммы()
	
	Структура = Новый Структура;
	
	// Инициализация итогов по странице.
	Структура.Вставить("ИтогоМассаБруттоНаСтранице", 0);
	Структура.Вставить("ИтогоМестНаСтранице", 0);
	Структура.Вставить("ИтогоКоличествоНаСтранице", 0);
	Структура.Вставить("ИтогоСуммаНаСтранице", 0);
	Структура.Вставить("ИтогоНДСНаСтранице", 0);
	Структура.Вставить("ИтогоСуммаСНДСНаСтранице", 0);
	Структура.Вставить("ИтогоМассаБруттоНаСтранице", 0);
	Структура.Вставить("ИтогоМассаНеттоНаСтранице", 0);
	
	// Инициализация итогов по документу.
	Структура.Вставить("ИтогоМассаБрутто", 0);
	Структура.Вставить("ИтогоМест", 0);
	Структура.Вставить("ИтогоКоличество", 0);
	Структура.Вставить("ИтогоСуммаСНДС", 0);
	Структура.Вставить("ИтогоСумма", 0);
	Структура.Вставить("ИтогоНДС", 0);
	Структура.Вставить("ИтогоМассаБрутто", 0);
	Структура.Вставить("ИтогоМассаНетто", 0);
	
	Структура.Вставить("КоличествоПорядковыхНомеровЗаписейПрописью", 0);
	Структура.Вставить("СуммаПрописью", "");
	
	Возврат Структура;
	
КонецФункции // СтруктураИтоговыеСуммы()

//конец печать СФ

//печать приложение вв
Процедура СортироватьДокументыПоСкладу(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка,
	|	ПеремещениеТоваров.СкладПолучатель КАК Склад
	|ПОМЕСТИТЬ Доки
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Склад
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Доки.Ссылка,
	|	Доки.Склад
	|ИЗ
	|	Доки КАК Доки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доки.Склад.Наименование";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецПроцедуры

&НаСервере
Функция СформироватьПечатнуюФормуПриложенияДляВетВрача(СтрокаМаршрута, КоличествоЭкземпляров, ТипПечати, ТаблицаПФ)
	
	МассивОбъектов = Новый Массив;
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг") И Не СтрЗаказ.Пометка = 0 Тогда
			МассивОбъектов.Добавить(СтрЗаказ.Автомобиль);
		КонецЕсли;	
	КонецЦикла;	
	
	Обработка = РеквизитФормывЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("ПФ_MXL_ПриложениеДляВетВрача");
	
	МассивТД    = Новый Массив;
	СоответствиеМагазинов = Новый Соответствие;
	МассивМагаз = Новый Массив;
	Для Каждого Магаз Из МассивОбъектов Цикл
		Склад = ?(ТипЗнч(Магаз) = Тип("ДокументСсылка.РеализацияТоваровУслуг"), Магаз.Склад, Магаз.СкладПолучатель);
		МассивДокументовМагазина = СоответствиеМагазинов.Получить(Склад);
		Если МассивДокументовМагазина = Неопределено Тогда
			СоответствиеМагазинов.Вставить(Склад, Новый Массив);
			МассивДокументовМагазина = СоответствиеМагазинов.Получить(Склад);
		КонецЕсли;
		МассивДокументовМагазина.Добавить(Магаз);
	КонецЦикла;
	//Сообщить(СоответствиеМагазинов.Количество());
	Для Каждого МассивМаг Из СоответствиеМагазинов Цикл
		ТД = СформироватьПечатнуюФормуПриложенияДляВетВрачаНов(МассивМаг.Значение, Макет, КоличествоЭкземпляров, ТипПечати, ТаблицаПФ);
		Если Не ТД = Неопределено Тогда
			МассивТД.Добавить(ТД);
		КонецЕсли;
	КонецЦикла;
	//Сообщить(МассивТД.Количество());
	
	СохранитьДанныеОПечати(МассивОбъектов, "Приложение для ветврача", СтрокаМаршрута.ЗНО, КоличествоЭкземпляров);
	
	Возврат МассивТД;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Накладная_Для_ветеренарного_врача";
	
	
	// Зададим параметры Макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ТолькоПросмотр = Ложь;
	
	//текстЗапроса
	Если Истина Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение КАК Группа,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.Код КАК ТоварКод,
		|	СУММА(ВЫБОР
		|			КОГДА ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ПеремещениеТоваровДатыВыпуска.Количество
		|			ИНАЧЕ ПеремещениеТоваровДатыВыпуска.Количество * ПеремещениеТоваровДатыВыпуска.Номенклатура.Вес
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ПеремещениеТоваровДатыВыпуска.Количество * ПеремещениеТоваровДатыВыпуска.Номенклатура.Вес) КАК Вес,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска
		|ИЗ
		|	Документ.ПеремещениеТоваров.ДатыВыпуска КАК ПеремещениеТоваровДатыВыпуска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО ПеремещениеТоваровДатыВыпуска.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО ПеремещениеТоваровДатыВыпуска.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ПеремещениеТоваровДатыВыпуска.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.Код,
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения,
		|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказНаПеремещениеТовары.Номенклатура,
		|	ЗаказНаПеремещениеТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ЗаказНаПеремещениеТовары.Количество
		|			ИНАЧЕ ЗаказНаПеремещениеТовары.КоличествоУпаковок * ЗаказНаПеремещениеТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(ЗаказНаПеремещениеТовары.КоличествоУпаковок * ЗаказНаПеремещениеТовары.Номенклатура.Вес),
		|	ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО ЗаказНаПеремещениеТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО ЗаказНаПеремещениеТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ЗаказНаПеремещениеТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ ЗаказНаПеремещениеТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПеремещениеТовары.Номенклатура,
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
		|	ЗаказНаПеремещениеТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказКлиентаТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ЗаказКлиентаТовары.КоличествоУпаковок
		|			ИНАЧЕ ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Номенклатура.Вес),
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказКлиентаТовары.Номенклатура.Код,
		|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА РеализацияТоваровУслугТовары.КоличествоУпаковок
		|			ИНАЧЕ РеализацияТоваровУслугТовары.КоличествоУпаковок * РеализацияТоваровУслугТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок * РеализацияТоваровУслугТовары.Номенклатура.Вес),
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код,
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Группа,
		|	Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ТоварНаименование),
		|	МАКСИМУМ(ТоварКод),
		|	СУММА(Количество),
		|	СУММА(Вес)
		|ПО
		|	Группа
		|АВТОУПОРЯДОЧИВАНИЕ");
	КонецЕсли; 
	
	Для Каждого ТекДок Из МассивОбъектов Цикл
		
		Запрос.УстановитьПараметр("МассивОбъектов", ТекДок);
		Запрос.УстановитьПараметр("Значение", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Корма Для непродуктивных животных:"));
		
		РезультатТовары = Запрос.Выполнить();
		Если РезультатТовары.Пустой() Тогда
			Продолжить;
		КонецЕсли;	
		
		
		
		//Если ТипПечати = "2" ИЛИ ТипПечати = "4" Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение = &Значение");
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение = &Значение");
		//КонецЕсли; 
		
		МассивНоменклатуры = Новый Массив;
		ИтогоКолВо = 0;
		
		НомерДатаНакладной = "Накладная "; ДатаНакладной = Дата(1,1,1); ШапкаОрганизация = Справочники.Организации.ПустаяСсылка();
		ЖДП = ""; ТекущийМагазин = "";ТекстСообщения = "Не найдены: " + Символы.ПС + "По документам: ";КоличествоНеНайденых = 0;
		
		ТаблицаНоменклатурИДатВыработки = Новый ТаблицаЗначений;
		ТаблицаНоменклатурИДатВыработки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаНоменклатурИДатВыработки.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
		
		//Для Каждого ТекДок Из МассивОбъектов Цикл
		Если ЗначениеЗаполнено(ДатаНакладной) И НЕ ДатаНакладной = Формат(ТекДок.Дата, "ДФ=dd.MM.yy") Тогда
			НомерДатаНакладной = НомерДатаНакладной + " от " + Формат(ТекДок.Дата, "ДФ=dd.MM.yy") + ", ";
		КонецЕсли; 
		ТекстСообщения = ТекстСообщения  + Строка(ТекДок) + Символы.ПС;
		
		НомерДатаНакладной = НомерДатаНакладной + ТекДок.Номер + ", ";
		ДатаНакладной = Формат(ТекДок.Дата, "ДФ=dd.MM.yy");
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			ТекущийМагазин = ТекДок.СкладПолучатель;
		Иначе
			ТекущийМагазин = НайтиСкладКонтрагента(ТекДок.Контрагент);
		КонецЕсли; 
		ШапкаОрганизация = ТекДок.Организация;
		//Если ТипПечати = "3" Тогда
		//	Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		//		ЖДП = ТекДок.ЖелаемаяДатаПоступления;
		//	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		//		ЖДП = ТекДок.ЖелаемаяДатаОтгрузки;
		//	ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//		ЖДП = ТекДок.ЗаказКлиента.ЖелаемаяДатаОтгрузки;
		//	Иначе
		//		Если ПустаяСтрока(ТекДок.ЗаказНаПеремещение) Тогда
		//			ЖДП = ТекДок.ДатаРаспоряжения;
		//		Иначе
		//			ЖДП = ТекДок.ЗаказНаПеремещение.ЖелаемаяДатаПоступления;
		//		КонецЕсли; 
		//	КонецЕсли; 
		//КонецЕсли; 
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Для Каждого ТекСтр Из ТекДок.ДатыВыпуска Цикл
				НоваяСтрока = ТаблицаНоменклатурИДатВыработки.Добавить();
				НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
				НоваяСтрока.ДатаВыпуска = ТекСтр.ДатаВыпуска;
			КонецЦикла; 
		Иначе
			Для Каждого ТекСтр Из ТекДок.Товары Цикл
				МассивНоменклатуры.Добавить(ТекСтр.Номенклатура);
			КонецЦикла;
		КонецЕсли; 
		//КонецЦикла; 
		
		НомерДатаНакладной = НомерДатаНакладной + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yy");
		//Если ТипПечати = "3" ИЛИ ТипПечати = "4" ИЛИ ТипПечати = "5" Тогда
		//	//НомерДатаНакладной = Формат(ЖДП, "ДФ=dd.MM.yy");
		//	НомерДатаНакладной = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
		//КонецЕсли; 
		//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
		НомерДатаНакладной = "Накладная " + Лев(ТекущийМагазин,5) + "  " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
		//КонецЕсли; 
		
		//Получаем таблицу дат выработки
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ТаблицаИскомыхЗначений = ПолучитьТаблицуДатВыработки(ТаблицаНоменклатурИДатВыработки);
		Иначе	
			ТаблицаИскомыхЗначений = НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатуры);
		КонецЕсли; 
		
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаШапка.Параметры.НомерДатаНакладной = НомерДатаНакладной;
		ОбластьМакетаШапка.Параметры.АдресМагазина = ПолучитьАдресМагазина(ТекущийМагазин);
		
		СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ШапкаОрганизация, ДатаНакладной);
		ОрганизацияСтрока = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
		ОбластьМакетаШапка.Параметры.Организация = ОрганизацияСтрока;
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьМакетаШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
		
		ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
		ОбластьСтрокТовары = Макет.ПолучитьОбласть("Детали");
		НомерПоПорядку = 1;ИтогоВес = 0; 
		
		// Выборка товаров
		ВыборкаГруппТовары = РезультатТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппТовары.Следующий() Цикл
			
			ОбластьГруппа.Параметры.НоменклатурнаяГруппа = СокрЛП(ВыборкаГруппТовары.Группа);
			//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
			ОбластьГруппа.Параметры.КолВо 				 = Формат(ВыборкаГруппТовары.Количество, "ЧДЦ=2") + "/" + Формат(ВыборкаГруппТовары.Вес, "ЧДЦ=2");
			ЗаписьЖурналаРегистрации("ВВ",,,, Формат(ВыборкаГруппТовары.Количество, "ЧДЦ=2") + "/" + Формат(ВыборкаГруппТовары.Вес, "ЧДЦ=2"));
			ЗаписьЖурналаРегистрации("ВВ",,,,ОбластьГруппа.Параметры.КолВо);
			Сообщить("***");
			//Иначе
			//	ОбластьГруппа.Параметры.КолВо 				 = Формат(ВыборкаГруппТовары.Количество, "ЧДЦ=2");
			//КонецЕсли;
			ТабДокумент.Вывести(ОбластьГруппа);
			
			ВыборкаСтрокТовары = ВыборкаГруппТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСтрокТовары.Следующий() Цикл
				ОбластьСтрокТовары.Параметры.Заполнить(ВыборкаСтрокТовары);
				
				ОбластьСтрокТовары.Параметры.Номенклатура	 	= ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СокрЛП(ВыборкаСтрокТовары.ТоварНаименование));
				ОбластьСтрокТовары.Параметры.КолВо			 	= Формат(ВыборкаСтрокТовары.Количество, "ЧДЦ=2");
				ИтогоКолВо = ИтогоКолВо +  ВыборкаСтрокТовары.Количество;
				ИтогоВес = ИтогоВес + ВыборкаСтрокТовары.Вес;
				
				СтруктураДат 										= ТаблицаИскомыхЗначений.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
				Если НЕ СтруктураДат = Неопределено Тогда
					ОбластьСтрокТовары.Параметры.ДатаВыработки		= "" + Формат(СтруктураДат.ДатаВыработки, "ДФ=dd.MM.yyyy");
				Иначе
					МассивНоменклатура = Новый Массив();
					МассивНоменклатура.Добавить(ВыборкаСтрокТовары.Номенклатура);
					ТаблицаДатПоНоменклатуре	= НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатура);
					СтруктураДат				= ТаблицаДатПоНоменклатуре.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
					ТекстСообщения = ТекстСообщения + "Номенклатура: " + ВыборкаСтрокТовары.Номенклатура + "    Дата выработки: " + Формат(ВыборкаСтрокТовары.ДатаВыпуска, "ДФ=dd.MM.yyyy");
					КоличествоНеНайденых = КоличествоНеНайденых + 1;
					Если ПустаяСтрока(СтруктураДат) Тогда
						ОбластьСтрокТовары.Параметры.ДатаВыработки = "";
					Иначе
						ОбластьСтрокТовары.Параметры.ДатаВыработки = "" + СтруктураДат.ДатаВыработки;
					КонецЕсли; 
				КонецЕсли; 
				
				Если НЕ ПустаяСтрока(СтруктураДат) И НЕ ПустаяСтрока(СтруктураДат.НомерВетСвидетельства) Тогда
					ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = СтруктураДат.НомерВетСвидетельства;
				Иначе
					ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = "";
					
					МассивНоменклатура = Новый Массив();
					МассивНоменклатура.Добавить(ВыборкаСтрокТовары.Номенклатура);
					ТаблицаДатПоНоменклатуре	= НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатура);
					СтруктураДат				= ТаблицаДатПоНоменклатуре.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
					
					Если ПустаяСтрока(СтруктураДат) Тогда
						ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = "";
					Иначе
						ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = СтруктураДат.НомерВетСвидетельства;
					КонецЕсли; 
				КонецЕсли; 
				
				ПроизВодитель			 							= ПолучитьФиксПоставщика(ВыборкаСтрокТовары.Номенклатура);
				Если ПроизВодитель = Неопределено Тогда
					ОбластьСтрокТовары.Параметры.ПроизВодитель		= "";
				Иначе
					ОбластьСтрокТовары.Параметры.ПроизВодитель		= ПроизВодитель;
				КонецЕсли; 
				
				ТабДокумент.Вывести(ОбластьСтрокТовары);
				НомерПоПорядку = НомерПоПорядку + 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
		//Если КоличествоНеНайденых > 0 Тогда
		//	ОтправитьФайлПоПочте(ТекстСообщения);
		//КонецЕсли; 
		
		// Выводим итоги по документу в целом
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ПараметрыПредметаИсчисления = "килограмм, килограмма, килограммов, м, грамм, грамма, граммов, м, 3";
		ФорматнаяСтрока = "Л=ru_RU; ДП=Истина";
		
		ИтогоВесПрописью = ЧислоПрописью(ИтогоВес, ФорматнаяСтрока, ПараметрыПредметаИсчисления);
		
		//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
		ОбластьМакета.Параметры.ВесНетто = "" + Формат(ИтогоВес , "ЧДЦ=2") + "(" + ИтогоВесПрописью + ")";
		//КонецЕсли; 
		ОбластьМакета.Параметры.ИтогоКолВо = Формат(ИтогоКолВо, "ЧДЦ=2");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	//Если ТипПечати = "3" ИЛИ ТипПечати = "4" ИЛИ ТипПечати = "5" Тогда
	//	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	//	ТабДокумент.Вывести(ОбластьМакета);
	//КонецЕсли; 
	
	Возврат ТабДокумент;
	
КонецФункции

//**************** ВЕТЕРИНАРКА НОВАЯ
&НаСервере
Функция СформироватьПечатнуюФормуПриложенияДляВетВрачаНов(МассивОбъектов, Макет, КоличествоЭкземпляров, ТипПечати = 1, ТаблицаПФ)
	
	//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
	//	Макет = ПолучитьМакет("ПФ_MXL_ПриложениеДляВетВрача");
	//ИначеЕсли ТипПечати = "3" ИЛИ ТипПечати = "4" Тогда
	//	Макет = ПолучитьМакет("ПФ_MXL_ПриложениеДляВетВрачаНовосибирск");
	//Иначе
	//	Макет = ПолучитьМакет("ПФ_MXL_ПриложениеДляВетВрачаНовосибирск_Старая");
	//КонецЕсли; 
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Накладная_Для_ветеренарного_врача";
	
	МассивНоменклатуры = Новый Массив;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ТолькоПросмотр = Ложь;
	ТабДокумент.КоличествоЭкземпляров = 2;
	
	ИтогоКолВо = 0;
	
	//текстЗапроса
	Если Истина Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение КАК Группа,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное КАК ТоварНаименование,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.Код КАК ТоварКод,
		|	СУММА(ВЫБОР
		|			КОГДА ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ПеремещениеТоваровДатыВыпуска.Количество
		|			ИНАЧЕ ПеремещениеТоваровДатыВыпуска.Количество * ПеремещениеТоваровДатыВыпуска.Номенклатура.Вес
		|		КОНЕЦ) КАК Количество,
		|	СУММА(ПеремещениеТоваровДатыВыпуска.Количество * ПеремещениеТоваровДатыВыпуска.Номенклатура.Вес) КАК Вес,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска,
		|	ПеремещениеТоваровДатыВыпуска.НомерПартии
		|ИЗ
		|	Документ.ПеремещениеТоваров.ДатыВыпуска КАК ПеремещениеТоваровДатыВыпуска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО ПеремещениеТоваровДатыВыпуска.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО ПеремещениеТоваровДатыВыпуска.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ПеремещениеТоваровДатыВыпуска.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.НаименованиеПолное,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.Код,
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	ПеремещениеТоваровДатыВыпуска.Номенклатура.ЕдиницаИзмерения,
		|	ПеремещениеТоваровДатыВыпуска.ДатаВыпуска,
		|	ПеремещениеТоваровДатыВыпуска.НомерПартии
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказНаПеремещениеТовары.Номенклатура,
		|	ЗаказНаПеремещениеТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ЗаказНаПеремещениеТовары.Количество
		|			ИНАЧЕ ЗаказНаПеремещениеТовары.КоличествоУпаковок * ЗаказНаПеремещениеТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(ЗаказНаПеремещениеТовары.КоличествоУпаковок * ЗаказНаПеремещениеТовары.Номенклатура.Вес),
		|	ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО ЗаказНаПеремещениеТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО ЗаказНаПеремещениеТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ЗаказНаПеремещениеТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ ЗаказНаПеремещениеТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПеремещениеТовары.Номенклатура,
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказНаПеремещениеТовары.Номенклатура.Код,
		|	ЗаказНаПеремещениеТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказНаПеремещениеТовары.Номенклатура.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказКлиентаТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ЗаказКлиентаТовары.КоличествоУпаковок
		|			ИНАЧЕ ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок * ЗаказКлиентаТовары.Номенклатура.Вес),
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение,
		|	ЗаказКлиентаТовары.Номенклатура.Код,
		|	ЗаказКлиентаТовары.Номенклатура.НаименованиеПолное,
		|	ЗаказКлиентаТовары.Номенклатура.ЕдиницаИзмерения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код,
		|	СУММА(ВЫБОР
		|			КОГДА РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения.Код = ""796""
		|				ТОГДА РеализацияТоваровУслугТовары.КоличествоУпаковок
		|			ИНАЧЕ РеализацияТоваровУслугТовары.КоличествоУпаковок * РеализацияТоваровУслугТовары.Номенклатура.Вес
		|		КОНЕЦ),
		|	СУММА(РеализацияТоваровУслугТовары.КоличествоУпаковок * РеализацияТоваровУслугТовары.Номенклатура.Вес),
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Номенклатура.НаименованиеПолное,
		|	РеализацияТоваровУслугТовары.Номенклатура.Код,
		|	НоменклатураДополнительныеРеквизитыВетГруппа.Значение,
		|	РеализацияТоваровУслугТовары.Номенклатура.ЕдиницаИзмерения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Группа,
		|	Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ТоварНаименование),
		|	МАКСИМУМ(ТоварКод),
		|	СУММА(Количество),
		|	СУММА(Вес)
		|ПО
		|	Группа
		|АВТОУПОРЯДОЧИВАНИЕ");
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Значение", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Корма для непродуктивных животных:"));
	Если ТипПечати = "2" ИЛИ ТипПечати = "4" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение = &Значение");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение = &Значение");
	КонецЕсли; 
	
	НомерДатаНакладной = "Накладная "; ДатаНакладной = Дата(1,1,1); ШапкаОрганизация = Справочники.Организации.ПустаяСсылка();
	ЖДП = ""; ТекущийМагазин = "";ТекстСообщения = "Не найдены: " + Символы.ПС + "По документам: ";КоличествоНеНайденых = 0;
	
	ТаблицаНоменклатурИДатВыработки = Новый ТаблицаЗначений;
	ТаблицаНоменклатурИДатВыработки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатурИДатВыработки.Колонки.Добавить("ДатаВыпуска", Новый ОписаниеТипов("Дата"));
	ТаблицаНоменклатурИДатВыработки.Колонки.Добавить("НомерПартии", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(90)));
	
	_НомераДокументов = ПолучитьНомераНакладныхСГруппировкойПоДате(МассивОбъектов, ТипПечати);
	 НомераДокументов = ""; //Оставил, ибо выискивать все и выправлять лень
	Для каждого ТекДок Из МассивОбъектов Цикл
		
		НомераДокументов = НомераДокументов + ?(НомераДокументов = "", "", ", ") + ТекДок.Номер;
		
		Если ЗначениеЗаполнено(ДатаНакладной) И НЕ ДатаНакладной = Формат(ТекДок.Дата, "ДФ=dd.MM.yy") Тогда
			НомерДатаНакладной = НомерДатаНакладной + " от " + Формат(ТекДок.Дата, "ДФ=dd.MM.yy") + ", ";
		КонецЕсли; 
		ТекстСообщения = ТекстСообщения  + Строка(ТекДок) + Символы.ПС;
		
		НомерДатаНакладной = НомерДатаНакладной + ТекДок.Номер + ", ";
		ДатаНакладной = Формат(ТекДок.Дата, "ДФ=dd.MM.yy");
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			ТекущийМагазин = ТекДок.СкладПолучатель;
		Иначе
			ТекущийМагазин = НайтиСкладКонтрагента(ТекДок.Контрагент);
		КонецЕсли; 
		ШапкаОрганизация = ТекДок.Организация;
		Если ТипПечати = "3" Тогда
			Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				ЖДП = ТекДок.ЖелаемаяДатаПоступления;
			ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				ЖДП = ТекДок.ЖелаемаяДатаОтгрузки;
			ИначеЕсли ТипЗнч(ТекДок) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЖДП = ТекДок.ЗаказКлиента.ЖелаемаяДатаОтгрузки;
			Иначе
				Если ПустаяСтрока(ТекДок.ЗаказНаПеремещение) Тогда
					ЖДП = ТекДок.ДатаРаспоряжения;
				Иначе
					ЖДП = ТекДок.ЗаказНаПеремещение.ЖелаемаяДатаПоступления;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		Если ТипЗнч(ТекДок) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			Для каждого ТекСтр Из ТекДок.ДатыВыпуска Цикл
				НоваяСтрока = ТаблицаНоменклатурИДатВыработки.Добавить();
				НоваяСтрока.Номенклатура = ТекСтр.Номенклатура;
				НоваяСтрока.ДатаВыпуска = ТекСтр.ДатаВыпуска;
				НоваяСтрока.НомерПартии = ТекСтр.НомерПартии;
			КонецЦикла; 
		Иначе
			Для каждого ТекСтр Из ТекДок.Товары Цикл
				МассивНоменклатуры.Добавить(ТекСтр.Номенклатура);
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла; 
	
	НомерДатаНакладной = НомерДатаНакладной + " от " + Формат(ДатаНакладной, "ДФ=dd.MM.yy");
	Если ТипПечати = "3" ИЛИ ТипПечати = "4" ИЛИ ТипПечати = "5" Тогда
		//НомерДатаНакладной = Формат(ЖДП, "ДФ=dd.MM.yy");
		НомерДатаНакладной = Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
	КонецЕсли; 
	//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
	НомерДатаНакладной = "Накладная " + Лев(ТекущийМагазин,5) + "  " + Формат(ТекущаяДата(), "ДФ=dd.MM.yy");
	//КонецЕсли; 
	
	//Получаем таблицу дат выработки
	Если ТипЗнч(МассивОбъектов[0].Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ТаблицаИскомыхЗначений = ПолучитьТаблицуДатВыработки(ТаблицаНоменклатурИДатВыработки);
	Иначе	
		ТаблицаИскомыхЗначений = НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатуры);
	КонецЕсли; 
	
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаШапка.Параметры.НомерДатаНакладной = НомерДатаНакладной;
	ОбластьМакетаШапка.Параметры.АдресМагазина	    = ПолучитьАдресаМагазинов(МассивОбъектов);
	ОбластьМакетаШапка.Параметры.АдресСклада	    = ПолучитьАдресСклада(МассивОбъектов);
	ОбластьМакетаШапка.Параметры.НомераДокументов   = _НомераДокументов;

	
	СведенияОбОрганизации = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ШапкаОрганизация, ДатаНакладной);
	ОрганизацияСтрока = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
	ОбластьМакетаШапка.Параметры.Организация = ОрганизацияСтрока;
	ТабДокумент.Вывести(ОбластьМакетаШапка);
	
	ОбластьМакетаШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаШапкаТаблицы);
	
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьСтрокТовары = Макет.ПолучитьОбласть("Детали");
	НомерПоПорядку = 1;ИтогоВес = 0; 
	
	// Выборка товаров
	ВыборкаГруппТовары = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЕстьТовары = Ложь;
	Пока ВыборкаГруппТовары.Следующий() Цикл
		
		ОбластьГруппа.Параметры.НоменклатурнаяГруппа = СокрЛП(ВыборкаГруппТовары.Группа);
		//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
		ОбластьГруппа.Параметры.КолВо 				 = Формат(ВыборкаГруппТовары.Количество, "ЧДЦ=2") + "/" + Формат(ВыборкаГруппТовары.Вес, "ЧДЦ=2");
		//Иначе
		//	ОбластьГруппа.Параметры.КолВо 				 = Формат(ВыборкаГруппТовары.Количество, "ЧДЦ=2");
		//КонецЕсли;
		ТабДокумент.Вывести(ОбластьГруппа);
		
		ВыборкаСтрокТовары = ВыборкаГруппТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			ЕстьТовары = Истина;
			ОбластьСтрокТовары.Параметры.Заполнить(ВыборкаСтрокТовары);
			
			ОбластьСтрокТовары.Параметры.Номенклатура	 	= ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(СокрЛП(ВыборкаСтрокТовары.ТоварНаименование));
			ОбластьСтрокТовары.Параметры.КолВо			 	= Формат(ВыборкаСтрокТовары.Количество, "ЧДЦ=2");
			ИтогоКолВо = ИтогоКолВо +  ВыборкаСтрокТовары.Количество;
			ИтогоВес = ИтогоВес + ВыборкаСтрокТовары.Вес;
			
			СтруктураДат 										= ТаблицаИскомыхЗначений.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
			Если НЕ СтруктураДат = Неопределено Тогда
				ОбластьСтрокТовары.Параметры.ДатаВыработки		= "" + Формат(СтруктураДат.ДатаВыработки, "ДФ=dd.MM.yyyy");
			Иначе
				МассивНоменклатура = Новый Массив();
				МассивНоменклатура.Добавить(ВыборкаСтрокТовары.Номенклатура);
				ТаблицаДатПоНоменклатуре	= НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатура);
				СтруктураДат				= ТаблицаДатПоНоменклатуре.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
				ТекстСообщения = ТекстСообщения + "Номенклатура: " + ВыборкаСтрокТовары.Номенклатура + "    Дата выработки: " + Формат(ВыборкаСтрокТовары.ДатаВыпуска, "ДФ=dd.MM.yyyy");
				КоличествоНеНайденых = КоличествоНеНайденых + 1;
				Если ПустаяСтрока(СтруктураДат) Тогда
					ОбластьСтрокТовары.Параметры.ДатаВыработки = "";
				Иначе
					ОбластьСтрокТовары.Параметры.ДатаВыработки = "" + СтруктураДат.ДатаВыработки;
				КонецЕсли; 
			КонецЕсли; 
			
			Если НЕ ПустаяСтрока(СтруктураДат) И НЕ ПустаяСтрока(СтруктураДат.НомерВетСвидетельства) Тогда
				ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = СтруктураДат.НомерВетСвидетельства;
			Иначе
				ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = "";
				
				МассивНоменклатура = Новый Массив();
				МассивНоменклатура.Добавить(ВыборкаСтрокТовары.Номенклатура);
				ТаблицаДатПоНоменклатуре	= НайтиДокументыПоступленияПоНоменклатуре(МассивНоменклатура);
				СтруктураДат				= ТаблицаДатПоНоменклатуре.Найти(ВыборкаСтрокТовары.Номенклатура, "Номенклатура");
				
				Если ПустаяСтрока(СтруктураДат) Тогда
					ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = "";
				Иначе
					ОбластьСтрокТовары.Параметры.НомерВетСвидетельства = СтруктураДат.НомерВетСвидетельства;
				КонецЕсли; 
			КонецЕсли; 
			
			ГдеБратьПроизводителя = ПолучитьПоставщикаИзПоступления(ВыборкаСтрокТовары.Номенклатура);
			Если ГдеБратьПроизводителя И НЕ ПустаяСтрока(СтруктураДат.Контрагент) Тогда
				ОбластьСтрокТовары.Параметры.ПроизВодитель		= СтруктураДат.Контрагент;
			Иначе	
				ПроизВодитель			 							= ПолучитьФиксПоставщика(ВыборкаСтрокТовары.Номенклатура);
				Если ПроизВодитель = Неопределено Тогда
					ОбластьСтрокТовары.Параметры.ПроизВодитель		= "";
				Иначе
					ОбластьСтрокТовары.Параметры.ПроизВодитель		= ПроизВодитель;
				КонецЕсли; 
			КонецЕсли; 
			
			ТабДокумент.Вывести(ОбластьСтрокТовары);
			НомерПоПорядку = НомерПоПорядку + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если КоличествоНеНайденых > 0 Тогда
		ОтправитьФайлПоПочте(ТекстСообщения);
	КонецЕсли; 
	
	// Выводим итоги по документу в целом
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ПараметрыПредметаИсчисления = "килограмм, килограмма, килограммов, м, грамм, грамма, граммов, м, 3";
	ФорматнаяСтрока = "Л=ru_RU; ДП=Истина";
	
	ИтогоВесПрописью = ЧислоПрописью(ИтогоВес, ФорматнаяСтрока, ПараметрыПредметаИсчисления);
	
	//Если ТипПечати = "1" ИЛИ ТипПечати = "2" Тогда
	ОбластьМакета.Параметры.ВесНетто = "" + Формат(ИтогоВес , "ЧДЦ=2") + "(" + ИтогоВесПрописью + ")";
	//КонецЕсли; 
	ОбластьМакета.Параметры.ИтогоКолВо = Формат(ИтогоКолВо, "ЧДЦ=2");
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если ТипПечати = "3" ИЛИ ТипПечати = "4" ИЛИ ТипПечати = "5" Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли; 
	
	Если ЕстьТовары Тогда
		ЗаполнитьЗначенияСвойств(ТаблицаПФ.Добавить(), Новый Структура("ТД, Код", ТабДокумент, Лев(ТекущийМагазин,5)));
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьНомераНакладныхСГруппировкойПоДате(МассивОбъектов, ТипПечати)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.Дата, ДЕНЬ) КАК Дата,
		|	Док.Ссылка.Номер КАК Номер
		|ПОМЕСТИТЬ вр
		|ИЗ
		|	Документ.ПеремещениеТоваров.ДатыВыпуска КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	Док.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.Дата, ДЕНЬ),
		|	Док.Ссылка.Номер
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Товары КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	Док.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ Док.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.Дата, ДЕНЬ),
		|	Док.Ссылка.Номер
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетГруппа
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты_ВетКонтроль
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизиты_ВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты_ВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	Док.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение
		|	И НЕ Док.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Док.Ссылка.Дата, ДЕНЬ),
		|	Док.Ссылка.Номер
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Док
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетГруппа
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизитыВетГруппа.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетГруппа.Свойство.Наименование = ""НоменклатурнаяГруппаДляВетВрача"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизитыВетКонтроль
		|		ПО Док.Номенклатура = НоменклатураДополнительныеРеквизитыВетКонтроль.Ссылка
		|			И (НоменклатураДополнительныеРеквизитыВетКонтроль.Свойство.Наименование = ""ВетКонтроль"")
		|ГДЕ
		|	Док.Ссылка В(&МассивОбъектов)
		|	И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	вр.Дата КАК Дата,
		|	вр.Номер КАК Номер
		|ИЗ
		|	вр КАК вр
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номер)
		|ПО
		|	Дата");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Значение", Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("Корма для непродуктивных животных:"));
	Если ТипПечати = "2" ИЛИ ТипПечати = "4" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизитыВетГруппа.Значение = &Значение");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение <> &Значение", "И НоменклатураДополнительныеРеквизиты_ВетГруппа.Значение = &Значение");
	КонецЕсли;
	
	Рез = Запрос.Выполнить();
	
	ДокументыДаты = "";
	
	ВыборкаДата = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДата.Следующий() Цикл
		
		Дата = ВыборкаДата.Дата;
		Номер = "";
		
		ВыборкаНомера = ВыборкаДата.Выбрать();
		Пока ВыборкаНомера.Следующий() Цикл
			Номер = Номер + ?(Номер = "", "", ", ") + ВыборкаНомера.Номер;
		КонецЦикла;
		
		ДокументыДаты = ДокументыДаты + ?(Документы = "", "", Символы.ПС) + Номер + " " + "от" + " " + Формат(Дата, "ДЛФ = Д")
		
	КонецЦикла;
	
	Возврат ДокументыДаты;
	
КонецФункции

Функция НайтиДокументПоступленияСНомеромВетСвидетельства(Номенклатура, Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	МАКСИМУМ(ПоступлениеТоваровУслугДополнительныеРеквизиты.Значение) КАК Значение
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ДополнительныеРеквизиты КАК ПоступлениеТоваровУслугДополнительныеРеквизиты
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугДополнительныеРеквизиты.Ссылка
	|			И (ПоступлениеТоваровУслугДополнительныеРеквизиты.Свойство.Наименование = ""Номер вет свидетельства"")
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.Проведен)
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	СтруктураДат = Новый Структура("НомерВетСвидетельства");
	ВыборкаДетальныеЗаписи.Следующий();
	
	ОбъектДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	Для каждого ТекСтр Из ОбъектДокумент.ДополнительныеРеквизиты Цикл
		Если ТекСтр.Свойство.Наименование = "Номер вет свидетельства" Тогда
			СтруктураДат.НомерВетСвидетельства = ТекСтр.Значение;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат СтруктураДат;
КонецФункции

Функция НайтиДокументыПоступленияПоНоменклатуре(СписокНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Сертификат КАК НомерВетСвидетельства,
	|	ПоступлениеТоваровУслугТовары.НомерПаспорта КАК ДатаВыработки,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата,
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|		И НЕ ПоступлениеТоваровУслугТовары.НомерПаспорта = """"
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугТовары.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВложенныйЗапрос.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ВложенныйЗапрос.Дата = ПоступлениеТоваровУслугТовары.Ссылка.Дата
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция НайтиДокументПоступления(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслугТовары.Сертификат КАК НомерВетСвидетельства,
	|	ПоступлениеТоваровУслугТовары.НомерПаспорта КАК ДатаВыработки
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|	И НЕ ПоступлениеТоваровУслугТовары.НомерПаспорта = """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -6));
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//СтруктураДат = Новый Структура("ДатаВыработкиС, ДатаВыработкиПо, НомерВетСвидетельства");
	СтруктураДат = Новый Структура("ДатаВыработки, НомерВетСвидетельства");
	ВыборкаДетальныеЗаписи.Следующий();
	СтруктураДат.ДатаВыработки = ВыборкаДетальныеЗаписи.ДатаВыработки;
	СтруктураДат.НомерВетСвидетельства = ВыборкаДетальныеЗаписи.НомерВетСвидетельства;
	
	//ОбъектДокумент = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
	//Для каждого ТекСтр Из ОбъектДокумент.ДополнительныеРеквизиты Цикл
	//	Если ТекСтр.Свойство.Наименование = "ДатаВыработкиС" Тогда
	//		СтруктураДат.ДатаВыработкиС = Формат(ТекСтр.Значение, "ДФ=dd.MM.yy");
	//	ИначеЕсли ТекСтр.Свойство.Наименование = "ДатаВыработкиПо" Тогда
	//		СтруктураДат.ДатаВыработкиПо = Формат(ТекСтр.Значение, "ДФ=dd.MM.yy");
	//	ИначеЕсли ТекСтр.Свойство.Наименование = "Номер вет свидетельства" Тогда
	//		СтруктураДат.НомерВетСвидетельства = ТекСтр.Значение;
	//	КонецЕсли; 
	//КонецЦикла; 
	
	Возврат СтруктураДат;
	
	//Старый вариант
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	//|	МАКСИМУМ(ПоступлениеТоваровУслугДополнительныеРеквизиты.Значение) КАК Значение
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ДополнительныеРеквизиты КАК ПоступлениеТоваровУслугДополнительныеРеквизиты
	//|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ПоступлениеТоваровУслугДополнительныеРеквизиты.Ссылка
	//|			И (ПоступлениеТоваровУслугДополнительныеРеквизиты.Свойство.Наименование = ""ДатаВыработкиС"")
	//|			И (ПоступлениеТоваровУслугТовары.Ссылка.Проведен)
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугТовары.Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Ссылка УБЫВ
	//|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

Функция ПолучитьФиксПоставщика(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""НаименованиеПоставщикаДляВетСправки""";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
		|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Основной произВодитель""";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Значение;
	
КонецФункции

Функция ПолучитьАдресаМагазинов(МассивОбъектов)
	МассивСкладов = Новый Массив;
	
	Для каждого ТекСтр Из МассивОбъектов Цикл
		Если ТипЗнч(ТекСтр) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(ТекСтр) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ТекущийМагазин = ТекСтр.СкладПолучатель;
		Иначе
			ТекущийМагазин = НайтиСкладКонтрагента(ТекСтр.Контрагент);
		КонецЕсли; 
		
		МассивСкладов.Добавить(ТекущийМагазин);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыКонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Ссылка В(&Ссылка)
	|	И СкладыКонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Ссылка", МассивСкладов);
	Запрос.УстановитьПараметр("вид", справочники.ВидыКонтактнойИнформации.АдресСклада);
	
	ВыборкаАдресов = Запрос.Выполнить().Выгрузить();
	
	СтрокаАдресов = "";
	Для каждого ТекСтр Из ВыборкаАдресов Цикл
		
		СтрокаАдресов = СтрокаАдресов + ТекСтр.Представление + ", ";
		
	КонецЦикла; 
	
	Возврат СтрокаАдресов;
	
КонецФункции

Функция НайтиСкладКонтрагентаНов(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|ГДЕ
	|	СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Контрагент склада""
	|	И СкладыДополнительныеРеквизиты.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Контрагент);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
КонецФункции 

Функция ПолучитьТаблицуДатВыработки(ТаблицаНоменклатурИДатВыработки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ВходящиеДанные.Номенклатура,
	|	ВТ_ВходящиеДанные.ДатаВыпуска,
	|	ВТ_ВходящиеДанные.НомерПартии
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	&ВТ_ВходящиеДанные КАК ВТ_ВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_1.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.НомерПаспорта = """"
	|			ТОГДА ВТ_1.ДатаВыпуска
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.НомерПаспорта
	|	КОНЕЦ КАК ДатаВыработки,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Сертификат) КАК НомерВетСвидетельства,
	|	ПоступлениеТоваровУслугДатыВыпуска.НомерПартии,
	|	ПоступлениеТоваровУслугДатыВыпуска.Ссылка.Контрагент
	|ИЗ
	|	ВТ_1 КАК ВТ_1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ДатыВыпуска КАК ПоступлениеТоваровУслугДатыВыпуска
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ПО ПоступлениеТоваровУслугДатыВыпуска.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|				И ПоступлениеТоваровУслугДатыВыпуска.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|		ПО ВТ_1.Номенклатура = ПоступлениеТоваровУслугДатыВыпуска.Номенклатура
	|			И ВТ_1.ДатаВыпуска = ПоступлениеТоваровУслугДатыВыпуска.ДатаВыпуска
	|			И ВТ_1.НомерПартии = ПоступлениеТоваровУслугДатыВыпуска.НомерПартии
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_1.Номенклатура,
	|	ПоступлениеТоваровУслугДатыВыпуска.НомерПартии,
	|	ПоступлениеТоваровУслугДатыВыпуска.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.НомерПаспорта = """"
	|			ТОГДА ВТ_1.ДатаВыпуска
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.НомерПаспорта
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ВТ_ВходящиеДанные", ТаблицаНоменклатурИДатВыработки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

Функция ПолучитьАдресСклада(МассивОбъектов)
	ТаблицаСкладов = Новый ТаблицаЗначений;
	ТаблицаСкладов.Колонки.Добавить("Склад");
	
	Для каждого ТекСтр Из МассивОбъектов Цикл
		Если ТипЗнч(ТекСтр) = Тип("ДокументСсылка.ЗаказНаПеремещение") ИЛИ ТипЗнч(ТекСтр) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ТекущийМагазин = ТекСтр.СкладОтправитель;
		Иначе
			ТекущийМагазин = ТекСтр.Склад;
		КонецЕсли; 
		
		НоваяСтрока = ТаблицаСкладов.Добавить();
		НоваяСтрока.Склад = ТекущийМагазин;
	КонецЦикла; 
	
	ТаблицаСкладов.Свернуть("Склад");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладыКонтактнаяИнформация.Представление
	|ИЗ
	|	Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|ГДЕ
	|	СкладыКонтактнаяИнформация.Ссылка В(&Ссылка)
	|	И СкладыКонтактнаяИнформация.Вид = &Вид
	|
	|СГРУППИРОВАТЬ ПО
	|	СкладыКонтактнаяИнформация.Представление";
	
	Запрос.УстановитьПараметр("Ссылка", ТаблицаСкладов.ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("вид", справочники.ВидыКонтактнойИнформации.АдресСклада);
	
	ВыборкаАдресов = Запрос.Выполнить().Выгрузить();
	
	СтрокаАдресов = "";
	Для каждого ТекСтр Из ВыборкаАдресов Цикл
		
		СтрокаАдресов = СтрокаАдресов + ТекСтр.Представление + ", ";
		
	КонецЦикла; 
	
	Возврат СтрокаАдресов;
	
КонецФункции

Процедура ОтправитьФайлПоПочте(ТекстСообщения)
	
	Профиль 	= Новый ИнтернетПочтовыйПрофиль();
	Почта 		= Новый ИнтернетПочта();
	Сообщение 	= Новый ИнтернетПочтовоеСообщение();
	
	Профиль.АдресСервераSMTP = "tsk-mailsrv.kdvm.ru";	
	
	Сообщение.Отправитель.Адрес = "1cretail@kdvm.ru";
	Сообщение.Получатели.Добавить("m.bedrin@nsk.kdvm.ru");
	Сообщение.Получатели.Добавить("vetvrach1@nsk.kdvm.ru");
	Сообщение.Тема = "Не найдена дата выпуска для вет врачей";
	Сообщение.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);	
	
	Попытка
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Почта.Отключиться();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПоставщикаИзПоступления(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Объект = &Объект
	|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", Номенклатура);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ПечатьПроизводителяИзПоступления"));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Значение;
КонецФункции 
//**************************************************************************************

&НаСервере
Функция ПолучитьТаблицуДатВыработкиСтар(ТаблицаНоменклатурИДатВыработки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_ВходящиеДанные.Номенклатура,
	|	ВТ_ВходящиеДанные.ДатаВыпуска
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	&ВТ_ВходящиеДанные КАК ВТ_ВходящиеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_1.Номенклатура,
	|	ВТ_1.ДатаВыпуска КАК ДатаВыработки,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Сертификат) КАК НомерВетСвидетельства
	|ИЗ
	|	ВТ_1 КАК ВТ_1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ДатыВыпуска КАК ПоступлениеТоваровУслугДатыВыпуска
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ПО ПоступлениеТоваровУслугДатыВыпуска.Ссылка = ПоступлениеТоваровУслугТовары.Ссылка
	|				И ПоступлениеТоваровУслугДатыВыпуска.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|		ПО ВТ_1.Номенклатура = ПоступлениеТоваровУслугДатыВыпуска.Номенклатура
	|			И ВТ_1.ДатаВыпуска = ПоступлениеТоваровУслугДатыВыпуска.ДатаВыпуска
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_1.Номенклатура,
	|	ВТ_1.ДатаВыпуска";
	
	Запрос.УстановитьПараметр("ВТ_ВходящиеДанные", ТаблицаНоменклатурИДатВыработки);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

&НаСервере
Функция НайтиДокументыПоступленияПоНоменклатуреСтар(СписокНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата,
	|	ВложенныйЗапрос.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Сертификат КАК НомерВетСвидетельства,
	|	ПоступлениеТоваровУслугТовары.НомерПаспорта КАК ДатаВыработки
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата,
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|		И НЕ ПоступлениеТоваровУслугТовары.НомерПаспорта = """"
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугТовары.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВложенныйЗапрос.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ВложенныйЗапрос.Дата = ПоступлениеТоваровУслугТовары.Ссылка.Дата
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура В(&Номенклатура)
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Номенклатура", СписокНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ПолучитьФиксПоставщикаСтар(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Значение
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""НаименованиеПоставщикаДляВетСправки""";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
		|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Основной произВодитель""";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Значение;
	
КонецФункции

//конец печать приложение вв

///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАБОТЫ СО ШК

&НаСервере
Функция ПодключитьВнешнююКомпонентуПечатиШтрихкодаСтарая() Экспорт
	
	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
	ПодключениеВыполнено = Неопределено;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	Иначе
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
	КонецЕсли;
	
	// Создадим объект внешней компоненты
	Если ПодключениеВыполнено Тогда
		ВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкода.Barcode");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Возврат Неопределено;
	Иначе
		
		// Установим основные параметры компоненты
		
		// Если в системе установлен шрифт Tahoma
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт Для формирования картинки
			ВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом Для формирования штри-кода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Утановим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 12;
		
		Возврат ВнешняяКомпонента;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПодключитьВнешнююКомпонентуПечатиШтрихкодаСтарая26052025() Экспорт
	
	ВнешняяКомпонента = Неопределено;
	
	Если ИмяВнешнейКомпонентыПечати <> "" Тогда
		Попытка
			ВнешняяКомпонента = Новый("AddIn."+ИмяВнешнейКомпонентыПечати+".Barcode");
			Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
			    ВнешняяКомпонента = Неопределено;
			КонецЕсли;				
		Исключение
			ВнешняяКомпонента = Неопределено;
		КонецПопытки;	
	КонецЕсли;
	
	Если ВнешняяКомпонента = Неопределено Тогда
	
		ИмяВнешнейКомпонентыПечати = "A" + СтрЗаменить(Строка(Новый УникальныйИдентификатор()), "-", "");
		
		// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
		ПодключениеВыполнено = Неопределено;
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
			ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows32", ИмяВнешнейКомпонентыПечати, ТипВнешнейКомпоненты.Native);
		ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
			ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows64", ИмяВнешнейКомпонентыПечати, ТипВнешнейКомпоненты.Native);
		ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
			ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux32", ИмяВнешнейКомпонентыПечати, ТипВнешнейКомпоненты.Native);
		Иначе
			ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux64", ИмяВнешнейКомпонентыПечати, ТипВнешнейКомпоненты.Native);
		КонецЕсли;
		
		// Создадим объект внешней компоненты
		Если ПодключениеВыполнено Тогда
			ВнешняяКомпонента = Новый("AddIn."+ИмяВнешнейКомпонентыПечати+".Barcode");
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	
	КонецЕсли;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Возврат Неопределено;
	Иначе
		
		// Установим основные параметры компоненты
		
		// Если в системе установлен шрифт Tahoma
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт Для формирования картинки
			ВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом Для формирования штри-кода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Утановим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 12;
		
		Возврат ВнешняяКомпонента;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВнешнююКомпонентуПечатиШтрихкода()
	
	Если ЗначениеЗаполнено(КомпонентаШК) тогда
		Попытка
			СтруктураКомпоненты	 = ПолучитьИзВременногоХранилища(КомпонентаШК);
			Если ТипЗнч(СтруктураКомпоненты.Объект) = Тип("AddIn.BarcodeSymbolicName.Barcode") тогда			
				BarCodeGenerator = СтруктураКомпоненты.Объект; 
			Иначе
				BarCodeGenerator = ПодключитьВнешнююКомпонентуПечатиШтрихкода();	
			КонецЕсли;	
		Исключение
			BarCodeGenerator = ПодключитьВнешнююКомпонентуПечатиШтрихкода();
		КонецПопытки;	
	Иначе
		
		BarCodeGenerator = ПодключитьВнешнююКомпонентуПечатиШтрихкода();
				
	КонецЕсли;
	
	Возврат BarCodeGenerator;
	
КонецФункции


Функция ПодключитьВнешнююКомпонентуПечатиШтрихкода() Экспорт 
	//ЗаписьЖурналаРегистрации("АРМ оператора отгрузки. Подключение компоненты ШК", УровеньЖурналаРегистрации.Информация,,, "Начало подключения компоненты" + " " + ПараметрыСеанса.ТекущийПользователь);
	
	ТекстОшибки = НСтр("ru = 'Не удалось подключить внешнюю компоненту для генерации ШК. Подробности в журнале регистрации.'");
	
	BarCodeGenerator = Неопределено;
	
	ИмяВнешнейКомпонентыПечати = "BarcodeSymbolicName"; 
	
	КомпонентаПодключена = Ложь;
	
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодов", ИмяВнешнейКомпонентыПечати,ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.НеИзолированно);
	
	Если не КомпонентаПодключена тогда
		КомпонентаПодключена = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаПечатиШтрихкодов", ИмяВнешнейКомпонентыПечати,ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.Изолированно);
	КонецЕсли;
	
	Если КомпонентаПодключена тогда
		Попытка
			BarCodeGenerator = Новый("AddIn." + ИмяВнешнейКомпонентыПечати + ".Barcode");
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаПодключенияКомпонентыШК", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось создать объект внешней компоненты" + Символы.ПС + "AddIn." + ИмяВнешнейКомпонентыПечати + ".BarCodeGenerator" + Символы.ПС + "ИмяВнешнейКомпонентыПечати: " + ИмяВнешнейКомпонентыПечати);
			BarCodeGenerator = Неопределено
		КонецПопытки;	
	Иначе
		ЗаписьЖурналаРегистрации("ОшибкаПодключенияКомпонентыШК", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка подключения внешней компоненты" + Символы.ПС + "ОбщийМакет.КомпонентаПечатиШтрихкодов" + Символы.ПС + "ИмяВнешнейКомпонентыПечати: " + ИмяВнешнейКомпонентыПечати);
	КонецЕсли;
	
	Если BarCodeGenerator = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли; 
	
	СтруктураКомпоненты = Новый Структура("Объект",BarCodeGenerator);
	
	КомпонентаШК = ПоместитьВоВременноеХранилище(СтруктураКомпоненты, новый УникальныйИдентификатор);
	
	Возврат BarCodeGenerator;
	
	
КонецФункции	

&НаСервере
Функция СоздатьШтрихкодНакладной(МассивДокументов)
	
	Попытка
		НачатьТранзакцию();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Объект", МассивДокументов);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ДополнительныеСведения.Значение КАК Значение
		|ИЗ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа""
		|	И ДополнительныеСведения.Объект В(&Объект)
		|СГРУППИРОВАТЬ ПО
		|	ДополнительныеСведения.Значение";
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(150)), 1, 11) КАК Значение
			|ИЗ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
			|ГДЕ ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа""
			|
			|ДЛЯ ИЗМЕНЕНИЯ РегистрСведений.ДополнительныеСведения
			|
			|УПОРЯДОЧИТЬ ПО
			|	Значение УБЫВ
			|АВТОУПОРЯДОЧИВАНИЕ";
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				Возврат "0"; 
			КонецЕсли; 
			ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
			ПоследнийНомерМаршрута = ТаблицаДетальныеЗаписи[0].Значение;
			
			//ПоследнийШтрихкод = Формат(Число(ПолучитьПоследнийШтрихкодПоСвойству()) +1, "ЧЦ=11; ЧВН=; ЧГ=0") + "+" + Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm'") + "+" + 46;
			ПоследнийШтрихкод = Формат(Число(ПоследнийНомерМаршрута) +1, "ЧЦ=11; ЧВН=; ЧГ=0") + "+" + Формат(ТекущаяДата(), "ДФ='dd.MM.yyyy HH:mm'") + "+" + 46;
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Возврат Выборка.Значение;//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Выборка.Значение);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			Возврат Неопределено;
		КонецЕсли; 
		
		СвойствоШКДокумента = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Штрихкод документа");
		Для Каждого ТекДок Из МассивДокументов Цикл
			//Если уже записан так же штрихкод, не записывать
			НаборЗаписейДопСв = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
			НаборЗаписейДопСв.Объект = ТекДок;
			НаборЗаписейДопСв.Свойство = СвойствоШКДокумента;
			НаборЗаписейДопСв.Значение = ПоследнийШтрихкод;
			НаборЗаписейДопСв.Записать(Истина);
			ЗаписьЖурналаРегистрации("Создание штрихкода документа", УровеньЖурналаРегистрации.Информация,, ТекДок, "ШтрихКод: " + ПоследнийШтрихкод + " " + "Создал: " + Строка(ПараметрыСеанса.ТекущийПользователь));
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	Возврат ПоследнийШтрихкод;
	
КонецФункции

Функция СоздатьШтрихкодНакладнойПоНомеруЗНО(МассивДокументов, НомерЗНО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДополнительныеСведения.Значение, """") КАК ШК,
	|	ПеремещениеТоваров.Ссылка
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО (ПеремещениеТоваров.Ссылка = (ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Документ.ПеремещениеТоваров)))
	|			И (ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа"")
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|	И НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА), """") ПОДОБНО &НомерЗНО";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("НомерЗНО", НомерЗНО);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Штрихкод = НомерЗНО;
	//+БАА убрать транзакцию от дедлоков
	//НачатьТранзакцию();
	СвойствоШКДокумента = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Штрихкод документа");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Если уже записан так же штрихкод, не записывать
		НаборЗаписейДопСв = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		НаборЗаписейДопСв.Объект = ВыборкаДетальныеЗаписи.Ссылка;
		НаборЗаписейДопСв.Свойство = СвойствоШКДокумента;
		НаборЗаписейДопСв.Значение = Штрихкод;
		Попытка
			НаборЗаписейДопСв.Записать(Истина);
		Исключение
		//	ОтменитьТранзакцию();
		КонецПопытки;
		ЗаписьЖурналаРегистрации("Создание штрихкода документа", УровеньЖурналаРегистрации.Информация,, ВыборкаДетальныеЗаписи.Ссылка, "ШтрихКод: " + Штрихкод + " " + "Создал: " + Строка(ПараметрыСеанса.ТекущийПользователь));
	КонецЦикла;
	
	//ЗафиксироватьТранзакцию();
	
	Возврат Штрихкод;
	
КонецФункции


&НаСервере
Функция НайтиШтрихкодДокументов(МассивДокументов)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДополнительныеСведения.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа""
	|	И ДополнительныеСведения.Объект В(&Объект)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДополнительныеСведения.Значение
	|
	|//ДЛЯ ИЗМЕНЕНИЯ РегистрСведений.ДополнительныеСведения
	|";
	
	Запрос.УстановитьПараметр("Объект", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Значение");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШтрихКодОбласть(Область, ЗначениеШтрихкода)
	
	ВнешняяКомпонента = ПолучитьВнешнююКомпонентуПечатиШтрихкода();
	
	Для Каждого Рисунок Из Область.Рисунки Цикл
		Если ВРЕГ(Лев(Рисунок.Имя,8)) = "ШТРИХКОД" Тогда
			
			Если ВнешняяКомпонента = Неопределено Тогда
				ВызватьИсключение НСтр("ru = 'Ошибка подключения внешней компоненты печати штрихкода!'");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда
				
				ПараметрыШтрихкода = Новый Структура;
				ПараметрыШтрихкода.Вставить("Ширина",          Рисунок.Ширина);
				ПараметрыШтрихкода.Вставить("Высота",          Рисунок.Высота);
				ПараметрыШтрихкода.Вставить("Штрихкод",        ЗначениеШтрихкода);
				ПараметрыШтрихкода.Вставить("ТипКода",         4); //3 = Code39, 4 = Code128
				ПараметрыШтрихкода.Вставить("ОтображатьТекст", Ложь);
				ПараметрыШтрихкода.Вставить("РазмерШрифта",    6);
				
				Рисунок.Картинка = ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере           
Функция ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода) Экспорт
	
	// Зададим размер картинки
	ВнешняяКомпонента.Ширина = Окр(ПараметрыШтрихкода.Ширина);
	ВнешняяКомпонента.Высота = Окр(ПараметрыШтрихкода.Высота);
	
	// Разрешим компоненте самой определять тип кода
	ВнешняяКомпонента.АвтоТип = Ложь;
	ВнешняяКомпонента.ТипКода         = ПараметрыШтрихкода.ТипКода;
	ВнешняяКомпонента.ОтображатьТекст = ПараметрыШтрихкода.ОтображатьТекст;
	ВнешняяКомпонента.РазмерШрифта    = ПараметрыШтрихкода.РазмерШрифта;
	
	// Или установим код EAN-13
	// ВнешняяКомпонента.ТипКода = 1;
	//
	// Тип смотрим в документации на внешнуюю компоненту
	
	// Если код содержит контрольный символ, обязательно указываем
	ВнешняяКомпонента.СодержитКС = СтрДлина(ПараметрыШтрихкода.Штрихкод) = 13;
	
	// Если отображать контрольный символ не нужно
	// ВнешняяКомпонента.ВидимостьКС = Ложь;
	
	// Формируем картинку штрихкода
	ВнешняяКомпонента.ЗначениеКода = ПараметрыШтрихкода.Штрихкод;
	
	// Если установленная нами ширина меньше минимально допустимой Для этого штрихкода
	Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		// Скорректируем ширину
		ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода + 10;
	КонецЕсли;
	
	// Сформируем картинку
	Попытка
		ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
	Исключение
		ДвоичныеДанныеКартинки = Неопределено;
	КонецПопытки;
	
	// Если картинка сформировалась
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьИнформациюОМагазине(Склад)
	
	СтруктураОтвет = Новый Структура("РежимРаботыГрузчиков, ТипРазгрузки", Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладыДополнительныеРеквизиты.Значение,
	|	СкладыДополнительныеРеквизиты.Свойство,
	|	СкладыДополнительныеРеквизиты.Свойство.Наименование КАК СвойствоНаименование
	|ИЗ
	|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	|ГДЕ
	|	(СкладыДополнительныеРеквизиты.Свойство.Наименование = ""РежимРаботыГрузчиков""
	|			ИЛИ СкладыДополнительныеРеквизиты.Свойство.Наименование = ""ТипРазгрузки"")
	|	И СкладыДополнительныеРеквизиты.Ссылка = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СвойствоНаименование = "РежимРаботыГрузчиков" Тогда
			СтруктураОтвет.РежимРаботыГрузчиков = ВыборкаДетальныеЗаписи.Значение;
		Иначе
			СтруктураОтвет.ТипРазгрузки = ВыборкаДетальныеЗаписи.Значение;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат СтруктураОтвет;
КонецФункции 

Процедура ОбновитьЗНО()
	
	ТабРеестров = РеквизитФормыВЗначение("ЗНО");
	МассивЗНО = ТабРеестров.Строки.ВыгрузитьКолонку("ЗНО");
	Если МассивЗНО.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ЛогистикаСервер.ОбновитьСтатусыЗаказовНаОтгрузку(МассивЗНО);
	Исключение
	КонецПопытки;
	//Для каждого ТекСтр Из МассивЗНО Цикл
	//	ДокОбъект = ТекСтр.ПолучитьОбъект();
	//	Записывать = Ложь;
	//	ДокОбъект.ОбновитьСписокДокументовНаСервереВМодуле(Записывать);
	//	Если Записывать Тогда
	//		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	//	КонецЕсли;
	//КонецЦикла; 
	
КонецПроцедуры

//+Буганов
&НаКлиенте
Процедура ЗНОПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЗНО.ТекущиеДанные;
	ЭтоВерхнийУровень = ТипЗнч(ТекущиеДанные.ЗНО) = Тип("ДокументСсылка.ЗаказНаОтгрузку");
	
	//Если Не ТекущиеДанные.пАх Или Не ТекущиеДанные.п1С Тогда
	Если Не ТекущиеДанные.п1С И Не ЭтоВерхнийУровень И ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не завершился процесс погрузки!",, "ЗНО[0].Пометка");
		ТекущиеДанные.Пометка = 0;
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоВерхнийУровень И ТекущиеДанные.Пометка = 2 Тогда 
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	//ТекущиеДанные.Пометка = ?(ТекущиеДанные.Пометка = 1 Или ТекущиеДанные.Пометка = 2, ТекущиеДанные.Пометка = 0, ТекущиеДанные.Пометка = 1);
	
	Попытка
		ЕстьЗаполненные = Ложь;
		ТекущиеДанные.ПолучитьРодителя().Пометка = 1;
		Для Каждого ЭлементДерева Из ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы() Цикл
			Если ЭлементДерева.Пометка = 0 Тогда 
				ТекущиеДанные.ПолучитьРодителя().Пометка = 2;
			ИначеЕсли ЭлементДерева.Пометка = 1 Тогда 
				ЕстьЗаполненные = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ТекущиеДанные.ПолучитьРодителя().Пометка = 2 И Не ЕстьЗаполненные Тогда
			ТекущиеДанные.ПолучитьРодителя().Пометка = 0;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	ИгнорироватьПометку1С = Элементы.ЗНОКомандаИгнорироватьПометку1С.Пометка;
	ЕстьЗаполненные = Ложь;
	Для Каждого ЭлементДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
		// 2025.06.23 v.nagaycev@kdvm.ru попросили убрать проверку пометки 1С, добавил команду
		Если ЭлементДерева.пАх и (ЭлементДерева.п1С Или ИгнорироватьПометку1С) Тогда 
			Если ЭтоВерхнийУровень И ТекущиеДанные.Пометка = 2 Тогда 
				ЭлементДерева.Пометка = 0;
			Иначе
				ЕстьЗаполненные = Истина;
				ЭлементДерева.Пометка = Элементы.ЗНО.ТекущиеДанные.Пометка;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ЭтоВерхнийУровень И Не ЕстьЗаполненные Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//Если Не ПринтерПоУмолчанию = "" Тогда 
	//	СохранитьНастройкиПечатиПоУмолчанию();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринтерПоУмолчаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаНастройкиСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Элементы.ГруппаФормирования.Видимость = Не ТекущаяСтраница.Имя = "ГруппаНастройкиПечать";
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьНастройки(Команда)
	ВидимостьНастроек = Не ВидимостьНастроек;
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура КомандаИгнорироватьПометку1С(Команда)
	
	Элементы.ЗНОКомандаИгнорироватьПометку1С.Пометка = Не Элементы.ЗНОКомандаИгнорироватьПометку1С.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	
	Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Пометка = ВидимостьНастроек;
	Элементы.ТаблицаКомплектация.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаКомплектацияКомандаПоказатьНастройки.Пометка = ВидимостьНастроек;	
	
	Если ВидимостьНастроек Тогда
		Элементы.ГруппаНастройки.Видимость = Истина;
		Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Заголовок = "Скрыть настройки";
		Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Картинка  = БиблиотекаКартинок.ПерейтиНаСледующийЭтапСделки;
		Элементы.ТаблицаКомплектация.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаКомплектацияКомандаПоказатьНастройки.Заголовок = "Скрыть настройки";
		Элементы.ТаблицаКомплектация.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаКомплектацияКомандаПоказатьНастройки.Картинка  = БиблиотекаКартинок.ПерейтиНаСледующийЭтапСделки;
	Иначе
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Заголовок = "Показать настройки";
		Элементы.ЗНО.КоманднаяПанель.ПодчиненныеЭлементы.ЗНОКомандаПоказатьНастройки.Картинка  = БиблиотекаКартинок.ПерейтиНаПредыдущийЭтапСделки;
		Элементы.ТаблицаКомплектация.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаКомплектацияКомандаПоказатьНастройки.Заголовок = "Показать настройки";
		Элементы.ТаблицаКомплектация.КоманднаяПанель.ПодчиненныеЭлементы.ТаблицаКомплектацияКомандаПоказатьНастройки.Картинка  = БиблиотекаКартинок.ПерейтиНаПредыдущийЭтапСделки;		
	КонецЕсли;
	
	Отладка = Ложь;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		Элементы.ГруппаРО.Видимость				   = Истина;
		Элементы.ГруппаОтборКомплектация.Видимость = Не Элементы.ГруппаРО.Видимость;
		Элементы.ГруппаПФ.Видимость				   = Элементы.ГруппаРО.Видимость;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		Элементы.ГруппаРО.Видимость				   = Ложь;
		Элементы.ГруппаОтборКомплектация.Видимость = Не Элементы.ГруппаРО.Видимость;
		Элементы.ГруппаПФ.Видимость				   = Элементы.ГруппаРО.Видимость;
	КонецЕсли;
	
	Элементы.НастройкаПечати.КоманднаяПанель.ПодчиненныеЭлементы.НастройкаПечатиНеПечататьЛистКомплектацииДляWMS.Пометка = НеПечататьЛистКомплектацииДляWMS;
КонецПроцедуры


&НаКлиенте
Процедура ЗНООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ЗНОВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗНОАвтомобиль" Тогда 
		ОткрытьЗначение(Элементы.Зно.ТекущиеДанные.Автомобиль);
	ИначеЕсли Поле.Имя = "ЗНОЗНО" Тогда 
		ОткрытьЗначение(Элементы.Зно.ТекущиеДанные.ЗНО);
	ИначеЕсли Поле.Имя = "ЗНОВодитель" Тогда 
		ОткрытьЗначение(Элементы.Зно.ТекущиеДанные.Водитель);
	ИначеЕсли Поле.Имя = "ЗНОВодитель2" Тогда 
		ОткрытьЗначение(Элементы.Зно.ТекущиеДанные.Водитель2);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗНОПриАктивизацииЯчейки(Элемент)
КонецПроцедуры


&НаКлиенте
Процедура РеестрМаршрутов(Команда)
	ТабДокумент = СформироватьПечатнуюФормуРеестраМаршрутныхЛистов();
	ТабДокумент.Показать();// Вставить содержимое обработчика.
КонецПроцедуры

Функция СформироватьПечатнуюФормуРеестраМаршрутныхЛистов()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("РеестрМаршрутныхЛистов");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РеестрМаршрутныхЛистов";
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 2;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Автомобили        = ЗНО;
	СтрокиАвтомобилей = Автомобили.ПолучитьЭлементы();
	Для Каждого Запись из СтрокиАвтомобилей цикл
		// Посчитаем вес для Записи+
		СтрокиМаршрута = Запись.ПолучитьЭлементы();
		вес = 0;
		Объем = 0;
		Для каждого СтрЗаказ из СтрокиМаршрута цикл
			ОтборВес = Новый Структура();
			ОтборВес.Вставить("Заказ",СтрЗаказ.Зно);
			
			НайденнаяСтрока = Запись.ЗНО.ДокументОснование.ЗаказыНаОтгрузку.НайтиСтроки(ОтборВес)[0];  
			Если не НайденнаяСтрока = неопределено тогда
			//ВесОбъем =ПолучитьВесИОбъемТоваровВУпаковкеWMSПоДокументуТЕСТ(СтрЗаказ.ЗНО);
				Объем =Объем+ НайденнаяСтрока.Объем;
				Вес = Вес+НайденнаяСтрока.Вес;
			КонецЕсли;
			
		КонецЦикла;
					//-
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("СкладОтправитель");
		ТЗ.Колонки.Добавить("СкладПолучатель");
		
		СтрокиДокументов = Запись.ПолучитьЭлементы();
		для каждого ТекДок из СтрокиДокументов цикл
			Если ТипЗнч(ТекДок.ЗНО) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
				ИскомыйСклад = ТЗ.НайтиСтроки(Новый Структура("СкладОтправитель, СкладПолучатель", ТекДок.ЗНО.СкладОтправитель, ТекДок.ЗНО.СкладПолучатель));
				Если ИскомыйСклад.Количество() = 0 Тогда
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.СкладОтправитель = ТекДок.ЗНО.СкладОтправитель;
					НоваяСтрока.СкладПолучатель = ТекДок.ЗНО.СкладПолучатель;
				КонецЕсли; 
			Иначе
				ИскомыйСклад = ТЗ.НайтиСтроки(Новый Структура("СкладОтправитель, СкладПолучатель", ТекДок.ЗНО.Склад, ТекДок.ЗНО.Контрагент));
				Если ИскомыйСклад.Количество() = 0 Тогда
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.СкладОтправитель = ТекДок.ЗНО.Склад;
					НоваяСтрока.СкладПолучатель = ТекДок.ЗНО.Контрагент;
				КонецЕсли; 
			КонецЕсли; 
		КонецЦикла;
		
		ТЗ.Сортировать("СкладОтправитель");
		ТЗ.Свернуть("СкладОтправитель, СкладПолучатель");
		СтрокаСкладМагазин = ""; СкладОтправительПред = "";
		Для каждого ТекСтрСклад Из ТЗ Цикл
			Если ПустаяСтрока(СкладОтправительПред) ИЛИ НЕ ТекСтрСклад.СкладОтправитель = СкладОтправительПред Тогда
				Если ПустаяСтрока(СкладОтправительПред) Тогда
					СтрокаСкладМагазин = СтрокаСкладМагазин + ТекСтрСклад.СкладОтправитель + " (";	
				Иначе
					СтрокаСкладМагазин = СтрокаСкладМагазин + "), " + Символы.ПС + ТекСтрСклад.СкладОтправитель + " (";	
				КонецЕсли; 
				СкладОтправительПред = ТекСтрСклад.СкладОтправитель;
			КонецЕсли; 
			СтрокаСкладМагазин = СтрокаСкладМагазин + ТекСтрСклад.СкладПолучатель + ", ";
		КонецЦикла; 
		ОбластьМакета.Параметры.СкладМагазин = СтрокаСкладМагазин + ")";
			//ОбластьМакета.Параметры.Водитель = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Запись.Водитель);
		ОбластьМакета.Параметры.Водитель1 = Запись.Водитель;
		Если НЕ ПустаяСтрока(Запись.Водитель) Тогда
			Телефон1 = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Запись.Водитель, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
			ОбластьМакета.Параметры.Водитель1 = Строка(ОбластьМакета.Параметры.Водитель1) + ?(Не Телефон1 = "", " / " + Телефон1, "");
		Иначе
			//ОбластьМакета.Параметры.Водитель = "";
		КонецЕсли; 
		
		ОбластьМакета.Параметры.Водитель2 = Запись.Водитель2;
		Если НЕ ПустаяСтрока(Запись.Водитель2) Тогда
			Телефон2 = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Запись.Водитель2, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
			ОбластьМакета.Параметры.Водитель2 = Строка(ОбластьМакета.Параметры.Водитель2) + ?(Не Телефон2 = "", " / " + Телефон2, "");
		Иначе
			//ОбластьМакета.Параметры.Водитель2 = "";
		КонецЕсли; 
		
		ОбластьМакета.Параметры.ТС = Строка(Запись.Автомобиль);
		ОбластьМакета.Параметры.Контрагент = Строка(Запись.Перевозчик);
		
		ОбластьМакета.Параметры.Экспедитор = Строка(Запись.Экспедитор);

		ОбластьМакета.Параметры.КоличествоПалет = Запись.КоличествоПалет;
		ОбластьМакета.Параметры.ВремяВыезда = Запись.ДатаВыезда;
		ОбластьМакета.Параметры.ДатаПечати = Формат(Запись.ДатаВыезда, "ДФ=dd.MM.yyyy");
		
		ОбластьМакета.Параметры.ВесОбъем = Строка(Окр(Вес,2))+"/"+Символы.ПС+ Строка(Окр(Объем,2));
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // СформироватьПечатнуюФормуРеестраМаршрутныхЛистов()


&НаКлиенте
Процедура УдалитьШК(Команда)
	
	ТекДан = Элементы.ЗНО.ТекущиеДанные;
	Если ТипЗнч(ТекДан.Автомобиль) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Для Каждого Стр Из ТекДан.ПолучитьЭлементы() Цикл
			Если ЗначениеЗаполнено(Стр.Автомобиль) Тогда
				УдалитьШКНаСервере(Стр.Автомобиль);
			КонецЕсли;
		КонецЦикла;
	Иначе
		УдалитьШКНаСервере(ТекДан.Автомобиль);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьШКНаСервере(Перемещение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО Документ.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа"")
	|ГДЕ
	|	Документ.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство,
	|	ДополнительныеСведения.Значение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Документ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО Документ.Ссылка = ДополнительныеСведения.Объект
	|			И (ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа"")
	|ГДЕ
	|	Документ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Перемещение);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		РС          = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		РС.Объект   = ВыборкаДетальныеЗаписи.Объект;
		РС.Свойство = ВыборкаДетальныеЗаписи.Свойство;
		ШК          = ВыборкаДетальныеЗаписи.Значение;
		РС.Значение = Неопределено;
		Попытка
			ЗаписьЖурналаРегистрации("Создание штрихкода документа", УровеньЖурналаРегистрации.Информация,, ВыборкаДетальныеЗаписи.Объект, "ШтрихКод: " + ШК + " " + "Удалил: " + Строка(ПараметрыСеанса.ТекущийПользователь));
			РС.Удалить();
			//Попытка
			//	РС.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗНОПриАктивизацииСтроки(Элемент)
	Попытка
		ИндексТекущейСтроки = Элементы.ЗНО.ТекущиеДанные.ПолучитьИдентификатор();
	Исключение
	КонецПопытки;
	
КонецПроцедуры


//Счет фактура 


Функция ПечатьСчетаФактуры(МассивОбъектов, ОбъектыПечати, ПечатьВВалюте = Ложь)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетФактура1137";
	ТабличныйДокумент.Защита=Ложь;
	ТабличныйДокумент.ТолькоПросмотр=Ложь;
	
	НомерТипаДокумента = 0;
	СтруктураТипов = РазложитьМассивПоТипамОбъектов(МассивОбъектов);
	
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
		
		НомерТипаДокумента = НомерТипаДокумента + 1;
		Если НомерТипаДокумента > 1 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если СтруктураОбъектов.Ключ = "ОтчетПоКомиссииМеждуОрганизациями" Тогда
			
			ПараметрыПечати = Новый Структура("ВидФормы, ПечатьВВалюте", "Комиссионер", ПечатьВВалюте);
			ДанныеДляПечати = Документы[СтруктураОбъектов.Ключ].ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, СтруктураОбъектов.Значение);
			
			ЗаполнитьТабличныйДокументСчетФактура(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			Ложь,
			ПечатьВВалюте
			);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ПараметрыПечати = Новый Структура("ВидФормы, ПечатьВВалюте", "Комитент", ПечатьВВалюте);
			ДанныеДляПечати = Документы[СтруктураОбъектов.Ключ].ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, СтруктураОбъектов.Значение);
			
			ЗаполнитьТабличныйДокументСчетФактура(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			Ложь,
			ПечатьВВалюте
			);
			
		Иначе
			
			ПараметрыПечати = Новый Структура("ПечатьВВалюте", ПечатьВВалюте);
			ДанныеДляПечати = Документы[СтруктураОбъектов.Ключ].ПолучитьДанныеДляПечатнойФормыСчетФактура(ПараметрыПечати, СтруктураОбъектов.Значение);
			
			СчетФактураНаАванс = ДанныеДляПечати.Свойство("СчетФактураНаАванс");
			
			ЗаполнитьТабличныйДокументСчетФактура(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			СчетФактураНаАванс,
			ПечатьВВалюте
			);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Процедура ЗаполнитьТабличныйДокументСчетФактура(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, ЭтоСчетФактураНаАванс = Ложь, ПечатьВВалюте = Ложь)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДанныеПечати      	= ДанныеДляПечати.РезультатПоШапке.Выбрать();
	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ТаблицаКурсовВалют  = ДанныеДляПечати.ТаблицаКурсовВалют;
	
	ПервыйДокумент = Истина;
	Пока ДанныеПечати.Следующий() Цикл
		
		Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ПФ_MXL_СчетФактура981");
		
		Если ДанныеПечати.ЭтоПередачаНаКомиссию Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 не требуется печатать счет-фактуру'"),
			ДанныеПечати.Ссылка
			);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			
		ИначеЕсли Не ЗначениеЗаполнено(ДанныеПечати.Номер) И Не ТипЗнч(ДанныеПечати.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			
			Если ДанныеПечати.Номер = Неопределено Тогда
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не введен счет-фактура'"),
				ДанныеПечати.Ссылка
				);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				, // "ТекстСчетФактура",
				"ТекстСчетФактура"
				);
			Иначе
				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не заполнены данные предъявленной счет-фактуры поставщика'"),
				ДанныеПечати.Ссылка
				);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка,
				"ПредъявленСчетФактура"
				);
			КонецЕсли;
			
		ИначеЕсли ПечатьВВалюте И ДанныеПечати.Валюта = ВалютаРегламентированногоУчета Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для документа %1 не требуется печатать счет-фактуру в валюте'"),
			ДанныеПечати.Ссылка
			);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			Текст,
			ДанныеПечати.Ссылка
			);
			
		Иначе
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Выводим общие реквизиты шапки
			СведенияОбОрганизации = Новый Структура;
			ЗаполнитьРеквизитыШапкиСчетФактура(ДанныеПечати, СведенияОбОрганизации, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс, ПечатьВВалюте);
			
			// Выводим заголовок таблицы
			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
			
			НомерСтраницы   = 1;
			
			// Инициализация итогов в документе
			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
			
			Если ПечатьВВалюте Тогда
				КоэффициентПересчета = 1;
			Иначе
				КоэффициентПересчета = КоэффициентПересчетаВалюты(ДанныеПечати, ТаблицаКурсовВалют, ВалютаРегламентированногоУчета);
			КонецЕсли;
			ДанныеСтроки = СтруктураДанныеСтроки(КоэффициентПересчета);
			
			// Создаем массив для проверки вывода
			МассивВыводимыхОбластей = Новый Массив;
			
			// Выводим многострочную часть документа
			ОбластьМакета  = Макет.ПолучитьОбласть("Строка");
			ОбластьИтого = Макет.ПолучитьОбласть("Итого");
			ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
			
			СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
			ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
			
			СтрокаТовары = ВыборкаПоДокументам.Выбрать();
			КоличествоСтрок = СтрокаТовары.Количество();
			Пока СтрокаТовары.Следующий() Цикл
				
				ДанныеСтроки.Номер = ДанныеСтроки.Номер + 1;
				
				ЗаполнитьРеквизитыСтрокиТовараСФ(ДанныеПечати, СтрокаТовары, ДанныеСтроки, ОбластьМакета, , ЭтоСчетФактураНаАванс, Истина);
				ЗаполнитьРеквизитыСтрокиТовараГТД(СтрокаТовары, ОбластьМакета);
				
				Если ЭтоСчетФактураНаАванс Тогда
					// В счетах-фактурах на аванс колонки 3,4,5 не выводятся
					ОбластьМакета.Параметры.Заполнить(Новый Структура("Количество,Цена,СуммаБезНДС",0,0,0));
				КонецЕсли;
				
				ПроставитьПрочеркиВПустыеПоляСтрокиСчетФактура(ОбластьМакета);
				
				МассивВыводимыхОбластей.Очистить();
				МассивВыводимыхОбластей.Добавить(ОбластьМакета);
				
				Если ДанныеСтроки.Номер = КоличествоСтрок Тогда
					МассивВыводимыхОбластей.Добавить(ОбластьИтого);
					МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
				КонецЕсли;
				
				Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
					НомерСтраницы = НомерСтраницы + 1;
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьМакета);
				РассчитатьИтоговыеСуммы(ИтоговыеСуммы, ДанныеСтроки);
				
			КонецЦикла;
			
			// Выводим итоги по документу
			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, ДанныеСтроки.Номер, ВалютаРегламентированногоУчета);
			ЗаполнитьРеквизитыПодвалаСчетФактура(ДанныеПечати, СведенияОбОрганизации, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс);
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыШапкиСчетФактура(ДанныеПечати, СведенияОПоставщике, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс, ПечатьВВалюте)
	
	СведенияОПоставщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата);
	СведенияОПокупателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата);
	СведенияОГрузоотправителе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
	СведенияОГрузополучателе = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
	
	//d.valuysky@kdvm.ru начало вставки 10.07.2017 10:07:41 
	АктивнаРедакция981 = Редакция981(ДанныеПечати.Дата);
	Если АктивнаРедакция981 Тогда
		//не выводим ничего
	Иначе
		ВедетсяУчетНДСПоФЗ56 = ВедетсяУчетНДСПоФЗ56(ДанныеПечати.Дата);
		Если ВедетсяУчетНДСПоФЗ56 Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИнформация1137_625");
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ШапкаИнформация1137");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	//d.valuysky@kdvm.ru конец вставки 10.07.2017 10:07:44
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(ДанныеПечати);
	
	// ЛВО + 01.08.2019
		//ОбластьМакета.Параметры.Номер = "Счет-фактура № " + ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(ДанныеПечати.Номер, Ложь, Ложь)
		//+ " от " + Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'")+ " г.";
		ОбластьМакета.Параметры.Номер = "Счет-фактура № " + ДанныеПечати.Номер	+ " от " + Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'")+ " г.";
	//-
	
	ОбластьМакета.Параметры.НомерИсправления = "Исправление № -- от --";
	
	// Выводим данные о поставщике.
	ОбластьМакета.Параметры.ПредставлениеПоставщика = "Продавец: " + СведенияОПоставщике.ОфициальноеНаименование;
	ОбластьМакета.Параметры.АдресПоставщика = "Адрес: " + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ЮридическийАдрес");
	
	КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
	ОбластьМакета.Параметры.ИННПоставщика = "ИНН/КПП продавца: " 
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН", Ложь)
	+ ?(Не ПустаяСтрока(КПП), "/" + КПП, "");
	
	// Выводим данные грузоотправителя.	
	ПредставлениеГрузоотправителя = "Грузоотправитель и его адрес: ";
	Если ДанныеПечати.ТолькоУслуги
		ИЛИ ЭтоСчетФактураНаАванс Тогда
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + "--";
	ИначеЕсли ДанныеПечати.Организация = ДанныеПечати.Грузоотправитель Тогда
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя + "он же";
	Иначе
		ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя 
		+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправителе, "ПолноеНаименование,ФактическийАдрес");
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ПредставлениеГрузоотправителя;
	
	// Выводим данные грузополучателя и покупателя.
	ПредставлениеГрузополучателя = "Грузополучатель и его адрес: ";
	Если ДанныеПечати.ТолькоУслуги
		ИЛИ ЭтоСчетФактураНаАванс Тогда
		ПредставлениеГрузополучателя = ПредставлениеГрузополучателя + "--";
	Иначе
		Если Не ПустаяСтрока(ДанныеПечати.АдресДоставки) Тогда
			ПредставлениеГрузополучателя = ПредставлениеГрузополучателя
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование", Ложь)
			+ ", " + СокрЛП(ДанныеПечати.АдресДоставки)
			;
		Иначе
			ПредставлениеГрузополучателя = ПредставлениеГрузополучателя
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ФактическийАдрес", Ложь);
			
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ПредставлениеГрузополучателя;
	
	ОбластьМакета.Параметры.ПоДокументу = "К платежно-расчетному документу № ";
	Если Не ПустаяСтрока(ДанныеПечати.СтрокаПоДокументу) Тогда
		ОбластьМакета.Параметры.ПоДокументу = ОбластьМакета.Параметры.ПоДокументу + ДанныеПечати.СтрокаПоДокументу;
	Иначе
		ОбластьМакета.Параметры.ПоДокументу = ОбластьМакета.Параметры.ПоДокументу + "-- от: --";
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПокупателя = "Покупатель: " 
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование", Ложь);
	ОбластьМакета.Параметры.АдресПокупателя = "Адрес: "
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ЮридическийАдрес", Ложь);
	
	КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);	
	ОбластьМакета.Параметры.ИННПокупателя = "ИНН/КПП покупателя: "
	+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь)
	+ ?(Не ПустаяСтрока(КПП), "/" + КПП, "");
	
	Если ЗначениеЗаполнено(ДанныеПечати.Валюта)
		И ПечатьВВалюте Тогда
		
		ДанныеВалюты = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДанныеПечати.Валюта, "НаименованиеПолное, Код");
		ОбластьМакета.Параметры.Валюта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Валюта: наименование, код %1, %2'"),
		ДанныеВалюты.НаименованиеПолное,
		ДанныеВалюты.Код
		);
		
	Иначе
		
		ОбластьМакета.Параметры.Валюта = НСтр("ru='Валюта: наименование, код Российский рубль, 643'"); 
		
	КонецЕсли;
	
	//d.valuysky@kdvm.ru начало вставки 10.07.2017 10:11:49 
	Если АктивнаРедакция981 Тогда
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ОбластьМакета = Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения) (при наличии): %1'");
		ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонЗаголовкаГосконтракт, "");
		ТабличныйДокумент.Вывести(ОбластьМакета);
	Иначе
		Если ВедетсяУчетНДСПоФЗ56 Тогда 
			ШаблонЗаголовкаГосконтракт = НСтр("ru = 'Идентификатор государственного контракта, договора (соглашения): %1'");
			ОбластьМакета.Параметры.ИдентификаторГосКонтракта = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонЗаголовкаГосконтракт, "");
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	//d.valuysky@kdvm.ru конец вставки 10.07.2017 10:11:53 
	
	
КонецПроцедуры // ЗаполнитьРеквизитыШапкиСчетФактура()

Процедура ЗаполнитьРеквизитыПодвалаСчетФактура(ДанныеПечати, СведенияОбОрганизации, ИтоговыеСуммы, Макет, ТабличныйДокумент, ЭтоСчетФактураНаАванс)
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоСуммаНДС = ИтоговыеСуммы.ИтогоНДС;
	ОбластьИтого.Параметры.ИтогоВсего = ИтоговыеСуммы.ИтогоСуммаСНДС;
	
	Если НЕ ЭтоСчетФактураНаАванс Тогда
		ОбластьИтого.Параметры.ИтогоСуммаБезНДС = ИтоговыеСуммы.ИтогоСумма;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
	ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
	
	Если СведенияОбОрганизации.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		//ninch 24.01.2012 нач
		//ОбластьПодвала.Параметры.ФИОРуководителя = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель);
		//ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
		ОбластьПодвала.Параметры.ФИОРуководителя = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель);
		ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.ГлавныйБухгалтер);
		
		ВрФизЛицо	= ДанныеПечати.Ссылка.Менеджер.ФизическоеЛицо;
		Если ЗначениеЗаполнено(ВрФизЛицо) Тогда
			Доверенность	= ВернутьДоверенностьФизЛица(ВрФизЛицо);
			Если Доверенность <> "" Тогда
				ОбластьПодвала.Параметры.ФИОРуководителя		= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВрФизЛицо) + Символы.ПС + "(на основании доверенности " + Символы.ПС + Доверенность +")";
				ОбластьПодвала.Параметры.ФИОГлавногоБухгалтера	= ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВрФизЛицо) + Символы.ПС + "(на основании доверенности " + Символы.ПС + Доверенность +")";
			КонецЕсли	
		КонецЕсли	
		//ninch 24.01.2012 кон
	Иначе
		//ОбластьПодвала.Параметры.ФИОПБОЮЛ = ФизическиеЛица.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель); //ninch 24.01.2012
		ОбластьПодвала.Параметры.ФИОПБОЮЛ = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ДанныеПечати.РукоВодитель); //ninch 24.01.2012
		ОбластьПодвала.Параметры.Свидетельство = СведенияОбОрганизации.Свидетельство;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры // ЗаполнитьРеквизитыПодвалаСчетФактура()

Функция РазложитьМассивПоТипамОбъектов(МассивОбъектов)
	
	СтруктураТипов 	= Новый Структура;
	
	Для Каждого Объект Из МассивОбъектов Цикл
		Если ТипЗнч(Объект) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
			Если НЕ СтруктураТипов.Свойство("ОтчетКомиссионера") Тогда
				ОтчетыКомиссионера 	= Новый Массив;
				СтруктураТипов.Вставить("ОтчетКомиссионера", ОтчетыКомиссионера);
			КонецЕсли;
			СтруктураТипов.ОтчетКомиссионера.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			Если НЕ СтруктураТипов.Свойство("ОтчетКомитенту") Тогда
				МассивОтчетовКомитенту 	= Новый Массив;
				СтруктураТипов.Вставить("ОтчетКомитенту", МассивОтчетовКомитенту);
			КонецЕсли;
			СтруктураТипов.ОтчетКомитенту.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.СчетФактураВыданныйАванс") Тогда
			Если НЕ СтруктураТипов.Свойство("СчетФактураВыданныйАванс") Тогда
				МассивСчетовФактурНаАванс 	= Новый Массив;
				СтруктураТипов.Вставить("СчетФактураВыданныйАванс", МассивСчетовФактурНаАванс);
			КонецЕсли;
			СтруктураТипов.СчетФактураВыданныйАванс.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ЗаписьКнигиПродаж") Тогда
			Если НЕ СтруктураТипов.Свойство("ЗаписьКнигиПродаж") Тогда
				МассивЗаписейКнигиПродаж 	= Новый Массив;
				СтруктураТипов.Вставить("ЗаписьКнигиПродаж", МассивЗаписейКнигиПродаж);
			КонецЕсли;
			СтруктураТипов.ЗаписьКнигиПродаж.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) 	= Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если НЕ СтруктураТипов.Свойство("РеализацияТоваровУслуг") Тогда
				МассивРеализаций 	= Новый Массив;
				СтруктураТипов.Вставить("РеализацияТоваровУслуг", МассивРеализаций);
			КонецЕсли;
			СтруктураТипов.РеализацияТоваровУслуг.Добавить(Объект);
			
			//ninch 24.01.2011 нач	
			//ИначеЕсли ТипЗнч(Объект) 	= Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			//	Если НЕ СтруктураТипов.Свойство("АктВыполненныхРабот") Тогда
			//		МассивАктов = Новый Массив;
			//		СтруктураТипов.Вставить("АктВыполненныхРабот", МассивАктов);
			//	КонецЕсли;
			//	СтруктураТипов.АктВыполненныхРабот.Добавить(Объект);
			//			
			//ninch 24.01.2011 кон
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			Если НЕ СтруктураТипов.Свойство("ВозвратТоваровПоставщику") Тогда
				МассивВозвратовПоставщику 	= Новый Массив;
				СтруктураТипов.Вставить("ВозвратТоваровПоставщику", МассивВозвратовПоставщику);
			КонецЕсли;
			СтруктураТипов.ВозвратТоваровПоставщику.Добавить(Объект);
			
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
			Если НЕ СтруктураТипов.Свойство("ПередачаТоваровМеждуОрганизациями") Тогда
				МассивПередачТоваровМеждуОрганизациями 	= Новый Массив;
				СтруктураТипов.Вставить("ПередачаТоваровМеждуОрганизациями", МассивПередачТоваровМеждуОрганизациями);
			КонецЕсли;
			СтруктураТипов.ПередачаТоваровМеждуОрганизациями.Добавить(Объект);
			
			//ninch 24.01.2011 нач	
			//ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями") Тогда
			//	Если НЕ СтруктураТипов.Свойство("ВозвратТоваровМеждуОрганизациями") Тогда
			//		МассивВозвратовМеждуОрганизациями 	= Новый Массив;
			//		СтруктураТипов.Вставить("ВозвратТоваровМеждуОрганизациями", МассивВозвратовМеждуОрганизациями);
			//	КонецЕсли;
			//	СтруктураТипов.ВозвратТоваровМеждуОрганизациями.Добавить(Объект);
			//	
			//ninch 24.01.2011 кон
		ИначеЕсли ТипЗнч(Объект) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями") Тогда
			Если НЕ СтруктураТипов.Свойство("ОтчетПоКомиссииМеждуОрганизациями") Тогда
				ОтчетыПоКомиссииМеждуОрганизациями 	= Новый Массив;
				СтруктураТипов.Вставить("ОтчетПоКомиссииМеждуОрганизациями", ОтчетыПоКомиссииМеждуОрганизациями);
			КонецЕсли;
			СтруктураТипов.ОтчетПоКомиссииМеждуОрганизациями.Добавить(Объект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураТипов
	
КонецФункции

Функция ПолучитьНазначениеОбработки()
	
	Назначение = Новый Массив;
	
	Назначение.Добавить("Документ.ОтчетКомиссионера");
	Назначение.Добавить("Документ.ВозвратТоваровПоставщику");
	Назначение.Добавить("Документ.СчетФактураВыданныйАванс");
	Назначение.Добавить("Документ.ОтчетКомитенту");
	Назначение.Добавить("Документ.РеализацияТоваровУслуг");
	Назначение.Добавить("Документ.АктВыполненныхРабот");
	Назначение.Добавить("Документ.ВозвратТоваровМеждуОрганизациями");
	Назначение.Добавить("Документ.ПередачаТоваровМеждуОрганизациями");
	Назначение.Добавить("Документ.ОтчетПоКомиссииМеждуОрганизациями");
	Назначение.Добавить("Документ.ЗаписьКнигиПродаж");
	
	Возврат Назначение;
	
КонецФункции

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

// Возвращает признак применения Федерального Закона 56-ФЗ
//
// Параметры
// Дата - тип дата, в данном параметре передается
//        дата на которую необходимо определить признак применения 56-ФЗ
// Возвращаемое значение:
//  Булево - признак применения
//           Истина - ФЗ-56 применяется
//           Ложь   - ФЗ-56 не применяется
//
Функция ВедетсяУчетНДСПоФЗ56(Дата) 
	
	НачалоПримененияФЗ56 = '20170701';
	
	Если Дата < НачалоПримененияФЗ56 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()

Функция Редакция981(Дата) 
	
	НачалоПрименения = '20171001';
	
	Если Дата < НачалоПрименения Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ВедетсяУчетНДСПоФЗ56()

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеВидимостью();
	ЗаполнитьСписокПечатныхФорм2(ТекущаяСтраница.Имя);
	
КонецПроцедуры

Процедура ЗаполнитьСписокПечатныхФорм2(ТекущаяСтраница)
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаКомплектацияПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаКомплектация.ТекущиеДанные;
	Если Не ТекущиеДанные.Пометка Или Не ТекущиеДанные.Напечатан Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.Пометка = Ложь;
	
	Если ТекущиеДанные.Напечатан Тогда
		Ответ = Вопрос("Данный заказ уже был напечатан! Перепечатать?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТекущиеДанные.Пометка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры


&НаКлиенте
Процедура РеестрВетСертификатов(Команда)
	 РеестрВетСертификатовСервер();
КонецПроцедуры

&НаСервере
Процедура РеестрВетСертификатовСервер()

	МассивЗНО = Новый Массив;
	
	СтрокиДерева = ЗНО.ПолучитьЭлементы();
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл	
		
		Если СтрокаДерева.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ СтрокаДерева.ЗНО.Статус = Перечисления.СтатусыЗаказовНаОтгрузку.Отгружено Тогда
			Сообщить("" + СтрокаДерева.ЗНО + "находится в статусе " + СтрокаДерева.ЗНО.Статус + ". Формировать ВСД можно только для документво со статусом ОТГРУЖЕНО.");
			Продолжить;
		КонецЕсли;	
		
		МассивЗНО.Добавить(СтрокаДерева.ЗНО);
		
	КонецЦикла;	
	
	МодульВетис = ВетисПовтИсп.ИнициализароватьПодключаемыйМодуль();
	МодульВетис.СформироватьЗаявкиПеремещениеПоЗНО(МассивЗНО);
	
КонецПроцедуры

&НаКлиенте
Процедура НеПечататьЛистКомплектацииДляWMS(Команда)
	Элементы.НастройкаПечати.КоманднаяПанель.ПодчиненныеЭлементы.НастройкаПечатиНеПечататьЛистКомплектацииДляWMS.Пометка = Не Элементы.НастройкаПечати.КоманднаяПанель.ПодчиненныеЭлементы.НастройкаПечатиНеПечататьЛистКомплектацииДляWMS.Пометка;
	НеПечататьЛистКомплектацииДляWMS = Элементы.НастройкаПечати.КоманднаяПанель.ПодчиненныеЭлементы.НастройкаПечатиНеПечататьЛистКомплектацииДляWMS.Пометка;
КонецПроцедуры


// Функция выполняет подключение внешней компоненты и ее первоначальную настройку.
// 
// Параметры: 
//  Нет 
// 
// Возвращаемое значение: 
//  Картинка - Картинка со сформированным штрихкодом или НЕОПРЕДЕЛЕНО
Функция ПолучитьКодДокументаДляПечати(МетаданныеДокумент)
	
	Если МетаданныеДокумент.Имя = "АвансовыйОтчет" Тогда
		Возврат 1
	ИначеЕсли МетаданныеДокумент.Имя = "АктОРасхожденияхПриПоступленииТоваров" Тогда
		Возврат 2
	ИначеЕсли МетаданныеДокумент.Имя = "АктПриемкиТоваров" Тогда
		Возврат 3
	ИначеЕсли МетаданныеДокумент.Имя = "ВводОстатков" Тогда
		Возврат 4
	ИначеЕсли МетаданныеДокумент.Имя = "ВзаимозачетЗадолженности" Тогда
		Возврат 5
	ИначеЕсли МетаданныеДокумент.Имя = "ВнесениеДенежныхСредствВКассуККМ" Тогда
		Возврат 6
	ИначеЕсли МетаданныеДокумент.Имя = "ВозвратТоваровОтКлиента" Тогда
		Возврат 7
	ИначеЕсли МетаданныеДокумент.Имя = "ВозвратТоваровПоставщику" Тогда
		Возврат 8
	ИначеЕсли МетаданныеДокумент.Имя = "Встреча" Тогда
		Возврат 9
	ИначеЕсли МетаданныеДокумент.Имя = "ВыемкаДенежныхСредствИзКассыККМ" Тогда
		Возврат 10
	ИначеЕсли МетаданныеДокумент.Имя = "ВыпискаПоРасчетномуСчету" Тогда
		Возврат 11
	ИначеЕсли МетаданныеДокумент.Имя = "ДоверенностьНаПолучениеТоваров" Тогда
		Возврат 12
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаданиеТорговомуПредставителю" Тогда
		Возврат 13
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаказКлиента" Тогда
		Возврат 14
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаказНаВнутреннееПотребление" Тогда
		Возврат 15
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаказНаПеремещение" Тогда
		Возврат 16
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаказНаСборку" Тогда
		Возврат 17
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаказПоставщику" Тогда
		Возврат 18
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаписьКнигиПокупок" Тогда
		Возврат 19
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаписьКнигиПродаж" Тогда
		Возврат 20
	ИначеЕсли МетаданныеДокумент.Имя = "ЗапланированноеВзаимодействие" Тогда
		Возврат 21
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаявкаНаВозвратТоваровОтКлиента" Тогда
		Возврат 22
	ИначеЕсли МетаданныеДокумент.Имя = "ЗаявкаНаРасходованиеДенежныхСредств" Тогда
		Возврат 23
	ИначеЕсли МетаданныеДокумент.Имя = "КассоваяКнига" Тогда
		Возврат 24
	ИначеЕсли МетаданныеДокумент.Имя = "КассоваяСмена" Тогда
		Возврат 25
	ИначеЕсли МетаданныеДокумент.Имя = "КоммерческоеПредложениеКлиенту" Тогда
		Возврат 26
	ИначеЕсли МетаданныеДокумент.Имя = "КорректировкаОбособленногоУчетаЗапасов" Тогда
		Возврат 27
	ИначеЕсли МетаданныеДокумент.Имя = "КорректировкаРегистров" Тогда
		Возврат 28
	ИначеЕсли МетаданныеДокумент.Имя = "ОперацияПоПлатежнойКарте" Тогда
		Возврат 29
	ИначеЕсли МетаданныеДокумент.Имя = "ОприходованиеТоваров" Тогда
		Возврат 30
	ИначеЕсли МетаданныеДокумент.Имя = "ОрдерНаОтражениеИзлишковТоваров" Тогда
		Возврат 31
	ИначеЕсли МетаданныеДокумент.Имя = "ОрдерНаОтражениеНедостачТоваров" Тогда
		Возврат 32
	ИначеЕсли МетаданныеДокумент.Имя = "ОрдерНаОтражениеПорчиТоваров" Тогда
		Возврат 33
	ИначеЕсли МетаданныеДокумент.Имя = "ОрдерНаОтражениеРезультатовПересчетовТоваров" Тогда
		Возврат 34
	ИначеЕсли МетаданныеДокумент.Имя = "ОрдерНаПеремещениеТоваров" Тогда
		Возврат 35
	ИначеЕсли МетаданныеДокумент.Имя = "ОтборРазмещениеТоваров" Тогда
		Возврат 36
	ИначеЕсли МетаданныеДокумент.Имя = "ОтражениеРезультатовПроверкиОрдераНаТовары" Тогда
		Возврат 37
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетБанкаПоОперациямЭквайринга" Тогда
		Возврат 38
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетКомиссионера" Тогда
		Возврат 39
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетКомиссионераОСписании" Тогда
		Возврат 40
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетКомитенту" Тогда
		Возврат 41
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетКомитентуОСписании" Тогда
		Возврат 42
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетОРозничныхПродажах" Тогда
		Возврат 43
	ИначеЕсли МетаданныеДокумент.Имя = "ОтчетПоКомиссииМеждуОрганизациями" Тогда
		Возврат 44
	ИначеЕсли МетаданныеДокумент.Имя = "ПередачаТоваровМеждуОрганизациями" Тогда
		Возврат 45
	ИначеЕсли МетаданныеДокумент.Имя = "ПеремещениеТоваров" Тогда
		Возврат 46
	ИначеЕсли МетаданныеДокумент.Имя = "ПересортицаТоваров" Тогда
		Возврат 47
	ИначеЕсли МетаданныеДокумент.Имя = "ПересчетТоваров" Тогда
		Возврат 48
	ИначеЕсли МетаданныеДокумент.Имя = "ПланируемоеПоступлениеДенежныхСредств" Тогда
		Возврат 49
	ИначеЕсли МетаданныеДокумент.Имя = "ПланПродажИВнутреннегоПотребления" Тогда
		Возврат 50
	ИначеЕсли МетаданныеДокумент.Имя = "ПодтверждениеНулевойСтавкиНДС" Тогда
		Возврат 51
	ИначеЕсли МетаданныеДокумент.Имя = "ПорчаТоваров" Тогда
		Возврат 52
	ИначеЕсли МетаданныеДокумент.Имя = "ПоступлениеБезналичныхДенежныхСредств" Тогда
		Возврат 53
	ИначеЕсли МетаданныеДокумент.Имя = "ПоступлениеТоваровУслуг" Тогда
		Возврат 54
	ИначеЕсли МетаданныеДокумент.Имя = "ПриказНаПроведениеИнвентаризацииТоваров" Тогда
		Возврат 55
	ИначеЕсли МетаданныеДокумент.Имя = "ПриходныйКассовыйОрдер" Тогда
		Возврат 56
	ИначеЕсли МетаданныеДокумент.Имя = "ПриходныйОрдерНаТовары" Тогда
		Возврат 57
	ИначеЕсли МетаданныеДокумент.Имя = "ПроизвольныйЭД" Тогда
		Возврат 58
	ИначеЕсли МетаданныеДокумент.Имя = "РаспоряжениеНаПеремещениеДенежныхСредств" Тогда
		Возврат 59
	ИначеЕсли МетаданныеДокумент.Имя = "РаспределениеДоходовИРасходовПоНаправлениямДеятельности" Тогда
		Возврат 60
	ИначеЕсли МетаданныеДокумент.Имя = "РаспределениеНДС" Тогда
		Возврат 61
	ИначеЕсли МетаданныеДокумент.Имя = "РаспределениеРасходовБудущихПериодов" Тогда
		Возврат 62
	ИначеЕсли МетаданныеДокумент.Имя = "РаспределениеРасходовНаСебестоимостьТоваров" Тогда
		Возврат 63
	ИначеЕсли МетаданныеДокумент.Имя = "РасходныйКассовыйОрдер" Тогда
		Возврат 64
	ИначеЕсли МетаданныеДокумент.Имя = "РасходныйОрдерНаТовары" Тогда
		Возврат 65
	ИначеЕсли МетаданныеДокумент.Имя = "РасчетСебестоимостиТоваров" Тогда
		Возврат 66
	ИначеЕсли МетаданныеДокумент.Имя = "РеализацияТоваровУслуг" Тогда
		Возврат 67
	ИначеЕсли МетаданныеДокумент.Имя = "РегистрацияЦенНоменклатурыПоставщика" Тогда
		Возврат 68
	ИначеЕсли МетаданныеДокумент.Имя = "СборкаТоваров" Тогда
		Возврат 69
	ИначеЕсли МетаданныеДокумент.Имя = "СверкаВзаиморасчетов" Тогда
		Возврат 70
	ИначеЕсли МетаданныеДокумент.Имя = "СоглашениеОбИспользованииЭД" Тогда
		Возврат 71
	ИначеЕсли МетаданныеДокумент.Имя = "СписаниеБезналичныхДенежныхСредств" Тогда
		Возврат 72
	ИначеЕсли МетаданныеДокумент.Имя = "СписаниеЗадолженности" Тогда
		Возврат 73
	ИначеЕсли МетаданныеДокумент.Имя = "СписаниеТоваров" Тогда
		Возврат 74
	ИначеЕсли МетаданныеДокумент.Имя = "СчетНаОплатуКлиенту" Тогда
		Возврат 75
	ИначеЕсли МетаданныеДокумент.Имя = "СчетФактураВыданный" Тогда
		Возврат 76
	ИначеЕсли МетаданныеДокумент.Имя = "СчетФактураВыданныйАванс" Тогда
		Возврат 77
	ИначеЕсли МетаданныеДокумент.Имя = "СчетФактураПолученныйАванс" Тогда
		Возврат 78
	ИначеЕсли МетаданныеДокумент.Имя = "ТелефонныйЗвонок" Тогда
		Возврат 79
	ИначеЕсли МетаданныеДокумент.Имя = "ПакетЭД" Тогда
		Возврат 80
	ИначеЕсли МетаданныеДокумент.Имя = "ТребованиеНакладная" Тогда
		Возврат 81
	ИначеЕсли МетаданныеДокумент.Имя = "УстановкаБлокировокЯчеек" Тогда
		Возврат 82
	ИначеЕсли МетаданныеДокумент.Имя = "УстановкаСкидокПоМаркетинговымМероприятиям" Тогда
		Возврат 83
	ИначеЕсли МетаданныеДокумент.Имя = "УстановкаЦенНоменклатуры" Тогда
		Возврат 84
	ИначеЕсли МетаданныеДокумент.Имя = "ФормированиеЗаписейКнигиПокупокИКнигиПродаж" Тогда
		Возврат 85
	ИначеЕсли МетаданныеДокумент.Имя = "ЧекККМ" Тогда
		Возврат 86
	ИначеЕсли МетаданныеДокумент.Имя = "ЧекККМВозврат" Тогда
		Возврат 87
	ИначеЕсли МетаданныеДокумент.Имя = "ЭлектронноеПисьмоВходящее" Тогда
		Возврат 88
	ИначеЕсли МетаданныеДокумент.Имя = "ЭлектронноеПисьмоИсходящее" Тогда
		Возврат 89
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции	

Функция СформироватьШтрихкодНакладной(ТекДок)
	
	//14.05.2018 Соловьев И.В. Старое удаляем, теперь формируем ШК из номера документа
	//НаборЗаписейДопСв = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	//НаборЗаписейДопСв.Объект = ТекДок;
	//НаборЗаписейДопСв.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Штрихкод документа");
	//НаборЗаписейДопСв.Прочитать();
	//Если НаборЗаписейДопСв.Выбран() Тогда
	//	
	//	Возврат НаборЗаписейДопСв.Значение;
	//	
	//Иначе
	//	ПоследнийШтрихкод = Формат(Число(ПолучитьПоследнийШтрихкодПоСвойству()) +1, "ЧЦ=11; ЧВН=; ЧГ=0");
	//	
	//	НаборЗаписейДопСв = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
	//	НаборЗаписейДопСв.Объект = ТекДок;
	//	НаборЗаписейДопСв.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Штрихкод документа");
	//	НаборЗаписейДопСв.Значение = ПоследнийШтрихкод;
	//	НаборЗаписейДопСв.Записать();
	//	
	//КонецЕсли; 
	ПоследнийШтрихкод = "1#" + ТекДок.Номер + "#" +  Формат(ТекДок.Дата, "ДФ=yy");
	
	Возврат ПоследнийШтрихкод;
	
КонецФункции

Функция ПолучитьПоследнийШтрихкодПоСвойству()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПОДСТРОКА(ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(150)), 1, 11) КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ДополнительныеСведения.Свойство.Наименование = ""Штрихкод документа""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		//Будем кодировать документы 
		Возврат "0"; 
	КонецЕсли; 
	ТаблицаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаДетальныеЗаписи[0].Значение;
КонецФункции//-

Функция КонтрагентСОбобщеннымиДокументами(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыДополнительныеРеквизиты.Значение
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
		|ГДЕ
		|	КонтрагентыДополнительныеРеквизиты.Ссылка = &Контрагент
		|	И КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""ОбобщённыйДокумент""";

	Запрос.УстановитьПараметр("Контрагент", Контрагент);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

//++Банников Е.А. 07.05.2020
Функция ПолучитьДанныеДляПечатнойФормыТОРГ12_Осн(ПараметрыПечати, МассивОбъектов) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);

	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|////////////////////////////////////////////////////////////////////////////
	|// ВРЕМЕННАЯ ТАБЛИЦА
	|ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ВТ_ТаблицаКорректировок
	|ИЗ 
	|	&ТаблицаВВалютеРегл КАК ТаблицаВВалютеРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ШАПКЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка                                                 КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер                                                  КАК Номер,
	|	РеализацияТоваровУслуг.Дата                                                   КАК Дата,
	|	РеализацияТоваровУслуг.Партнер                                                КАК Партнер,
	|	РеализацияТоваровУслуг.Контрагент                                             КАК Контрагент,
	|	РеализацияТоваровУслуг.Организация                                            КАК Организация,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель.Наименование           КАК РукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя               КАК ДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер.Наименование       КАК ГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Отпустил.Наименование                                  КАК Кладовщик,
	|	РеализацияТоваровУслуг.ОтпустилДолжность                                      КАК ДолжностьКладовщика,
	|	РеализацияТоваровУслуг.Организация.Префикс                                    КАК Префикс,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Контрагент
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|		РеализацияТоваровУслуг.Организация
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|
	|	РеализацияТоваровУслуг.БанковскийСчетОрганизации                             КАК БанковскийСчетОрганизации,
	|	РеализацияТоваровУслуг.БанковскийСчетКонтрагента                             КАК БанковскийСчетКонтрагента,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузоотправителя                        КАК БанковскийСчетГрузоотправителя,
	|	РеализацияТоваровУслуг.БанковскийСчетГрузополучателя                         КАК БанковскийСчетГрузополучателя,
	|	РеализацияТоваровУслуг.АдресДоставки                                         КАК АдресДоставки,
	|	Неопределено                                                                 КАК Подразделение,
	|
	|	// При взаиморасчетах в иностранной валюте в обработку передаем суммы в валюте регл. учета.
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.Ссылка В (&МассивДокументовВВалютеРегл) ТОГДА
	|		&ВалютаРегламентированногоУчета
	|	ИНАЧЕ
	|		РеализацияТоваровУслуг.Валюта
	|	КОНЕЦ						                                                 КАК Валюта,
	|
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС                                       КАК ЦенаВключаетНДС,
	|	РеализацияТоваровУслуг.ДоверенностьНомер                                     КАК ДоверенностьНомер,
	|	РеализацияТоваровУслуг.ДоверенностьДата                                      КАК ДоверенностьДата,
	|	РеализацияТоваровУслуг.ДоверенностьВыдана                                    КАК ДоверенностьВыдана,
	|	РеализацияТоваровУслуг.ДоверенностьЛицо                                      КАК ДоверенностьЛицо,
	|
	|	ВЫБОР КОГДА РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию) ТОГДА
	|		Истина
	|	ИНАЧЕ
	|		Ложь
	|	КОНЕЦ КАК ЭтоПередачаНаКомиссию
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ТАБЛИЧНЫМ ЧАСТЯМ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка                                                     КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура                                               КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное                            КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура." + КолонкаКодов + "                          КАК ТоварКод,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление                             КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Код                                       КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения                                           КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление                         КАК ВидУпаковки,
	|	ВложенныйЗапрос.КоэффициентМест / ВложенныйЗапрос.Коэффициент              КАК КоличествоВОдномМесте,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное                          КАК Характеристика,
	|	ВложенныйЗапрос.СтавкаНДС                                                  КАК СтавкаНДС,
	|	ВЫБОР КОГДА ТаблицаКорректировок.Сумма ЕСТЬ NULL ТОГДА
	|		ВложенныйЗапрос.Цена
	|	ИНАЧЕ
	|		ВЫРАЗИТЬ(ТаблицаКорректировок.Сумма / ВложенныйЗапрос.Количество
	|			КАК ЧИСЛО(15,2))
	|	КОНЕЦ 																	   КАК Цена,
	|	ВложенныйЗапрос.ЦенаБезСкидки                                              КАК ЦенаБезСкидки,
	|	ВложенныйЗапрос.Количество                                                 КАК Количество,
	|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоМест, 0)                                КАК КоличествоМест,
	|	ЕСТЬNULL(ТаблицаКорректировок.Сумма, ВложенныйЗапрос.Сумма)                КАК Сумма,
	|	ЕСТЬNULL(ТаблицаКорректировок.СуммаНДС, ВложенныйЗапрос.СуммаНДС)          КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки                                                КАК НомерСтроки,
	|	ВложенныйЗапрос.МассаБрутто                                                КАК МассаБрутто,
	|	Ложь                                                                       КАК ЭтоВозвратнаяТара,
	|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение, 0) КАК ПризнакВетКонтроля,
	|	ЕСТЬNULL(ВложенныйЗапросДатаВыпуска.ДатаВыпуска, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПроизводства

	|ИЗ (
	|	ВЫБРАТЬ
	|		РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслуг.Номенклатура КАК Номенклатура,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			1
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.Коэффициент
	|		КОНЕЦ КАК Коэффициент,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			1
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.Коэффициент
	|		КОНЕЦ КАК КоэффициентМест,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка) ТОГДА
	|			РеализацияТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.Упаковка.ЕдиницаИзмерения
	|		КОНЕЦ КАК ЕдиницаИзмеренияМест,
	|
	|		ВЫБОР КОГДА РеализацияТоваровУслуг.Упаковка.Вес ЕСТЬ NULL ТОГДА
	|			РеализацияТоваровУслуг.Количество * РеализацияТоваровУслуг.Номенклатура.Вес
	|		ИНАЧЕ
	|			РеализацияТоваровУслуг.КоличествоУпаковок * РеализацияТоваровУслуг.Упаковка.Вес
	|		КОНЕЦ КАК МассаБрутто,
	|
	|		РеализацияТоваровУслуг.Характеристика     КАК Характеристика,
	|		РеализацияТоваровУслуг.СтавкаНДС          КАК СтавкаНДС,
	|		ВЫБОР
	|			КОГДА
	|				РеализацияТоваровУслуг.СуммаРучнойСкидки + РеализацияТоваровУслуг.СуммаАвтоматическойСкидки = 0
	|				ИЛИ РеализацияТоваровУслуг.КоличествоУпаковок = 0
	|			ТОГДА
	|				РеализацияТоваровУслуг.Цена
	|			ИНАЧЕ
	|				РеализацияТоваровУслуг.Сумма / РеализацияТоваровУслуг.КоличествоУпаковок
	|		КОНЕЦ КАК Цена,
	|		РеализацияТоваровУслуг.Цена 			  КАК ЦенаБезСкидки,
	|		РеализацияТоваровУслуг.КоличествоУпаковок КАК Количество,
	|		РеализацияТоваровУслуг.КоличествоУпаковок КАК КоличествоМест,
	|		РеализацияТоваровУслуг.Сумма			  КАК Сумма,
	|		РеализацияТоваровУслуг.СуммаНДС           КАК СуммаНДС,
	|		РеализацияТоваровУслуг.НомерСтроки        КАК НомерСтроки
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	|	ГДЕ
	|		РеализацияТоваровУслуг.Ссылка В (&МассивДокументов)
	|		" + ?(Не ПараметрыПечати.ВыводитьУслуги, " И РеализацияТоваровУслуг.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) ", "") + "
	|	
	|	) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаКорректировок КАК ТаблицаКорректировок
	|			ПО ВложенныйЗапрос.Ссылка = ТаблицаКорректировок.ДокументСсылка
	|				И ВложенныйЗапрос.НомерСтроки = ТаблицаКорректировок.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|			ПО ВложенныйЗапрос.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|				И (НоменклатураДополнительныеРеквизиты.Свойство = &СвойствоВетКонтроль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка КАК Ссылка,
	|				РеализацияТоваровУслугДатыВыпуска.Номенклатура КАК Номенклатура,
	|				МИНИМУМ(РеализацияТоваровУслугДатыВыпуска.ДатаВыпуска) КАК ДатаВыпуска
	|			ИЗ
	|				Документ.РеализацияТоваровУслуг.ДатыВыпуска КАК РеализацияТоваровУслугДатыВыпуска
	|			ГДЕ
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка В(&МассивДокументов)
	|	
	|			СГРУППИРОВАТЬ ПО
	|				РеализацияТоваровУслугДатыВыпуска.Ссылка,
	|				РеализацияТоваровУслугДатыВыпуска.Номенклатура) КАК ВложенныйЗапросДатаВыпуска
	|		ПО ВложенныйЗапрос.Ссылка = ВложенныйЗапросДатаВыпуска.Ссылка
	|			И ВложенныйЗапрос.Номенклатура = ВложенныйЗапросДатаВыпуска.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.Номенклатура.Категория.Наименование,
	|	ВложенныйЗапрос.Номенклатура.Наименование
	|
	|ИТОГИ ПО
	|	Ссылка
	|");                                 
		
	ТаблицаВВалютеРегл = ПолучитьТабличнуюЧастьВВалютеРеглУчета(МассивОбъектов);
	МассивДокументовВВалютеРегл = ТаблицаВВалютеРегл.ВыгрузитьКолонку("ДокументСсылка");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос.УстановитьПараметр("МассивДокументов", 				МассивОбъектов);
	Запрос.УстановитьПараметр("ТаблицаВВалютеРегл",				ТаблицаВВалютеРегл);
	Запрос.УстановитьПараметр("МассивДокументовВВалютеРегл", 	МассивДокументовВВалютеРегл);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СвойствоВетКонтроль", 			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ВетКонтроль"));
	
	ТаблицаКурсовВалют = ПолучитьТаблицуКурсовВалют(МассивОбъектов);
	
	МассивРезультатов 			= Запрос.ВыполнитьПакет();
	// МассивРезультатов[0] - временная таблица "Таблица корректировок"
	РезультатПоШапке			= МассивРезультатов[1];
	РезультатПоТабличнойЧасти 	= МассивРезультатов[2];
	
	СтруктураДанныхДляПечати 	= Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют",
												   РезультатПоШапке, РезультатПоТабличнойЧасти, ТаблицаКурсовВалют);
												   
	Если ПривилегированныйРежим() Тогда
	    УстановитьПривилегированныйРежим(Ложь);	
	КонецЕсли;
	
	Возврат СтруктураДанныхДляПечати;

КонецФункции
//--Банников Е.А. 07.05.2020

//ЛВО ТЕСТИРУЮ

Функция ПолучитьВесИОбъемТоваровВУпаковкеWMSПоДокументуТЕСТ(ДокументСсылка) Экспорт
	
	
	СтруктрураВесОбъем = Новый Структура("Вес, Объем, КоличествоПаллет");

	Запрос = Новый Запрос;

			Запрос.Текст = "
		|ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Количество
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ." + ДокументСсылка.Метаданные().Имя + ".Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &ДокументСсылка 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Владелец,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА УпаковкиНоменклатуры.Наименование = ""паллета""
		|				ТОГДА УпаковкиНоменклатуры.Ссылка
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК УпакПаллета,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА УпаковкиНоменклатуры.Наименование = ""Упаковка WMS""
		|				ТОГДА УпаковкиНоменклатуры.Ссылка
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК УпакВМС
		|ПОМЕСТИТЬ Упак
		|ИЗ
		|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец В
		|			(ВЫБРАТЬ
		|				Товары.Номенклатура
		|			ИЗ
		|				Товары КАК Товары)
		|	И УпаковкиНоменклатуры.Наименование В (""паллета"", ""Упаковка WMS"")
		|
		|СГРУППИРОВАТЬ ПО
		|	УпаковкиНоменклатуры.Владелец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СУММА(Товары.Количество * ВЫБОР
		|					КОГДА НЕ Упак.УпакВМС ЕСТЬ NULL 
		|						ТОГДА Упак.УпакВМС.Вес / Упак.УпакВМС.Коэффициент
		|					ИНАЧЕ ВЫБОР
		|							КОГДА Товары.Номенклатура.Вес = 0
		|								ТОГДА 0.01
		|							ИНАЧЕ Товары.Номенклатура.Вес
		|						КОНЕЦ
		|				КОНЕЦ) КАК ЧИСЛО(37, 3)), 0) КАК Вес,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СУММА(Товары.Количество * ВЫБОР
		|					КОГДА НЕ Упак.УпакВМС ЕСТЬ NULL 
		|						ТОГДА Упак.УпакВМС.Высота * Упак.УпакВМС.Глубина * Упак.УпакВМС.Ширина / Упак.УпакВМС.Коэффициент
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК ЧИСЛО(37, 3)), 0) КАК Объем,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СУММА(Товары.Количество / ВЫБОР
		|					КОГДА НЕ Упак.УпакПаллета ЕСТЬ NULL 
		|						ТОГДА Упак.УпакПаллета.Коэффициент
		|					ИНАЧЕ 99999999999
		|				КОНЕЦ) КАК ЧИСЛО(37, 3)), 0) КАК КоличествоПаллет
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Упак КАК Упак
		|		ПО Товары.Номенклатура = Упак.Владелец
		|";
					
			
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	
	Количество = 0;
	
	Если Результат.Пустой() Тогда
		
					Количество = ДокументСсылка.Товары.Итог("Количество") / 1000;
		
		Возврат Новый Структура("Вес, Объем, КоличествоПаллет", Количество, Количество, 0);
	Иначе
		
		Выборка = Результат.Выбрать();                              
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктрураВесОбъем, Выборка);
		Если СтруктрураВесОбъем.Вес = 0 Тогда
			
							Количество = ДокументСсылка.Товары.Итог("Количество") / 1000;
			
			
			СтруктрураВесОбъем.Вес = Количество;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктрураВесОбъем;
	
КонецФункции
//-

&НаКлиенте
Процедура ТранспортнаяНакладнаяОбщая(Команда)
	ТабДокумент = СформироватьПечатнуюФормуТранспортнаяНакладнаяОбщая();
	ТабДокумент.Показать();
КонецПроцедуры

Функция СформироватьПечатнуюФормуТранспортнаяНакладнаяОбщая()
		
	УстановитьПривилегированныйРежим(Истина);
	 СтрокиМаршрутов = РеквизитФормыВЗначение("ЗНО");
	 Зно1="";
	 МассивДокументов = Новый Массив;
	 Для Каждого СтрокаМаршрута Из СтрокиМаршрутов.Строки Цикл
		Если НЕ СтрокаМаршрута.Пометка Тогда
			Продолжить;
		КонецЕсли;
	  
	  Если ПустаяСтрока(Зно1) тогда
		Зно1 = СтрокаМаршрута.Зно;
		Перевозчик1 = СтрокаМаршрута.Перевозчик;
	  КонецЕсли;

	
	Для Каждого СтрЗаказ Из СтрокаМаршрута.Строки Цикл
		Если (ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.ПеремещениеТоваров") 
			ИЛИ  ТипЗнч(СтрЗаказ.Автомобиль)=Тип("ДокументСсылка.РеализацияТоваровУслуг"))
			И (ЗначениеЗаполнено(СтрЗаказ.Автомобиль)) И Не СтрЗаказ.Пометка = 0 Тогда
			МассивДокументов.Добавить(СтрЗаказ.Автомобиль);
		ИначеЕсли Не ЗначениеЗаполнено(СтрЗаказ.Автомобиль) И ТипЗнч(СтрЗаказ.ЗНО)=Тип("ДокументСсылка.ЗаказКлиента") И СтрЗаказ.ОбобщенныйДокумент И СтрЗаказ.Пометка = 1 Тогда
			МассивДокументов.Добавить(СтрЗаказ.ЗНО);
		КонецЕсли;	
	КонецЦикла;	
	
	
	МассивСкладов = Новый Массив;
	
	СоответствиеОбобщенных = Новый Соответствие;
	Для Каждого ТекДок из МассивДокументов Цикл
		Если ТипЗнч(ТекДок) = тип("ДокументСсылка.ПеремещениеТоваров") Тогда
			ИскомыйСклад = МассивСкладов.Найти(ТекДок.СкладПолучатель);
			Если ПустаяСтрока(ИскомыйСклад) Тогда
				МассивСкладов.Добавить(ТекДок.СкладПолучатель);
			КонецЕсли; 
		Иначе
			
			СкладКонтрагента = НайтиСкладКонтрагента(ТекДок.Контрагент);
			Если Не ЗначениеЗаполнено(СкладКонтрагента) Тогда
				
				КонтрагентСОбобщеннымиДокументами = СоответствиеОбобщенных.Получить(ТекДок.Контрагент); 
				Если КонтрагентСОбобщеннымиДокументами = Неопределено Тогда
					КонтрагентСОбобщеннымиДокументами = КонтрагентСОбобщеннымиДокументами(ТекДок.Контрагент) = Истина;
					СоответствиеОбобщенных.Вставить(ТекДок.Контрагент, КонтрагентСОбобщеннымиДокументами); 
				КонецЕсли;
				
				Если КонтрагентСОбобщеннымиДокументами Тогда
					
					Если МассивСкладов.Найти(ТекДок.Контрагент) = Неопределено ТОгда
						
						МассивСкладов.Добавить(ТекДок.Контрагент);
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ИскомыйСклад = МассивСкладов.Найти(СкладКонтрагента);
				Если ПустаяСтрока(ИскомыйСклад) Тогда
					МассивСкладов.Добавить(СкладКонтрагента);
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	КонецЦикла;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.КоличествоЭкземпляров = 1;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Обработка = РеквизитФормыВЗначение("Объект");		
	Макет = Обработка.ПолучитьМакет("ТранспортнаяНакладная");
	Область1 = Макет.ПолучитьОбласть("лицеваясторона1");
	Область2 = Макет.ПолучитьОбласть("лицеваясторона2");
	Область3 = Макет.ПолучитьОбласть("лицеваясторона3");
	Область4 = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
	// теперь напечатаем ТТН-ку общую на все документы
	// получим список документов на которые печатаем ТТН
	
	// получим данные Для печати ТТН 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеТоваров.Ссылка КАК Ссылка,
	|	ПеремещениеТоваров.Номер КАК Номер,
	|	ПеремещениеТоваров.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Номер
	|	КОНЕЦ КАК НомерЗаказа,
	|	ВЫБОР
	|		КОГДА ПеремещениеТоваров.ЗаказНаПеремещение = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ПеремещениеТоваров.ЗаказНаПеремещение.Дата
	|	КОНЕЦ КАК ДатаЗаказа,
	|	ПеремещениеТоваров.Организация КАК Организация,
	|	ПеремещениеТоваров.Организация КАК Грузополучатель,
	|	ПеремещениеТоваров.Организация КАК Грузоотправитель,
	|	ПеремещениеТоваров.Организация КАК Контрагент,
	|	ПеремещениеТоваров.Организация КАК ЗаказчикПеревозок,
	|	ПеремещениеТоваров.Организация.Префикс КАК Префикс,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущийОтветственный КАК Кладовщик,
	|	ПеремещениеТоваров.СкладОтправитель.ТекущаяДолжностьОтветственного КАК ДолжностьКладовщика,
	|	ПеремещениеТоваров.Организация.ТекущийРукоВодитель КАК РукоВодитель,
	|	ПеремещениеТоваров.Организация.ТекущаяДолжностьРуководителя КАК ДолжностьРуководителя,
	|	ПеремещениеТоваров.Организация.ТекущийГлавныйБухгалтер КАК ГлавныйБухгалтер,
	|	ПеремещениеТоваров.Перевозчик КАК Перевозчик,
	|	ПеремещениеТоваров.Водитель КАК Водитель,
	|	СкладыКонтактнаяОтправитель.Представление КАК ПунктПогрузки,
	|	СкладыКонтактнаяПолучатель.Представление КАК ПунктРазгрузки,
	|	ПеремещениеТоваров.СрокДоставки КАК СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто КАК ВесНетто,
	|	ПеремещениеТоваров.Автомобиль КАК Автомобиль
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяПолучатель
	|		ПО ПеремещениеТоваров.СкладПолучатель = СкладыКонтактнаяПолучатель.Ссылка
	|			И (СкладыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО ПеремещениеТоваров.СкладОтправитель = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ПеремещениеТоваровТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ПеремещениеТоваровТовары.Количество) КАК ВесНетто,
	|			ПеремещениеТоваровТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ПеремещениеТоваровТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ПеремещениеТоваровТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПеремещениеТоваровТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ПеремещениеТоваров.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	ПеремещениеТоваров.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Номер,
	|	ЗаказКлиента.Дата,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Контрагент,
	|	ЗаказКлиента.Организация,
	|	ЗаказКлиента.Организация.Префикс,
	|	"""",
	|	"""",
	|	ЗаказКлиента.Организация.ТекущийРукоВодитель,
	|	ЗаказКлиента.Организация.ТекущаяДолжностьРуководителя,
	|	ЗаказКлиента.Организация.ТекущийГлавныйБухгалтер,
	|	&Перевозчик,
	|	&Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяИнформация.Представление,
	|	"""",
	|	ВложенныйЗапрос.ВесНетто,
	|	&Автомобиль
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|			И ЗаказКлиента.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА ЗаказКлиентаТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * ЗаказКлиентаТовары.Количество) КАК ВесНетто,
	|			ЗаказКлиентаТовары.Ссылка КАК Ссылка
	|		ИЗ
	|			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			ЗаказКлиентаТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказКлиентаТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаказКлиента.Ссылка = ВложенныйЗапрос.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ПО (КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|			И ЗаказКлиента.Контрагент = КонтрагентыКонтактнаяИнформация.Ссылка
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Номер
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ЗаказКлиента = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ РеализацияТоваровУслуг.ЗаказКлиента.Дата
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация.Префикс,
	|	РеализацияТоваровУслуг.Склад.ТекущийОтветственный,
	|	РеализацияТоваровУслуг.Склад.ТекущаяДолжностьОтветственного,
	|	РеализацияТоваровУслуг.Организация.ТекущийРукоВодитель,
	|	РеализацияТоваровУслуг.Организация.ТекущаяДолжностьРуководителя,
	|	РеализацияТоваровУслуг.Организация.ТекущийГлавныйБухгалтер,
	|	РеализацияТоваровУслуг.Перевозчик,
	|	РеализацияТоваровУслуг.Водитель,
	|	СкладыКонтактнаяОтправитель.Представление,
	|	КонтрагентыКонтактнаяПолучатель.Представление,
	|	РеализацияТоваровУслуг.СрокДоставки,
	|	ВложенныйЗапрос.ВесНетто,
	|	РеализацияТоваровУслуг.Автомобиль
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяПолучатель
	|		ПО РеализацияТоваровУслуг.Контрагент = КонтрагентыКонтактнаяПолучатель.Ссылка
	|			И (КонтрагентыКонтактнаяПолучатель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяОтправитель
	|		ПО РеализацияТоваровУслуг.Склад = СкладыКонтактнаяОтправитель.Ссылка
	|			И (СкладыКонтактнаяОтправитель.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСклада))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|			СУММА((ВЫРАЗИТЬ(ВЫБОР
	|						КОГДА НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL 
	|								ИЛИ НоменклатураДополнительныеРеквизиты.Значение = 0
	|							ТОГДА РеализацияТоваровУслугТовары.Номенклатура.Вес
	|						ИНАЧЕ НоменклатураДополнительныеРеквизиты.Значение
	|					КОНЕЦ КАК ЧИСЛО(15, 3))) * РеализацияТоваровУслугТовары.Количество) КАК ВесНетто
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|				ПО РеализацияТоваровУслугТовары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|					И (НоменклатураДополнительныеРеквизиты.Свойство.Наименование = ""Вес брутто"")
	|		ГДЕ
	|			РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияТоваровУслугТовары.Ссылка) КАК ВложенныйЗапрос
	|		ПО РеализацияТоваровУслуг.Ссылка = ВложенныйЗапрос.Ссылка
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)
	|ИТОГИ ПО
	|	ПунктРазгрузки";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Перевозчик", Перевозчик1);
	Запрос.УстановитьПараметр("Водитель", Водитель1ПоУмолчанию);
	Запрос.УстановитьПараметр("Автомобиль", АвтомобильПоУмолчанию);

	РезультатЗапроса = Запрос.Выполнить();
	//ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	//
	ВыборкаПунктов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// это самый верхний уровень - по машинкам
	Автомобиль = АвтомобильПоУмолчанию;
	//общийвес = СтрокаМаршрута.вес;
	// Для Строки заказов заведем строку
	СтрокаЗаказов="";
	СтрокаПеремещений="";
	СтрокаПеремещенийДата="";
	СтрокаРеализацийДата = "";
	МассаНетто = 0;//СтруктураПараметров.Вес;
	//ПунктПогрузки = "Новосибирская обл, Новосибирск г, Карьер Мочище мкр, Кубовая ул, дом № 68";
	
	//************    Согласно логики консультанта-аналитика Котлячковой брать склад-отправитель - первая строка из ЗНО
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказНаОтгрузкуЗаказы.Склад
		|ИЗ
		|	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
		|ГДЕ
		|	ЗаказНаОтгрузкуЗаказы.Ссылка = &ЗНО";
		
		Запрос.УстановитьПараметр("ЗНО", Зно1);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			Если ЗначениеЗаполнено(Рез.Склад) Тогда
				СкладОтправитель = Рез.Склад;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	

	ПунктПогрузки = ПолучитьАдресМагазина(Справочники.Склады.НайтиПоНаименованию("Основной РЦ (WMS)"));
	ПунктРазгрузки = ПолучитьАдресМагазина(Справочники.Склады.НайтиПоНаименованию("НСК Основной РЦ (WMS) - ТЛМ2"));
	//
	ДанныеДляПечати = Новый ТаблицаЗначений;
	ДанныеДляПечати.Колонки.Добавить("ПунктРазгрузки");
	ДанныеДляПечати.Колонки.Добавить("ВесНетто");
	СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(СтрокаМаршрута.ЗНО.Перевозчик, ТекущаяДата());
	
	Пока ВыборкаПунктов.Следующий() Цикл
		ОбщаяВыборка = ВыборкаПунктов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		НоваяСтрока = ДанныеДляПечати.Добавить();
		НоваяСтрока.ПунктРазгрузки = ВыборкаПунктов.ПунктРазгрузки;
		//НоваяСтрока.ВесНетто = ВыборкаПунктов.ВесНетто;
		ВесПогрузки=0;
		Пока ОбщаяВыборка.Следующий() Цикл
			Если ВесПогрузки = 0 тогда
				Область1.параметры.Пункт0_Номер = "ТН"+ОбщаяВыборка.НомерЗаказа;
				Область1.параметры.Пункт0_Дата = Формат(ТекущаяДата(), "ДЛФ=Д");
			КонецЕсли;
			
			
			// присвоим общие значения Для ТТН
			СтрокаЗаказов = СтрокаЗаказов + ОбщаяВыборка.НомерЗаказа + " от " + формат(ОбщаяВыборка.ДатаЗаказа,"ДФ=dd.MM.yy") + ";";
			СтрокаПеремещений = СтрокаПеремещений + ОбщаяВыборка.номер + ";";
 			Если ТипЗнч(ОбщаяВыборка.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				СтрокаПеремещенийДата = СтрокаПеремещенийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			Иначе
				СтрокаРеализацийДата = СтрокаРеализацийДата + ОбщаяВыборка.номер + " от " + формат(ОбщаяВыборка.Дата,"ДФ=dd.MM.yy") + ";";
			КонецЕсли;
			СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузополучатель,  ОбщаяВыборка.Дата);
			СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Грузоотправитель, ОбщаяВыборка.Дата);
			//СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Перевозчик, ОбщаяВыборка.Дата);
			
			СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ОбщаяВыборка.Водитель, ОбщаяВыборка.Дата);
			ОбщийГрузоотправитель = ОбщаяВыборка.Грузополучатель;
			ОбщийГрузополучатель =  ОбщаяВыборка.Грузополучатель;
			ОбщийПеревозчик =       ОбщаяВыборка.Перевозчик;
			ОбщийВодитель = СтрокаМаршрута.Водитель;
			Если СокрЛП(ПунктПогрузки) = "" Тогда
				ПунктПогрузки = ОбщаяВыборка.ПунктПогрузки;
			КонецЕсли;
			ВесПогрузки = ВесПогрузки + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
			МассаНетто = МассаНетто + ?(ОбщаяВыборка.ВесНетто = null или ОбщаяВыборка.ВесНетто = 0, 0, ОбщаяВыборка.ВесНетто);
		КонецЦикла;
		НоваяСтрока.ВесНетто = ВесПогрузки;
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		Если Общийгрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или ОбщийГрузополучатель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			Область1.Параметры.Пункт2_1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
			"ПолноеНаименование,ИНН,ФактическийАдрес");
		Иначе
			//ОбластьМакета.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			Область1.Параметры.Пункт2_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе,  //ninch 23.12.2011
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		КонецЕсли;
		
		
		// 18.01.2021 +
		Попытка
			Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				
			Иначе
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			КонецЕсли;
		Исключение
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		КонецПопытки;
		
		
		Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес");
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				//ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
	
		//-
		
		
		Если ИнойПеревозчикЧерезКаргомарт тогда
			Область1.Параметры.Пункт1_2 = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Справочники.Контрагенты.НайтиПоНаименованию("Бриджтаун фудс ЗАО"), ТекущаяДата()), 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Область1.Параметры.Пункт1а_1 = ПредставлениеГрузоотправителя;
			Область1.Параметры.Пункт1_3 = Истина;
		Иначе	
			Если ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или ОбщийГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				//ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				//"ПолноеНаименование,ИНН,ФактическийАдрес");
				Область1.Параметры.Пункт1_1 = ПредставлениеГрузоотправителя;
				//Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			Иначе
				//ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				//"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				////ОбластьМакета.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				Область1.Параметры.Пункт1_2 = ПредставлениеГрузоотправителя; //ninch 23.12.2011
				//Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	
	// и счас все напечатаем Для этого автомобиля
	Область1.Параметры.Пункт3_1	= "Пищевая продукция";
	
	ФормСтрока			= "Л = ru_RU; ДП = Истина";
	ПарПредмета			= "килограмм,килограмма,килограммов,м,грамм,грамма,граммов,м,3";
	ПрописьМассаНетто	= ЧислоПрописью(МассаНетто, ФормСтрока, ПарПредмета);
	
	//Область1.Параметры.Пункт0_1 = СтрокаПеремещений;
	Область1.Параметры.Пункт0_2 = СтрокаЗаказов;
	
	Область1.Параметры.Пункт3_3	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" ("+ПрописьМассаНетто+")";
	Область1.Параметры.Пункт3_4	= "Груз не опасен";
	
	Пункт4_1 ="";
	
	Если Не ПустаяСтрока(СтрокаПеремещенийДата) тогда
		Пункт4_1	= "ТОРГ-13 № "+СтрокаПеремещенийДата;//СокрЛП(ДанныеПечати.Номер)+" от "+Формат(ДанныеПечати.Дата,"ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	Если не ПустаяСтрока(СтрокаРеализацийДата) тогда
		Если не ПустаяСтрока(Пункт4_1) тогда
			Пункт4_1 = Пункт4_1+Символы.ПС;
		КонецЕсли;
		Пункт4_1	=Пункт4_1 + "ТОРГ-12 № "+СтрокаРеализацийДата;
	КонецЕсли;
	
	Область1.Параметры.Пункт4_1 = Пункт4_1;
	
	//Область1.параметры.Пункт4_3 = СтрокаЗаказов;
	
	//ОбластьМакета.Параметры.Пункт6_5	= "Масса нетто "+Формат(МассаНетто,"ЧДЦ=3")+" кг.";
	
	// это по Пунктам погрузки
	
	ТабДокумент.Вывести(Область1);             
	// ЛВО 12.05.2020 проверка доверенности +
	СтрокаДоверенность =  "Бухгалтер-оператор " + ПараметрыСеанса.ТекущийПользователь.Наименование;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПользователиДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
	               |ГДЕ
	               |	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь
	               |	И ПользователиДополнительныеРеквизиты.Свойство.Наименование = &Свойство";
	Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Свойство", "Информация о доверенности");
	РезультатДов = Запрос.Выполнить();
	Если не РезультатДов.Пустой() тогда
		ВыборкаДоверенность = РезультатДов.Выбрать();
		Пока ВыборкаДоверенность.Следующий() цикл
			 Доверенность = ВыборкаДоверенность.Значение;
		 КонецЦикла;
		 СтрокаДоверенность = СтрокаДоверенность + " по доверенности " + Доверенность;
	КонецЕсли;
	
	//-
	Для Каждого Запись2 из ДанныеДляПечати Цикл
		Область2.Параметры.Пункт6_5	= "Масса нетто "+Формат(Запись2.Веснетто,"ЧДЦ=3")+" кг.";
		Область2.Параметры.Пункт6_1 = ПунктПогрузки;
		
		ПредставлениеГрузоотправителяУкороченые = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
			"ПолноеНаименование,ИНН");
		
		Область2.Параметры.Пункт6_10 =ПредставлениеГрузоотправителя;//Укороченые+символы.ПС+ ПунктПогрузки;
		
		Область2.Параметры.Пункт7_1 = ПредставлениеГрузоотправителяУкороченые+символы.ПС+ПунктРазгрузки;
		// ЛВО 12.05.2020 +
		Область2.Параметры.Пункт6_6 =  СтрокаДоверенность; 
		//
		ТабДокумент.Вывести(Область2);
	КонецЦикла;
	
	Область3.Параметры.Пункт8_1 = "В соответствии с договором";
	Область3.Параметры.Пункт8_4 = "В соответствии с договором";
	Область3.Параметры.Пункт8_5 = "В соответствии с договором";

	ТабДокумент.Вывести(Область3);
	// 130228 колодина по указанию Хританцева и Глумова
	//ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	Попытка
		Если общийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или ОбщийПеревозчик.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_1 = ПредставлениеПеревозчика;
		Иначе
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
			"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
			Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
		КонецЕсли;
	Исключение
		ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
		"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
		Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
		Область4.Параметры.Пункт10_2 = ПредставлениеПеревозчика;
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(СтрокаМаршрута.Водитель) Тогда
		ПредставлениеВодителя  = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Водитель1ПоУмолчанию);
		ПредставлениеВодителя2 = ?(ЗначениеЗаполнено(Водитель2ПоУмолчанию), ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Водитель2ПоУмолчанию), "");
		ТелефонВодителя        = УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Водитель1ПоУмолчанию, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица);
		ТелефонВодителя2       = ?(ЗначениеЗаполнено(Водитель2ПоУмолчанию), УправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(Водитель2ПоУмолчанию, Справочники.ВидыКонтактнойИнформации.МобильныйТелефонФизическогоЛица), "");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Водитель по маршруту!");
		Возврат ТабДокумент;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ТелефонВодителя)
		И ЗначениеЗаполнено(ПредставлениеВодителя) Тогда
		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя;
	КонецЕсли;
	
	ПредставлениеВодителя = "" + ПредставлениеВодителя + " / " + ПредставлениеВодителя2 + ", " + ТелефонВодителя2;
	//Если ЗначениеЗаполнено(ПредставлениеВодителя2) Тогда
	//	ПредставлениеВодителя = ПредставлениеВодителя + " / " + ПредставлениеВодителя2;// + ", " + ТелефонВодителя;
	//	Если ЗначениеЗаполнено(ТелефонВодителя2) Тогда
	//		ПредставлениеВодителя = ПредставлениеВодителя + ", " + ТелефонВодителя2;
	//	КонецЕсли;
	
	//КонецЕсли;	
	
	
	Область4.Параметры.Пункт10_4 = ПредставлениеВодителя;
	Область4.Параметры.Пункт11_1 = АвтомобильПоУмолчанию.Марка;
	Область4.Параметры.Пункт11_2 = АвтомобильПоУмолчанию.код;
	Если НЕ ИнойПеревозчикЧерезКаргомарт и Найти(ПредставлениеПеревозчика,"Бриджтаун") = 0 Тогда
		Область4.Параметры.Пункт11_3 = "";
	Иначе
		Область4.Параметры.Пункт11_3 = "1";
	КонецЕсли ;	
	Область4.Параметры.Пункт15_1 =СтрокаДоверенность; //Грузоотправитель +"   "+ Формат(ТекущаяДата(), "ДЛФ=Д");
	//Область4.Параметры.Пункт15_2 = Перевозчик1;
	Область4.Параметры.Пункт16_1 = "В соответствии с договором"; 
	Область4.Параметры.Пункт16_2 = ПредставлениеГрузоотправителя;
	Область4.Параметры.Пункт16_3 = СтрокаДоверенность;
	Область4.Параметры.Пункт16_5 = ПредставлениеПеревозчика;
	Область4.Параметры.Пункт16_7 = Формат(ТекущаяДата(), "ДЛФ=Д");
	
	ТабДокумент.Вывести(Область4);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	// получим общие данные Для печати ТТН
	СохранитьДанныеОПечати(МассивДокументов, "Транспортная накладная", СтрокаМаршрута.ЗНО, ТабДокумент.КоличествоЭкземпляров);
	
	возврат табдокумент;
		
КонецФункции // СформироватьПечатнуюФормуРеестраМаршрутныхЛистов()

&НаКлиенте
Процедура ВыделитьАлкоЗаказы(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда	
		ВыделитьАлкоЗаказыНаСервере();
		СвернутьРазвернутьДерево();
	КонецЕсли;
КонецПроцедуры

 &НаСервере
 Процедура ВыделитьАлкоЗаказыНаСервере()
	АлкоСклад = Справочники.Склады.НайтиПоНаименованию("Алкоголь-Основной РЦ(WMS)");
	Если АлкоСклад <> Справочники.Склады.ПустаяСсылка() тогда
		ПолучимДерево = РеквизитФормыВЗначение("ЗНО");	
		Для Каждого запись из получимдерево.Строки Цикл
			Для Каждого запись1 из запись.Строки Цикл
				Если запись1.ДатаВыезда = АлкоСклад тогда
					запись1.Пометка = Истина;
					Запись.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(получимдерево,"ЗНО");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтборДляНалоговой(Команда)
	
	ОповещениеПриЗакрытии = Новый ОписаниеОповещения("ОтборДляНалоговойПослеВыбораПараметров", ЭтаФорма);
	
	ОткрытьФорму("ВнешняяОбработка.АРМОператораОтгрузки.Форма.ФормаОтбораДляНалоговой", , , , , , ОповещениеПриЗакрытии); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДляНалоговойПослеВыбораПараметров(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьДеревоДляНалоговойНаСервере(Результат);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДляНалоговойНаСервере(ПараметрыОтбора)
	
	ТабРеестров = РеквизитФормыВЗначение("РО");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала",    ПараметрыОтбора.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПараметрыОтбора.ДатаОкончания);
	Запрос.УстановитьПараметр("Перевозчик",    ПараметрыОтбора.Перевозчик);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка
	               |ПОМЕСТИТЬ втРеестры
	               |ИЗ
	               |	Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |ГДЕ
	               |	РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И РеестрОтгрузкиЗаказыНаОтгрузку.Перевозчик = &Перевозчик
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА (ВЫРАЗИТЬ(ЕСТЬNULL(ДопИдентификатор.Значение, """") КАК СТРОКА(50))) = """"
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК СкладWMS,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка КАК ЗаказНаОтгрузку,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль КАК Автомобиль,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Водитель КАК Водитель,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.ВремяВыезда КАК ДатаВыезда,
	               |	ЗаказНаОтгрузкуЗаказы.Заказ,
	               |	ЗаказНаОтгрузкуЗаказы.Перемещение,
	               |	ЗаказНаОтгрузкуЗаказы.Склад,
	               |	ЗаказНаОтгрузкуЗаказы.Получатель КАК Магазин,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено)
	               |				ИЛИ ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.ВОтгрузке)
	               |				ИЛИ (ВЫРАЗИТЬ(ЕСТЬNULL(ДопИдентификатор.Значение, """") КАК СТРОКА(50))) = """"
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК пАх,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Заказ ССЫЛКА Документ.ЗаказПоставщику
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Заказ.СкладОтправитель = &СкладыQP5
	               |					ТОГДА ИСТИНА
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Перемещение ССЫЛКА Документ.ПеремещениеТоваров
	               |						И ЗаказНаОтгрузкуЗаказы.Перемещение <> ЗНАЧЕНИЕ(Документ.ПеремещениеТоваров.ПустаяСсылка)
	               |					ТОГДА ИСТИНА
	               |				КОГДА ЗаказНаОтгрузкуЗаказы.Перемещение ССЫЛКА Документ.РеализацияТоваровУслуг
	               |							И ЗаказНаОтгрузкуЗаказы.Перемещение <> ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	               |						ИЛИ ВложенныйЗапрос.ОбобщенныйДокумент
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК п1С,
	               |	ДополнительныеСведенияШК.Значение КАК НомерМЛ,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДополнительныеСведенияШК.Значение, """") = """"
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Напечатано,
	               |	ВЫБОР
	               |		КОГДА НЕ ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик
	               |		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведенияПеревозчик.Значение КАК Справочник.Контрагенты).Наименование, """")
	               |	КОНЕЦ КАК Перевозчик,
	               |	ЕСТЬNULL(ДополнительныеСведенияКоличествоПаллет.Значение, """") КАК КоличествоПалет,
	               |	ВЫРАЗИТЬ(ЗаказНаОтгрузкуЗаказы.Получатель.Наименование КАК СТРОКА(4)) КАК ПолучательПредставление,
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка.Водитель2,
	               |	ВЫБОР
	               |		КОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаОтгрузку.Отгружено)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Отгружен,
	               |	ВложенныйЗапрос.ОбобщенныйДокумент
	               |ИЗ
	               |	Документ.ЗаказНаОтгрузку.Заказы КАК ЗаказНаОтгрузкуЗаказы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопИдентификатор
	               |		ПО ЗаказНаОтгрузкуЗаказы.Склад = ДопИдентификатор.Объект
	               |			И (ДопИдентификатор.Свойство.Наименование = ""ИдентификаторСинхронизации"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияШК
	               |		ПО (ДополнительныеСведенияШК.Свойство.Наименование = ""Штрихкод документа"")
	               |			И ЗаказНаОтгрузкуЗаказы.Перемещение = ДополнительныеСведенияШК.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияПеревозчик
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведенияПеревозчик.Объект КАК Справочник.ТранспортныеСредства)) = ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль)
	               |			И (ДополнительныеСведенияПеревозчик.Свойство.Наименование = ""Контрагент"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведенияКоличествоПаллет
	               |		ПО ((ВЫРАЗИТЬ(ДополнительныеСведенияКоличествоПаллет.Объект КАК Справочник.ТранспортныеСредства)) = ЗаказНаОтгрузкуЗаказы.Ссылка.Автомобиль)
	               |			И (ДополнительныеСведенияКоличествоПаллет.Свойство.Наименование = ""КоличествоПалет"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказНаПеремещение.Ссылка КАК Заказ,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказНаПеремещениеТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ) КАК неОтменено,
	               |			ЛОЖЬ КАК ОбобщенныйДокумент
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	               |					ПО (ЗаказНаПеремещениеТовары.Ссылка = ЗаказНаПеремещение.Ссылка)
	               |						И (ЗаказНаПеремещениеТовары.Отменено = ЛОЖЬ)
	               |				ПО (ЗаказНаПеремещение.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В
	               |					(ВЫБРАТЬ
	               |						втРеестры.Ссылка
	               |					ИЗ
	               |						втРеестры)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказНаПеремещение.Ссылка
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЗаказКлиента.Ссылка,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказКлиентаТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ),
	               |			ЕСТЬNULL(ВЫРАЗИТЬ(КонтрагентыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |					ПО (ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка)
	               |						И (ЗаказКлиентаТовары.Отменено = ЛОЖЬ)
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ДополнительныеРеквизиты КАК КонтрагентыДополнительныеРеквизиты
	               |					ПО ЗаказКлиента.Контрагент = КонтрагентыДополнительныеРеквизиты.Ссылка
	               |						И (КонтрагентыДополнительныеРеквизиты.Свойство.Наименование = ""ОбобщённыйДокумент"")
	               |				ПО (ЗаказКлиента.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В
	               |					(ВЫБРАТЬ
	               |						втРеестры.Ссылка
	               |					ИЗ
	               |						втРеестры)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказКлиента.Ссылка,
	               |			ЕСТЬNULL(ВЫРАЗИТЬ(КонтрагентыДополнительныеРеквизиты.Значение КАК БУЛЕВО), ЛОЖЬ)
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЗаказПоставщику.Ссылка,
	               |			МАКСИМУМ(ВЫБОР
	               |					КОГДА НЕ ЗаказПоставщикуТовары.Отменено
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ ЛОЖЬ
	               |				КОНЕЦ),
	               |			ЛОЖЬ
	               |		ИЗ
	               |			Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |					ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |					ПО (ЗаказПоставщикуТовары.Ссылка = ЗаказПоставщику.Ссылка)
	               |						И (ЗаказПоставщикуТовары.Отменено = ЛОЖЬ)
	               |				ПО (ЗаказПоставщику.Ссылка = РеестрОтгрузкиЗаказыНаОтгрузку.Заказ)
	               |		ГДЕ
	               |			РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В
	               |					(ВЫБРАТЬ
	               |						втРеестры.Ссылка
	               |					ИЗ
	               |						втРеестры)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказПоставщику.Ссылка) КАК ВложенныйЗапрос
	               |		ПО ЗаказНаОтгрузкуЗаказы.Заказ = ВложенныйЗапрос.Заказ
	               |ГДЕ
	               |	ЗаказНаОтгрузкуЗаказы.Ссылка В
	               |			(ВЫБРАТЬ
	               |				РеестрОтгрузкиЗаказыНаОтгрузку.ЗаказНаОтгрузку
	               |			ИЗ
	               |				Документ.РеестрОтгрузки.ЗаказыНаОтгрузку КАК РеестрОтгрузкиЗаказыНаОтгрузку
	               |			ГДЕ
	               |				РеестрОтгрузкиЗаказыНаОтгрузку.Ссылка В
	               |					(ВЫБРАТЬ
	               |						втРеестры.Ссылка
	               |					ИЗ
	               |						втРеестры))
	               |	И НЕ ЗаказНаОтгрузкуЗаказы.СкладскойСтатус = ЗНАЧЕНИЕ(Перечисление.СкладскиеСтатусы.Отменен)
	               |	И ВЫБОР
	               |			КОГДА НЕ ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |				ТОГДА ЗаказНаОтгрузкуЗаказы.Ссылка.Перевозчик
	               |			ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ДополнительныеСведенияПеревозчик.Значение КАК Справочник.Контрагенты).Наименование, """")
	               |		КОНЕЦ = &Перевозчик
	               |	И ЕСТЬNULL(ВложенныйЗапрос.неОтменено, ЛОЖЬ) = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаВыезда,
	               |	ПолучательПредставление
	               |ИТОГИ
	               |	МАКСИМУМ(Автомобиль),
	               |	МАКСИМУМ(Водитель),
	               |	МАКСИМУМ(ДатаВыезда),
	               |	МИНИМУМ(пАх),
	               |	МИНИМУМ(п1С),
	               |	МАКСИМУМ(НомерМЛ),
	               |	МИНИМУМ(Напечатано),
	               |	МАКСИМУМ(Перевозчик),
	               |	МАКСИМУМ(КоличествоПалет),
	               |	МАКСИМУМ(Отгружен)
	               |ПО
	               |	ЗаказНаОтгрузку";
	
				   
	Запрос.УстановитьПараметр("СкладыQP5", Справочники.Склады.НайтиПоНаименованию("КроссДокинг QP5 О005 Омск"));
	Рез = Запрос.Выполнить();
	
	Дерево = РеквизитФормыВЗначение("ЗНО");
	Дерево.Строки.Очистить();
	
	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ЗаказНаОтгрузку");
	Пока Выб1.Следующий() Цикл
		Стр1 = Дерево.Строки.Добавить();
		Стр1.пАх = Выб1.пАх;
		Стр1.п1С = Выб1.п1С;
		Стр1.Отгружен = Выб1.Отгружен;
		Стр1.ЗНО = Выб1.ЗаказНаОтгрузку;
		Стр1.Автомобиль = Выб1.Автомобиль;
		Стр1.Водитель = Выб1.Водитель;
		Стр1.Водитель2 = Выб1.Водитель2;
		Стр1.ДатаВыезда = Выб1.ДатаВыезда;
		Стр1.Напечатано = Выб1.Напечатано;
		Стр1.Перевозчик = Выб1.Перевозчик;
		Стр1.КоличествоПалет = Выб1.КоличествоПалет;
		Стр1.НомерМЛ = Выб1.НомерМЛ;
		Стр1.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		//Стр1.НомерМЛ = Выб1.НомерМЛ;
		
		Выб2 = Выб1.Выбрать();
		Пока Выб2.Следующий() Цикл
			Стр2 = Стр1.Строки.Добавить();
			Стр2.пАх        = Выб2.пАх;
			Стр2.п1С        = Выб2.п1С;
			Стр2.ЗНО        = Выб2.Заказ;
			Стр2.Автомобиль = Выб2.Перемещение;
			Стр2.Водитель   = Выб2.Магазин;
			Стр2.ДатаВыезда = Выб2.Склад;
			Стр2.Уровень    = 1;
			Стр2.Напечатано = Выб2.Напечатано;
			Стр2.НомерМЛ	 = Выб2.НомерМЛ;
			Стр2.СкладWMS	 = Выб2.СкладWMS;
			Стр2.Перевозчик = Выб2.Перевозчик;
			Стр2.КоличествоПалет = Выб2.КоличествоПалет;
			Стр2.обобщенныйДокумент = Выб2.обобщенныйДокумент;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ЗНО");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПечатьДляНалоговой(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаЗНО" Тогда
		
		СтруктураЗНО = Новый Структура("ЗНО", ?(Не Элементы.ЗНО.ТекущиеДанные = Неопределено, 
		?(ТипЗнч(Элементы.ЗНО.ТекущиеДанные.ЗНО) = Тип("ДокументСсылка.ЗаказНаОтгрузку"), Элементы.ЗНО.ТекущиеДанные.ЗНО, Элементы.ЗНО.ТекущиеДанные.ПолучитьРодителя().ЗНО) 
		, Неопределено));
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			ИндексТекущейСтроки = Элементы.ЗНО.ТекущиеДанные.ПолучитьИдентификатор();//Элементы.ЗНО.ТекущаяСтрока;//ЗНО.ПолучитьЭлементы().Индекс(Элементы.ЗНО.ТекущиеДанные);
		КонецЕсли;
		
		Сообщение = "";
		Если Отладка тогда
			Отказ = ЛОжь;
		ИНаче	
			Отказ = ПроверкаВозможностиПечати(Сообщение);
		КонецЕсли;	
		Если Отказ И Не Отладка Тогда
			Возврат;
		КонецЕсли;
		
		ПодготовитьСписокПечатныхФорм();
		
		Если СписокПечатныхФорм.ОтметитьЭлементы("Печатать") Тогда
			
			Если СписокПечатныхФорм.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			РазрешитьПечатьНапечатанных = Истина;
			
			ДокументыКПечати = ПечатьНаСервереДляНалоговой();	
			
		КонецЕсли;	
		
		Если Не СтруктураЗНО.Зно = Неопределено Тогда
			
			Для Каждого СтрокаЗНО Из ЗНО.ПолучитьЭлементы() Цикл
				Если СтрокаЗНО.ЗНО = СтруктураЗНО.ЗНО Тогда
					
					Элементы.ЗНО.ТекущаяСтрока = СтрокаЗНО.ПолучитьИдентификатор();//ИндексТекущейСтроки;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ДокументыКПечати = Неопределено Или ТипЗнч(ДокументыКПечати) = Тип("Массив") И ДокументыКПечати.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для печати");
		Возврат;
	КонецЕсли;
	
	Для Каждого Док Из ДокументыКПечати Цикл
		Если Док.ВысотаТаблицы>0   Тогда
			Док.ПолеСлева = 5;
			Док.ПолеСправа = 5;
			Док.Автомасштаб = Истина;
			Если Не ВыводНаПринтер Тогда
				Док.Показать();
			Иначе
				Если ЗначениеЗаполнено(ПринтерПоУмолчанию) Тогда
					Док.ИмяПринтера = ПринтерПоУмолчанию;
				Иначе
					//Док.ИмяПринтера = ОбщегоНазначенияКлиент.ПолучитьПринтерПоУмолчанию();
				КонецЕсли;
				
				Док.Напечатать(Истина);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;	
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "ГруппаКомплектация" Тогда
		
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Функция ПечатьНаСервереДляНалоговой()
	
	ТабПФ = НастройкаПечати.Выгрузить();//НастройкаПечати.Выгрузить();//РеквизитФормыВЗначение("НастройкаПечати");
	
	ТабПФИтоговая = ТабПФ.Скопировать();
	ТабПФИтоговая.Очистить();
	
	Для Каждого СтрПФ Из ТабПФ Цикл
		Если СтрПФ.Количество>0 Тогда
			Элем = СписокПечатныхФорм.НайтиПоЗначению(СтрПФ.ДокументПечатиИД);
			Если Элем<>Неопределено И Элем.Пометка Тогда
				Стр = ТабПФИтоговая.Добавить();
				ЗаполнитьЗначенияСвойств(Стр,СтрПФ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	ТабПФИтоговая.Сортировать("Порядок");
	
	СтрокиМаршрутов = РеквизитФормыВЗначение("ЗНО");
	
	ДокументыКПечати = Новый Массив;
	
	ТаблицаВетВрача = Новый ТаблицаЗначений;
	ТаблицаВетВрача.Колонки.Добавить("ТД");
	ТаблицаВетВрача.Колонки.Добавить("Код");
	МассивЗНО = Новый Массив; //ЛВО  08.12.2020
	ИтоговыйТабДокТранспортнаяНакладная2020 = Новый ТабличныйДокумент;
	ИтоговыйТабДокТранспортнаяНакладная2022 = Новый ТабличныйДокумент;
	
	//КопияДерева = СтрокиМаршрутов.Скопировать();
	Если СортировкаПоВодителю тогда
		СтрокиМаршрутов.Строки.Сортировать("Водитель");
	КонецЕсли;
	
	
	Для Каждого СтрокаМарш Из СтрокиМаршрутов.Строки Цикл
		Если НЕ СтрокаМарш.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрПФ ИЗ ТабПФИтоговая Цикл
			
			ИмяМакета = СтрПФ.ДокументПечатиИД;
			
			Если ИмяМакета = "ТранспортнаяНакладная" Тогда
				
				//n.chernyshov печать новой формы
				//ТабДок = ПолучитьТранспортнуюНакладную(СтрокаМарш);
				//ТабДок = ПолучитьТранспортнуюНакладную2022(СтрокаМарш);
				//разное заполнение по перевозчикам
				
				ПараметрыФормированияТН = ПолучитьПараметрыФормированияТН();
				ПараметрыФормированияТН.ДляНалоговой = Истина;
				
				ТабДок = ПолучитьТранспортнуюНакладную_01082023(СтрокаМарш, ПараметрыФормированияТН);
				
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ТабДок.КоличествоЭкземпляров = 1;
				Иначе	
					ТабДок.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;
				
				//ЛВО 8.12.2020 +
				//Если НЕ СтрокаМарш.ЗНО.Статус = Перечисления.СтатусыЗаказовНаОтгрузку.Отгружено Тогда
				//	Сообщить("" + СтрокаМарш.ЗНО + "находится в статусе " + СтрокаМарш.ЗНО.Статус + ". Формировать ВСД можно только для документво со статусом ОТГРУЖЕНО.");
				//Иначе
					МассивЗНО.Добавить(СтрокаМарш.ЗНО);
				//КонецЕсли;			
				//-
			ИначеЕсли ИмяМакета = "ТранспортнаяНакладная2020" Тогда
				
				ТабДок = Новый ТабличныйДокумент;
				ТабДокТранспортнаяНакладная2020 = ПолучитьТранспортнуюНакладную2020(СтрокаМарш, Истина);
				ИтоговыйТабДокТранспортнаяНакладная2020.Вывести(ТабДокТранспортнаяНакладная2020);
				ИтоговыйТабДокТранспортнаяНакладная2020.ВывестиГоризонтальныйРазделительСтраниц();
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ИтоговыйТабДокТранспортнаяНакладная2020.КоличествоЭкземпляров = 1;
				Иначе	
					ИтоговыйТабДокТранспортнаяНакладная2020.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;
				
			ИначеЕсли ИмяМакета = "ТранспортнаяНакладная2022" Тогда
				
				ТабДок = Новый ТабличныйДокумент;
				ТабДокТранспортнаяНакладная2022 = ПолучитьТранспортнуюНакладную2022(СтрокаМарш, Истина);
				ИтоговыйТабДокТранспортнаяНакладная2022.Вывести(ТабДокТранспортнаяНакладная2022);
				ИтоговыйТабДокТранспортнаяНакладная2022.ВывестиГоризонтальныйРазделительСтраниц();
				Если СтрокаМарш.Перевозчик = "Бриджтаун фудс ЗАО" тогда
					ИтоговыйТабДокТранспортнаяНакладная2022.КоличествоЭкземпляров = 1;
				Иначе	
					ИтоговыйТабДокТранспортнаяНакладная2022.КоличествоЭкземпляров = СтрПФ.Количество + 1;
				КонецЕсли;

			КонецЕсли;	
			
			
			Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
				МассивТД = Новый Массив;
				МассивТД.Добавить(ТабДок);
			ИначеЕсли ТипЗнч(ТабДок) = Тип("Массив") Тогда
				МассивТД = ТабДок;
			КонецЕсли;
			
			Для Каждого ТабДок Из МассивТД Цикл
				ТабДок.РазборПоКопиям = Истина;
				//Сообщить("" + ТабДок.КоличествоЭкземпляров);
				Если ТабДок.КоличествоЭкземпляров = 0 Тогда // ЛВО 16.10.2019
					ТабДок.КоличествоЭкземпляров = СтрПФ.Количество;
				КонецЕсли;
				//	Сообщить("" + ТабДок.КоличествоЭкземпляров + Символы.Пс + СтрПФ.Количество+ "***");
				ДокументыКПечати.Добавить(ТабДок);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если СортировкаПоВодителю тогда
		СтрокиМаршрутов.Строки.Сортировать("ДатаВыезда");
	КонецЕсли;
	
	
	Если ИтоговыйТабДокТранспортнаяНакладная2020.Области.Количество() > 0 тогда
		 ДокументыКПечати.Добавить(ИтоговыйТабДокТранспортнаяНакладная2020);
	КонецЕсли;
	 
	Если ИтоговыйТабДокТранспортнаяНакладная2022.Области.Количество() > 0 тогда
		 ДокументыКПечати.Добавить(ИтоговыйТабДокТранспортнаяНакладная2022);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(СтрокиМаршрутов,"ЗНО");
	
	ТаблицаВетВрача.Сортировать("Код");
	Для Каждого ТабДок Из ТаблицаВетВрача Цикл
		ДокументыКПечати.Добавить(ТабДок.ТД);
	КонецЦикла;
		
	Возврат ДокументыКПечати;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Если не ЗавершениеРаботы тогда
	//	Если Не ПринтерПоУмолчанию = "" Тогда 
	//		СохранитьНастройкиПечатиПоУмолчанию();
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыводНаПринтерПриИзменении(Элемент) 
	Если Не ПринтерПоУмолчанию = "" Тогда
		СохранитьНастройкиПечатиПоУмолчанию();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПринтерПоУмолчаниюПриИзменении(Элемент)
	Если Не ПринтерПоУмолчанию = "" Тогда
		СохранитьНастройкиПечатиПоУмолчанию();
	КонецЕсли;
КонецПроцедуры





