
#Область ОсновныеМетоды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаПроизводство, "Документ", Заказ, ВидСравненияКомпоновкиДанных.Равно);
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, Склад");
	ЗаказНомер = РеквизитыЗаказа.НомерЗаказаНаСайте;
	СкладЗаказа = РеквизитыЗаказа.Склад;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаПроизводство, "Документ", Заказ, ВидСравненияКомпоновкиДанных.Равно);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаПроизводство, "Склад", СкладЗаказа, ВидСравненияКомпоновкиДанных.Равно);
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаЗаказ, "Документ", Заказ, ВидСравненияКомпоновкиДанных.Равно);
	
	Элементы.ФормаСнятьПризнакТребуетсяОбработка.Доступность = ПолучитьЗначениеТребуетсяОбработка(Заказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

#КонецОбласти


#Область МетодыИнтерфейсаОбщие

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()
	Элементы.ТаблицаЗаказ.Обновить();
	Элементы.ТаблицаПроизводство.Обновить();
	Элементы.ФормаСнятьПризнакТребуетсяОбработка.Доступность = ПолучитьЗначениеТребуетсяОбработка(Заказ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеТребуетсяОбработка(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СтатусыЗаказовДК.СтатусДокумента = ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхЗаказовДК.Отменен)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ СтатусыЗаказовДК.ТребуетсяОбработка
	               |	КОНЕЦ КАК ТребуетсяОбработка
	               |ИЗ
	               |	РегистрСведений.СтатусыЗаказовДК КАК СтатусыЗаказовДК
	               |ГДЕ
	               |	СтатусыЗаказовДК.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Заказ);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатВыборка = РезультатЗапроса.Выбрать();
	РезультатВыборка.Следующий();
	Возврат РезультатВыборка.ТребуетсяОбработка;
	
КонецФункции

#КонецОбласти


#Область ТаблицаПроизводство

&НаКлиенте
Процедура ТаблицаПроизводствоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти


#Область ТаблицаЗаказ

&НаКлиенте
Процедура ТаблицаЗаказВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти


#Область СнятьПризнакТребуетсяОбработка

&НаКлиенте
Процедура СнятьПризнакТребуетсяОбработка(Команда)
	СтруктураПараметров = Новый Структура("Результат, ОписаниеРезультата", Истина, "");
	СнятьПризнакТребуетсяОбработкаНаСервере(СтруктураПараметров);
	Если СтруктураПараметров.Результат = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
		Возврат;
	КонецЕсли;
	ОбновитьФорму();
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакТребуетсяОбработкаНаСервере(СтруктураПараметров)
	
	НЗРС = РегистрыСведений.СтатусыПроизводстваДК.СоздатьНаборЗаписей();
	НЗРС.Отбор.Документ.Установить(Заказ);
	НЗРС.Прочитать();
	ТребуетсяЗаписьСтатусыПроизводства = Ложь;
	Для Каждого МЗРС Из НЗРС Цикл
		Если МЗРС.ТребуетсяОбработка Тогда
			МЗРС.ТребуетсяОбработка = Ложь;
			ТребуетсяЗаписьСтатусыПроизводства = Истина;
		КонецЕсли;
	КонецЦикла;
	НЗРС.ДополнительныеСвойства.Вставить("НЕПишемРСДК", Истина);
	
	НачатьТранзакцию();
	Попытка
		Если ТребуетсяЗаписьСтатусыПроизводства Тогда
			НЗРС.Записать();
		КонецЕсли;
		ДаркКитченСервер.ОбновитьРССтатусЗаказаДК(Заказ, Ложь, , , , Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Ошибка снятия ""Требуется обработка""" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		ЗаписьЖурналаРегистрации("ИМ.СнятиеТребуетсяОбработка", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

