
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ":	 " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	Если Параметры.Свойство("Заказ") Тогда
		Заказ = Параметры.Заказ;
	КонецЕсли;
	
	ПолучитьПерсональныеДанные();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПерсональныеДанные()
	
	ИнициализацияПеременных();

	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "KDVID, ВитринаИнтернетМагазина, URL");
	Если ПустаяСтрока(РеквизитыЗаказа.KDVID) Тогда
		Результат = НСтр("ru = 'KDV ID для заказа не указан'");
		Возврат;
	КонецЕсли;
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") 
		ИЛИ РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
		main_partner_kdvid = "Yarche";
	ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
		И СтрНайти(НРег(РеквизитыЗаказа.URL), "kdvonline") > 0 Тогда
		main_partner_kdvid = "KDV";
	ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
		И СтрНайти(НРег(РеквизитыЗаказа.URL), "toybe") > 0 Тогда
		main_partner_kdvid = "Toybe";
	ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
		И СтрНайти(НРег(РеквизитыЗаказа.URL), "yarcheplus") > 0 Тогда
		main_partner_kdvid = "Yarche";
	Иначе
		main_partner_kdvid = Неопределено;
	КонецЕсли;
	
	СтруктураПерсональныхДанных = KDVID.АвторизоватьсяИПолучитьПерсональныеДанные(РеквизитыЗаказа.KDVID, main_partner_kdvid);
	
	Если ПустаяСтрока(СтруктураПерсональныхДанных.description) Тогда
		Если ТипЗнч(СтруктураПерсональныхДанных.data) = Тип("Структура") Тогда
			Если СтруктураПерсональныхДанных.data.Свойство("name") Тогда
				Имя = СтруктураПерсональныхДанных.data.name;
			КонецЕсли;
			Если СтруктураПерсональныхДанных.data.Свойство("surname") Тогда
				Фамилия = СтруктураПерсональныхДанных.data.surname;
			КонецЕсли;
			Если СтруктураПерсональныхДанных.data.Свойство("status") Тогда
				Статус = СтруктураПерсональныхДанных.data.status;
			КонецЕсли;
			Если СтруктураПерсональныхДанных.data.Свойство("phone") Тогда
				Телефон = СтруктураПерсональныхДанных.data.phone;
			КонецЕсли;
			Если СтруктураПерсональныхДанных.data.Свойство("email") Тогда
				Если ТипЗнч(СтруктураПерсональныхДанных.data.email) = Тип("Структура") И СтруктураПерсональныхДанных.data.email.Свойство("email") Тогда
					email = СтруктураПерсональныхДанных.data.email.email; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат = СтруктураПерсональныхДанных.description;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияПеременных()

	Имя = "";
	Фамилия = "";
	Статус = "";
	Телефон = "";
	email = "";
	Результат = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПриИзменении(Элемент)
	ПолучитьПерсональныеДанные();
КонецПроцедуры

&НаКлиенте
Процедура Перечитать(Команда)
	ПолучитьПерсональныеДанные();
КонецПроцедуры