&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НомерВерсииПриНачалеРедактирования", НомерВерсииПриНачалеРедактирования) Тогда
		НомерВерсииПриНачалеРедактирования = 0;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, Статус, ЭквайринговаяОперация, Доставлен");
	ЗаказНомер 				= СтруктураРеквизитов.НомерЗаказаНаСайте;
	ЭквайринговаяОперация 	= СтруктураРеквизитов.ЭквайринговаяОперация;
	Статус					= СтруктураРеквизитов.Статус;
	Доставлен				= СтруктураРеквизитов.Доставлен;
	
	Если ЗначениеЗаполнено(ЭквайринговаяОперация) ИЛИ Доставлен = Истина Тогда 
		Отказ = Истина;
	КонецЕсли;
	
	Если Статус <> Перечисления.СтатусыЗаказовКлиентов.Закрыт И Статус <> Перечисления.СтатусыЗаказовКлиентов.Согласован Тогда
		Отказ = Истина;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
	               |	ЗаказКлиентаТовары.ПричинаОтмены,
	               |	ЗаказКлиентаТовары.Цена
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка = &Заказ
	               |	И НЕ ЗаказКлиентаТовары.Отменено
	               |	И ЗаказКлиентаТовары.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Заказ", Заказ);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
	ПричинаОтменыПустаяСсылка 	= Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();
	ПричинаОтмены				= Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Отказ");
	
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Очистить();
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыПустаяСсылка, " ");
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтмены, "Отказ");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПоказателиКВозврату();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыНаВозврат(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Заказ", Заказ);
	СтруктураПараметров.Вставить("Результат", Истина);
	СтруктураПараметров.Вставить("ОписаниеРезультата", "");
	
	СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров);
	
	Если НЕ СтруктураПараметров.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
	Иначе
		Предупреждение("Документы успешно изменены");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СообщениеОбОшибке = "";
	Если НЕ СтруктураПараметров.Свойство("Заказ") Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СтрДлина(СообщениеОбОшибке)>0, ", ", "") + "Заказ";
	КонецЕсли;
			
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = "Ошибка входных данных, отсутствуют параметры: " + СообщениеОбОшибке;
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
	
	ТЗ_Возврат = Товары.Выгрузить();
	ТЗ_Возврат.Очистить();
	ТЗ_Возврат.Колонки.Добавить("КоличествоШтук");
	СуммаВозврата = 0;
	ОтменаВсехСтрок = Истина;
	
	Для Каждого СтрокаТЗ Из Товары Цикл
		Если СтрокаТЗ.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
			ОтменаВсехСтрок = Ложь;
			Продолжить;
		КонецЕсли;
		НС = ТЗ_Возврат.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаТЗ);
		НС.КоличествоШтук = 0;
		СуммаВозврата = СуммаВозврата + Окр(СтрокаТЗ.Количество * СтрокаТЗ.Цена,2);
	КонецЦикла;
	
	Если ТЗ_Возврат.Количество() = 0 Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Нет данных для формирования документов на возврат");
		Возврат;
	КонецЕсли;
	
	//МассивДокументовДляПроведения = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	//корректируем заказ
	ЗаказОбъект = СтруктураПараметров.Заказ.ПолучитьОбъект();
	Результат = ОбработкаОбъект.СкорректироватьТоварыЗаказа(ЗаказОбъект, ТЗ_Возврат, СообщениеОбОшибке);
	Если Не Результат Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		Возврат;
	КонецЕсли;		
	Если ОтменаВсехСтрок = Истина Тогда
		ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	КонецЕсли;
		
	ЕстьРТУ = Ложь;
	ЕстьКР = Ложь;
	ЕстьЭО = Ложь;
	
	РТУСсылка = ОбработкаОбъект.ПолучитьРТУЗаказа(СтруктураПараметров.Заказ);
	
	Если НЕ РТУСсылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
		
		//корректируем РТУ
		РТУОбъект = РТУСсылка.ПолучитьОбъект();
		Результат = ОбработкаОбъект.СкорректироватьТоварыРТУ(РТУОбъект, ТЗ_Возврат, Истина, СообщениеОбОшибке);
		Если Не Результат Тогда
			СтруктураПараметров.Вставить("Результат", Ложь);
			СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
			Возврат;
		КонецЕсли;		
		ЕстьРТУ = Истина;
		
		//Создаем Кооректировку регистров на резерв
		КорРегОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		ОбработкаОбъект.СформироватьРезервПоВозвращеннымТоварам(КорРегОбъект, РТУСсылка, ТЗ_Возврат, СообщениеОбОшибке);
		ЕстьКР = Истина;
		
	КонецЕсли;
	
	//ЭО возврат
	Если ЗначениеЗаполнено(ЭквайринговаяОперация) Тогда
		ЭОВозврат = Документы.ОперацияПоПлатежнойКарте.СоздатьДокумент();
		ОбработкаОбъект.СформироватьЭквайринговуюОперациюВозврата(ЭОВозврат, ЭквайринговаяОперация, СуммаВозврата);
		ЕстьЭО = Истина;
	КонецЕсли;	
	
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(СтруктураПараметров.Заказ);
	Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Если ЕстьЭО Тогда
			ЭОВозврат.Записать(РежимЗаписиДокумента.Проведение);
			НС = ЗаказОбъект.Оплаты.Добавить();
			НС.Документ = ЭОВозврат.Ссылка;
			НС.Дата = ТекущаяДата();
			НС.СуммаДокумента = СуммаВозврата;
		КонецЕсли;
		
		ЗаказОбъект.ДополнительныеСвойства.Вставить("ПроверкаДатыЗапретаИзменения", Ложь);
		ЗаказОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
		ЗаказОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);	
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ЕстьРТУ Тогда
			РТУОбъект.ДополнительныеСвойства.Вставить("ПроверкаДатыЗапретаИзменения", Ложь);
			РТУОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
			РТУОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);	
			Если ОтменаВсехСтрок = Истина Тогда
				РТУОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			Иначе
				РТУОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьКР Тогда
			КорРегОбъект.Записать();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщениеОбОшибке = "Ошибка формирования документов изменения заказа через АРМ ИМ:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СообщениеОбОшибке);
		СообщениеОбОшибке = "Ошибка формирования документов изменения заказа через АРМ ИМ:" + Символы.ПС + ОписаниеОшибки();
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПричинаОтменыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеЗаказ.ТекущиеДанные;
	
	Если ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
		СвернутьТовары();
	Иначе
		АлгоритмВозврата(ТекущиеДанные);
	КонецЕсли;
	
	ОбновитьПоказателиКВозврату();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмВозврата(ТекущиеДанные)
	
	КоличествоДляВозврата = ТекущиеДанные.Количество;
	ТекстВопроса = "Сколько вернуть?";
	ОтветПользователя = "";
	ИсходноеКоличество = КоличествоДляВозврата;
	
	Если ВвестиЧисло(КоличествоДляВозврата, ТекстВопроса) Тогда
		
		Если КоличествоДляВозврата > ИсходноеКоличество Тогда
			Предупреждение("Нельзя вернуть больше чем продано!");
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
			СвернутьТовары();
			Возврат;
		КонецЕсли;

		Если КоличествоДляВозврата < 0 Тогда
			Предупреждение("Нельзя вернуть отрицательное количество!");
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
			СвернутьТовары();
			Возврат;
		КонецЕсли;
		
		Если КоличествоДляВозврата < ТекущиеДанные.Количество Тогда
			
			НС = Товары.Добавить();
			НС.Номенклатура = ТекущиеДанные.Номенклатура;
			НС.Количество = ТекущиеДанные.Количество - КоличествоДляВозврата;
			НС.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
			НС.Цена = ТекущиеДанные.Цена;
			
			ТекущиеДанные.Количество = КоличествоДляВозврата;
			
		КонецЕсли;
		
	Иначе
		
		ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
		
	КонецЕсли;
	
	СвернутьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьТовары()
	
	НоменклатураСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.Номенклатура;
	ПричинаОтменыСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.ПричинаОтмены;
	СвернутьТоварыНаСервере();
	Для Каждого СтрокаТаблицы Из Товары Цикл
		Если СтрокаТаблицы.Номенклатура = НоменклатураСтроки 
			И СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыСтроки Тогда
			Элементы.ДанныеЗаказ.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТоварыНаСервере()
	
	ТЗ_Товары = Товары.Выгрузить();
	ТЗ_Товары.Свернуть("Номенклатура, ПричинаОтмены", "Количество, Цена");
	Товары.Загрузить(ТЗ_Товары);
	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиКВозврату()
	
	КоличествоПозицийКВозврату = 0;
	ОбщееКоличествоКВозврату = 0;
	ОбщаяСуммаКВозврату = 0;
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.ПричинаОтмены = ПричинаОтмены Тогда
			КоличествоПозицийКВозврату = КоличествоПозицийКВозврату + 1;
			ОбщееКоличествоКВозврату = ОбщееКоличествоКВозврату + СтрокаТаблицы.Количество;
			ОбщаяСуммаКВозврату = ОбщаяСуммаКВозврату + Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена,2);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.нПоказателиВозвратаИтоги.Заголовок = "Итого к изменению позиций (количество): " + КоличествоПозицийКВозврату + " (" + ОбщееКоличествоКВозврату + "), на сумму " + Формат(ОбщаяСуммаКВозврату,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
