
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	Заказ = Параметры.Ссылка;
	НомерЗаказаНаСайте = Параметры.НомерЗаказаНаСайте;
	ВитринаИнтернетМагазина = Параметры.ВитринаИнтернетМагазина;
	
	Для Сч = 9 По 22 Цикл
		Элементы.ВремяДоставкиСЧас.СписокВыбора.Добавить(Сч);
		Элементы.ВремяДоставкиПоЧас.СписокВыбора.Добавить(Сч);
	КонецЦикла;
	
	Для Сч = 0 По 59 Цикл
		Элементы.ВремяДоставкиСМинута.СписокВыбора.Добавить(Сч);
		Элементы.ВремяДоставкиПоМинута.СписокВыбора.Добавить(Сч);
	КонецЦикла;
	
	Интервал 		= (Параметры.ВремяДоставкиПо - Параметры.ВремяДоставкиС);
	Элементы.ДекорацияТекущийИнтервал.Заголовок = "Интервал доставки: " + Формат(Интервал / 60, "ЧДЦ=0; ЧН=0; ЧГ=0") + " мин";
	ДатаОтгрузки 	= НачалоДня(Параметры.ВремяДоставкиС);
	ВремяДоставкиСЧас = Час(Параметры.ВремяДоставкиС);
	ВремяДоставкиСМинута = Минута(Параметры.ВремяДоставкиС);
	ВремяДоставкиПоЧас = Час(Параметры.ВремяДоставкиПо);
	ВремяДоставкиПоМинута = Минута(Параметры.ВремяДоставкиПо);
	
	ДатаДоставкиС	= Параметры.ВремяДоставкиС;
	ДатаДоставкиПо	= Параметры.ВремяДоставкиПо;

	ТекущаяДатаДоставкиС	= Параметры.ВремяДоставкиС;
	ТекущаяДатаДоставкиПо	= Параметры.ВремяДоставкиПо;
	
	Элементы.ГруппаЯрчеПлюс.Видимость = Ложь;
	Элементы.ГруппаИгрушки.Видимость = Ложь;
	Элементы.ГруппаОЗОН.Видимость = Ложь;
	Элементы.ГруппаПрочие.Видимость = Ложь;
	
	Если ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		Элементы.ГруппаЯрчеПлюс.Видимость = Истина;
	ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		Элементы.ГруппаЯрчеПлюс.Видимость = Истина;
	ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ОЗОН Тогда
		Элементы.ДекорацияТекущиеДатыДоставки.Заголовок = "Текущие даты доставки: " + Формат(ДатаДоставкиС, "ДФ='dd.MM.yyyy HH:mm'") + " - " + Формат(ДатаДоставкиПо, "ДФ='dd.MM.yyyy HH:mm'");
		Элементы.ГруппаОЗОН.Видимость = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ОбменССайтом.Ссылка
		               |ИЗ
		               |	ПланОбмена.ОбменССайтом КАК ОбменССайтом
		               |ГДЕ
		               |	ОбменССайтом.ОбменТоварами = ИСТИНА
		               |	И ОбменССайтом.Витрина = &Витрина";
		Запрос.УстановитьПараметр("Витрина", ВитринаИнтернетМагазина);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			УзелОбмена = ВыборкаДетальныеЗаписи.Ссылка;	
		КонецЦикла;
		
		НастройкиПодключения = Новый Структура;
		ОбменССайтомСобытия.ЗаполнитьНастройкиПодключения(НастройкиПодключения, УзелОбмена);
		ПараметрыОбмена = Новый Структура;
		ПараметрыОбмена.Вставить("НастройкиПодключения", НастройкиПодключения);
		
		ТелоЗапросаСтруктура = Новый Структура("posting_number", НомерЗаказаНаСайте);
		ПараметрыJSON = JSON_1C.ЗаписатьJSON82(ТелоЗапросаСтруктура);
		ТекстОшибки = "";
		
		РезультатВыполненияЗапроса = ОЗОН.ВыполнитьЗапрос(ПараметрыОбмена, ОЗОН.РесурсыЗапроса().ДоступныеДатыДляПереносаДоставки, "POST", , ПараметрыJSON, ТекстОшибки);
		Если РезультатВыполненияЗапроса = Неопределено Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка получения доступных дат для переноса доставки (%1): %2'"), НомерЗаказаНаСайте, ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Элементы.ДекорацияОтказ.Заголовок = "Изменение сроков доставки для заказа запрещено, не смогли получить доступные даты доставки с ОЗОН";
			Элементы.ГруппаПрочие.Видимость = Истина;
			Элементы.ГруппаОЗОН.Видимость = Истина;
		Иначе
			РезультатСтруктура = JSON_1C.ПрочитатьJSON82(РезультатВыполненияЗапроса);
			Элементы.ДекорацияКоличествоОставшихсяПереносов.Заголовок = "Количество оставшихся переносов: " + РезультатСтруктура.remaining_changes_count;
			Элементы.ДекорацияДоступныеДатыДляПереноса.Заголовок = "Доступные даты для переноса: " + Формат(РезультатСтруктура.delivery_interval.begin, "ДФ='dd.MM.yyyy HH:mm'") + " - " + Формат(РезультатСтруктура.delivery_interval.end, "ДФ='dd.MM.yyyy HH:mm'");
			ДатаДоставкиС = РезультатСтруктура.delivery_interval.begin;
			ДатаДоставкиПо = РезультатСтруктура.delivery_interval.end; 
			ДоступнаяДатаС = ДатаДоставкиС;
			ДоступнаяДатаПо = ДатаДоставкиПо;
		КонецЕсли;
		
	Иначе
		Элементы.ГруппаПрочие.Видимость = Истина;
	КонецЕсли;
	
	Элементы.Перенести.Доступность = НЕ Элементы.ГруппаПрочие.Видимость;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПервыйИПоследнийСлотыДоставки()
	ПервыйСлотДоставкиЯрчеПлюс = ДатаОтгрузки + 9*3600;
	ПоследнийСлотДоставкиЯрчеПлюс = ДатаОтгрузки + 21*3600;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПервыйИПоследнийСлотыДоставки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	ТекстОшибки = "";
	Результат = ПеренестиДатыДоставкиНаСервере(ТекстОшибки);
	Если Результат Тогда
		ЭтаФорма.Закрыть();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка изменения сроков доставки: " + Символы.ПС + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПеренестиДатыДоставкиНаСервере(ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		
		НовоеВремяДоставкиС = ДатаОтгрузки + ВремяДоставкиСЧас * 3600 + ВремяДоставкиСМинута * 60;
		НовоеВремяДоставкиПо = ДатаОтгрузки + ВремяДоставкиПоЧас * 3600 + ВремяДоставкиПоМинута * 60;
		
		Если НовоеВремяДоставкиС = ТекущаяДатаДоставкиС И НовоеВремяДоставкиПо = ТекущаяДатаДоставкиПо Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПеренестиЗаказ(НовоеВремяДоставкиС, НовоеВремяДоставкиПо);
		
		//Если НачалоДня(ТекущаяДатаДоставкиС) - НачалоДня(НовоеВремяДоставкиС) <> 0 Тогда
		//	ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(Заказ);
		//КонецЕсли;
		
	//ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.Игрушки Тогда
	//	
	//	Если ДатаДоставкиС = ТекущаяДатаДоставкиС И ДатаДоставкиПо = ТекущаяДатаДоставкиПо Тогда
	//		Возврат Истина;
	//	КонецЕсли;
	//	
	//	ПеренестиЗаказ(ДатаДоставкиС, ДатаДоставкиПо);
		
	ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		
		НовоеВремяДоставкиС = ДатаОтгрузки + ВремяДоставкиСЧас * 3600 + ВремяДоставкиСМинута * 60;
		НовоеВремяДоставкиПо = ДатаОтгрузки + ВремяДоставкиПоЧас * 3600 + ВремяДоставкиПоМинута * 60;
		
		Если НовоеВремяДоставкиС = ТекущаяДатаДоставкиС И НовоеВремяДоставкиПо = ТекущаяДатаДоставкиПо Тогда
			Возврат Истина;
		КонецЕсли;
		
		ПеренестиЗаказ(НовоеВремяДоставкиС, НовоеВремяДоставкиПо);
		ПеренестиЗаписиРегистров(НовоеВремяДоставкиС);
		
		ТекстСообщения = Строка(Заказ) + Символы.ПС + Строка(НомерЗаказаНаСайте) + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + "<b>Перенесено время доставки заказа ДаркКитчен</b>";
		Telegram_Admin.SendMessage(Строка(ОбщегоНазначенияПовтИсп.ПолучитьАббревиатуруТекущейБазы()) + Символы.ПС + ТекстСообщения,, "-728074965", "HTML");
		
	ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ОЗОН Тогда
		
		Если ДатаДоставкиС = ТекущаяДатаДоставкиС И ДатаДоставкиПо = ТекущаяДатаДоставкиПо Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ДатаДоставкиС < ДоступнаяДатаС ИЛИ ДатаДоставкиПо > ДоступнаяДатаПо Тогда
			ТекстОшибки = "Новые даты не попадают в интервал доступных дат";
			Возврат Ложь;
		КонецЕсли;
		
		НастройкиПодключения = Новый Структура;
		ОбменССайтомСобытия.ЗаполнитьНастройкиПодключения(НастройкиПодключения, УзелОбмена);
		ПараметрыОбмена = Новый Структура;
		ПараметрыОбмена.Вставить("НастройкиПодключения", НастройкиПодключения);
		
		НовыйСлотСтруктура = Новый Структура("from, to", ДатаДоставкиС, ДатаДоставкиПо);
		ТелоЗапросаСтруктура = Новый Структура("new_timeslot, posting_number", НовыйСлотСтруктура, НомерЗаказаНаСайте);
		ПараметрыJSON = JSON_1C.ЗаписатьJSON82(ТелоЗапросаСтруктура);                                                           
		
		РезультатВыполненияЗапроса = ОЗОН.ВыполнитьЗапрос(ПараметрыОбмена, ОЗОН.РесурсыЗапроса().ПеренестиДатуДоставки, "POST", , ПараметрыJSON, ТекстОшибки);
		Если РезультатВыполненияЗапроса = Неопределено Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка переноса дат доставки (%1): %2'"), НомерЗаказаНаСайте, ТекстОшибки);
			Возврат Ложь;
		Иначе
			ПеренестиЗаказ(ДатаДоставкиС, ДатаДоставкиПо);
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		ТекстОшибки = "Изменение сроков доставки этого заказа запрещено";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

&НаСервере
Процедура ПеренестиЗаказ(ВремяНачала, ВремяОкончания)
	
	УстановитьПривилегированныйРежим(Истина);
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ЗаказОбъект.ВремяДоставкиС = ВремяНачала;
	ЗаказОбъект.ВремяДоставкиПо = ВремяОкончания;
	
	//если установлены значения доп реквизитов, перепишем их
	СвойствоВремяДоставкиС = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ВремяДоставкиС");
	СвойствоВремяДоставкиПо = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ВремяДоставкиПо");
	Для Каждого ДопРеквизит Из ЗаказОбъект.ДополнительныеРеквизиты Цикл
		Если ДопРеквизит.Свойство = СвойствоВремяДоставкиС Тогда 
			ДопРеквизит.Значение = ВремяНачала;
		КонецЕсли;
		Если ДопРеквизит.Свойство = СвойствоВремяДоставкиПо Тогда 
			ДопРеквизит.Значение = ВремяОкончания;
		КонецЕсли;
	КонецЦикла;	

	ДатаВремяДоставки = "с " + Формат(ВремяНачала, "ДФ = дд.ММ.гггг ЧЧ:мм") + " по " + Формат(ВремяОкончания, "ДФ = дд.ММ.гггг ЧЧ:мм");
	ШаблонКомментария = "Перенос доставки на %1 %2 %3";
	ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + ?(ЗначениеЗаполнено(ЗаказОбъект.Комментарий), Символы.ПС, "") 
											+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонКомментария
																								, ДатаВремяДоставки
																								, СокрЛП(ПараметрыСеанса.ТекущийПользователь)
																								, Строка(ТекущаяДата()));
																								
	Если ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		ЗаказОбъект.ЖелаемаяДатаОтгрузки = НачалоДня(ВремяНачала);
		Если Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
			ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Согласован;
			ЗаказОбъект.Комплектовщик = Неопределено;
			ЗаказОбъект.ТерминалИд = "";
			ЗаказОбъект.ДатаНачалаКомплектовки = Дата(1,1,1);
			ЗаказОбъект.ДатаОкончанияКомплектовки = Дата(1,1,1);
		КонецЕсли;
		ЗаказОбъект.БыстраяДоставка = Ложь;
	ИначеЕсли ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		ЗаказОбъект.ЖелаемаяДатаОтгрузки = НачалоДня(ВремяНачала);
		Если Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
			ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Согласован;
			ЗаказОбъект.Комплектовщик = Неопределено;
			ЗаказОбъект.ТерминалИд = "";
			ЗаказОбъект.ДатаНачалаКомплектовки = Дата(1,1,1);
			ЗаказОбъект.ДатаОкончанияКомплектовки = Дата(1,1,1);
		КонецЕсли;
		ЗаказОбъект.БыстраяДоставка = Ложь;
	КонецЕсли;
	
	Для Каждого СтрТовар из ЗаказОбъект.Товары Цикл
		СтрТовар.ДатаОтгрузки = ЗаказОбъект.ЖелаемаяДатаОтгрузки;
	КонецЦикла;
	
	ЗаказОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
	ЗаказОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьДатуЗапретаРедактирования", Истина);
	ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Рез = ОтправитьЗаказВДеливери(Заказ);
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиЗаписиРегистров(ЖДВ)
	
	НаборЗаписей = РегистрыСведений.СтатусыЗаказовДК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Заказ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// --- при смене статуса, не подразумевается создание Новой записи -----------------------------
		//НоваяЗапись = НаборЗаписей.Добавить();
		//НоваяЗапись.Документ      = ДокЗаказ.Ссылка;
		//НоваяЗапись.СтатусДокумента = СтатусДК;
	Иначе
		НаборЗаписей[0].ЖДВ = ЖДВ;
	КонецЕсли;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("СтатусыЗаказовДК", УровеньЖурналаРегистрации.Ошибка, , Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.СтатусыПроизводстваДК.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Заказ);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		// --- при смене статуса, не подразумевается создание Новой записи -----------------------------
		//НоваяЗапись = НаборЗаписей.Добавить();
		//НоваяЗапись.Документ      = ДокЗаказ.Ссылка;
		//НоваяЗапись.СтатусДокумента = СтатусДК;
	Иначе
		Для Каждого СтрНабора из НаборЗаписей Цикл
			СтрНабора.ЖДВ = ЖДВ;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("НЕПишемРСДК", Истина); 
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("СтатусыПроизводстваДК", УровеньЖурналаРегистрации.Ошибка, , Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

&НаСервере
Функция ОтправитьЗаказВДеливери(ЗаказСсылка)
	Если ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ОчередьОбменаДеливери") = Истина Тогда
		Возврат Истина;
	Иначе
		ДополнительныеОтчетыИОбработки.ОбъектДополнительнойОбработки("ПодключаемыйИнтернетМагазин").ДеливериОтправитьЗаказ(ЗаказСсылка);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПлюсОдинДень(Команда)
	ДатаОтгрузки = ДатаОтгрузки + 24 * 3600;
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСПриИзменении(Элемент)
	ВремяДоставкиПо = ВремяДоставкиС + Интервал;
КонецПроцедуры

&НаКлиенте
Процедура ДатаДоставкиСПриИзменении(Элемент)
	ДатаДоставкиПо = ДатаДоставкиС + Интервал;
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСЧасПриИзменении(Элемент)
	РассчитатьВремяДоставкиПо();
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиСМинутаПриИзменении(Элемент)
	РассчитатьВремяДоставкиПо();
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиПоЧасПриИзменении(Элемент)
	РассчитатьВремяДоставкиС();
КонецПроцедуры

&НаКлиенте
Процедура ВремяДоставкиПоМинутаПриИзменении(Элемент)
	РассчитатьВремяДоставкиС();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВремяДоставкиС();
	
	НовоеВремяДоставкиПо = ДатаОтгрузки + ВремяДоставкиПоЧас * 3600 + ВремяДоставкиПоМинута * 60;
	Если НовоеВремяДоставкиПо > ПоследнийСлотДоставкиЯрчеПлюс Тогда
		НовоеВремяДоставкиПо = ПоследнийСлотДоставкиЯрчеПлюс;
	КонецЕсли;
	НовоеВремяДоставкиС = НовоеВремяДоставкиПо - Интервал;
	Если НовоеВремяДоставкиС < ПервыйСлотДоставкиЯрчеПлюс Тогда
		НовоеВремяДоставкиС = ПервыйСлотДоставкиЯрчеПлюс;
		НовоеВремяДоставкиПо = НовоеВремяДоставкиС + Интервал;
	КонецЕсли;
	
	ЗаполнитьРеквизитыВремениДоставки(НовоеВремяДоставкиС, НовоеВремяДоставкиПо);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВремяДоставкиПо();
	
	НовоеВремяДоставкиС = ДатаОтгрузки + ВремяДоставкиСЧас * 3600 + ВремяДоставкиСМинута * 60;
	Если НовоеВремяДоставкиС < ПервыйСлотДоставкиЯрчеПлюс Тогда
		НовоеВремяДоставкиС = ПервыйСлотДоставкиЯрчеПлюс;
	КонецЕсли;
	НовоеВремяДоставкиПо = НовоеВремяДоставкиС + Интервал;
	Если НовоеВремяДоставкиПо > ПоследнийСлотДоставкиЯрчеПлюс Тогда
		НовоеВремяДоставкиПо = ПоследнийСлотДоставкиЯрчеПлюс;
		НовоеВремяДоставкиС = НовоеВремяДоставкиПо - Интервал;
	КонецЕсли;
	
	ЗаполнитьРеквизитыВремениДоставки(НовоеВремяДоставкиС, НовоеВремяДоставкиПо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыВремениДоставки(ВремяДоставкиС, ВремяДоставкиПо)
	
	ДатаОтгрузки = НачалоДня(ВремяДоставкиС);
	ВремяДоставкиСЧас = Час(ВремяДоставкиС);
	ВремяДоставкиСМинута = Минута(ВремяДоставкиС);
	ВремяДоставкиПоЧас = Час(ВремяДоставкиПо);
	ВремяДоставкиПоМинута = Минута(ВремяДоставкиПо);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	УстановитьПервыйИПоследнийСлотыДоставки();
КонецПроцедуры
