
#Область ОписаниеПеременных 

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервере
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", ЭтотОбъект.Метаданные().Синоним);
	ПараметрыРегистрации.Вставить("Версия", ЭтотОбъект.Метаданные().Комментарий);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", ЭтотОбъект.Метаданные().Имя);
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	ЭтотОбъект.Метаданные().Синоним,
	ЭтотОбъект.Метаданные().Имя,
	"ОткрытиеФормы",
	Истина);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат Команды;
	
КонецФункции

&НаСервере
Процедура ДобавитьКоманду(ТаблицаКоманд, 
	Представление,
	Идентификатор, 
	Использование, 
	ПоказыватьОповещение = Ложь, 
	Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаголовокФормы() Экспорт
	
	Возврат ЭтотОбъект.Метаданные().Синоним +" ("+ ЭтотОбъект.Метаданные().Комментарий + ")";	
	
КонецФункции // ПолучитьЗаголовокФормы()

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#Область Инициализация


#КонецОбласти
