
&НаКлиенте
Процедура Отобрать(Команда)
	
	Если Период.ДатаНачала = Дата(1, 1, 1) Или Период.ДатаОкончания = Дата(1, 1, 1) Или Период.ДатаОкончания - Период.ДатаНачала > 86400 * 100 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период указан неверно!", , "Период");
		Возврат;
	КонецЕсли;
	
	Если Перевозчик.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перевозчик не заполнен!", , "Перевозчик");
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый Структура("ДатаНачала, ДатаОкончания, Перевозчик", Период.ДатаНачала, Период.ДатаОкончания, Перевозчик));
	
КонецПроцедуры
