#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Заголовок = Обработка.Метаданные().Синоним + " (" +Обработка.Метаданные().Комментарий +")"; 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Элементы.ВремяВыполнения.Заголовок = "Время выполнения: "+ПолучитьВремя(Конец-Начало);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИМЯТАБЛИЦЫ
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОписаниеРобота(Команда)
	ОткрытьФорму("ВнешняяОбработка." + ПолучитьИмяОбработки() + ".Форма.МояСправка", ,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
КонецПроцедуры

&НаСервере
Процедура ОсновнаяПроцедураНаСервере()
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	Элементы.ВремяВыполнения.Заголовок = "Время выполнения: "+ПолучитьВремя(Конец-Начало);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПроцедура(Команда)
	ПоказатьОповещениеПользователя("hello world");
	ОсновнаяПроцедураНаСервере();
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИмяОбработки()
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().Имя;
КонецФункции

Функция ПолучитьВремя(Миллисекунды) Экспорт
	
	Часы 	= Цел(Миллисекунды / (60 * 60 * 1000));
	Остаток = Миллисекунды - Часы * 60 * 60 * 1000;
	Минуты 	= Цел(Остаток / (60 * 1000));
	Остаток = Остаток - Минуты * 60 * 1000;
	Секунды = Цел(Остаток / 1000);
	МС 		= Остаток - Секунды * 1000;
	
	Возврат Формат(Часы, "ЧЦ=2;ЧН=;ЧВН=") + ":" +
	Формат(Минуты, "ЧЦ=2;ЧН=;ЧВН=") + ":" + 
	Формат(Секунды, "ЧЦ=2;ЧН=;ЧВН=") + ":" + 
	Формат(МС, "ЧЦ=3;ЧН=;ЧВН=");
	
КонецФункции

#КонецОбласти



