#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Заголовок = Обработка.Метаданные().Синоним + " (" + Обработка.Метаданные().Комментарий + ")";
	
	СформироватьТаблицуУмноженияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Элементы.ВремяВыполнения.Заголовок = "Время выполнения: " + ПолучитьВремя(Конец - Начало);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИМЯТАБЛИЦЫ
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОписаниеРобота(Команда)
	ОткрытьФорму("ВнешняяОбработка." + ПолучитьИмяОбработки() + ".Форма.МояСправка", ,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяПроцедура(Команда)
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	СтрТаблица = "";
	Для Каждого Строка Из ТаблицаУмножения Цикл
		СтрТаблица = СтрТаблица 
			+ Строка.Множитель1 + " x " + Строка.Множитель2 + " = " + Строка.Результат
			+ Символы.ПС;
	КонецЦикла;
	
	ПоказатьОповещениеПользователя("Таблица умножения", , СтрТаблица);
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Элементы.ВремяВыполнения.Заголовок = "Время выполнения: " + ПолучитьВремя(Конец - Начало);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьТаблицуУмноженияНаСервере()
	ТаблицаУмножения.Очистить();
	Для Множ1 = 1 По 9 Цикл
		Для Множ2 = 1 По 9 Цикл
			НоваяСтрока = ТаблицаУмножения.Добавить();
			НоваяСтрока.Множитель1 = Множ1;
			НоваяСтрока.Множитель2 = Множ2;
			НоваяСтрока.Результат = Множ1 * Множ2;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяОбработки()
	Возврат РеквизитФормыВЗначение("Объект").Метаданные().Имя;
КонецФункции

Функция ПолучитьВремя(Миллисекунды) Экспорт
	
	Часы 	= Цел(Миллисекунды / (60 * 60 * 1000));
	Остаток = Миллисекунды - Часы * 60 * 60 * 1000;
	Минуты 	= Цел(Остаток / (60 * 1000));
	Остаток = Остаток - Минуты * 60 * 1000;
	Секунды = Цел(Остаток / 1000);
	МС 		= Остаток - Секунды * 1000;
	
	Возврат Формат(Часы, "ЧЦ=2;ЧН=;ЧВН=") + ":" +
	Формат(Минуты, "ЧЦ=2;ЧН=;ЧВН=") + ":" + 
	Формат(Секунды, "ЧЦ=2;ЧН=;ЧВН=") + ":" + 
	Формат(МС, "ЧЦ=3;ЧН=;ЧВН=");
	
КонецФункции

#КонецОбласти
