&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	ПрочитатьДанныеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "Номер, Дата, НомерЗаказаНаСайте, ДатаЗаказаНаСайте, ЖелаемаяДатаОтгрузки, АдресДоставки, ПокупательФИО, ПокупательТелефон, ПокупательEmail, Комментарий, СтатусПроверки, KDVID, ВитринаИнтернетМагазина, URL");
	
	ЗаказНомер = СтруктураРеквизитов.Номер;
	ЗаказДата = СтруктураРеквизитов.Дата;
	НомерЗаказаНаСайте = СтруктураРеквизитов.НомерЗаказаНаСайте;
	ДатаЗаказаНаСайте = СтруктураРеквизитов.ДатаЗаказаНаСайте;
	ЗаказНомерДата = НомерЗаказаНаСайте + " от " + Формат(ДатаЗаказаНаСайте,"ДФ=дд.ММ.гггг");
	ЖелаемаяДатаОтгрузки = СтруктураРеквизитов.ЖелаемаяДатаОтгрузки;
	АдресДоставки = СтруктураРеквизитов.АдресДоставки;
	ПокупательФИО = СтруктураРеквизитов.ПокупательФИО;
	Телефон = СтруктураРеквизитов.ПокупательТелефон;
	Email = СтруктураРеквизитов.ПокупательEmail;
	Комментарий = СтруктураРеквизитов.Комментарий;
	СтатусПроверки = СтруктураРеквизитов.СтатусПроверки;
	
	Если НЕ ПустаяСтрока(СтруктураРеквизитов.KDVID) Тогда
		
		Если СтруктураРеквизитов.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") Тогда
			main_partner_kdvid = "Yarche";
		ИначеЕсли СтруктураРеквизитов.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
			И СтрНайти(НРег(СтруктураРеквизитов.URL), "kdvonline") > 0 Тогда
			main_partner_kdvid = "KDV";
		ИначеЕсли СтруктураРеквизитов.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
			И СтрНайти(НРег(СтруктураРеквизитов.URL), "toybe") > 0 Тогда
			main_partner_kdvid = "Toybe";
		Иначе
			main_partner_kdvid = Неопределено;		
		КонецЕсли;
	
		СтруктураПерсональныхДанных = KDVID.АвторизоватьсяИПолучитьПерсональныеДанные(СтруктураРеквизитов.KDVID, main_partner_kdvid);
	
		Если ПустаяСтрока(СтруктураПерсональныхДанных.description) Тогда
			Если ТипЗнч(СтруктураПерсональныхДанных.data) = Тип("Структура") Тогда
				Если СтруктураПерсональныхДанных.data.Свойство("name") Тогда
					Имя = СтруктураПерсональныхДанных.data.name;
				КонецЕсли;
				Если СтруктураПерсональныхДанных.data.Свойство("surname") Тогда
					Фамилия = СтруктураПерсональныхДанных.data.surname;
				КонецЕсли;  
				ПокупательФИО = Строка(Фамилия) + ?(ПустаяСтрока(Фамилия) ИЛИ ПустаяСтрока(Имя), "", " ") + Строка(Имя);
				Если СтруктураПерсональныхДанных.data.Свойство("phone") Тогда
					Телефон = СтруктураПерсональныхДанных.data.phone;
				КонецЕсли;
				Если СтруктураПерсональныхДанных.data.Свойство("email") Тогда
					Если ТипЗнч(СтруктураПерсональныхДанных.data.email) = Тип("Структура") И СтруктураПерсональныхДанных.data.email.Свойство("email") Тогда
						Email = СтруктураПерсональныхДанных.data.email.email; 
					КонецЕсли;
				КонецЕсли;    
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
		
	ТЗЗаказыИгрушкиТовары.Очистить();
	
	лТекст = "
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.НаименованиеТовараКлиента,
		|	СУММА(ЗаказКлиентаТовары.Количество) КАК КоличествоВЗаказе,
		|	СУММА(ЕСТЬNULL(РеализацияТоваровУслугТовары.Количество, 0)) КАК КоличествоСобрано,
		|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Цена, ЗаказКлиентаТовары.Цена) КАК Цена,
		|	СУММА(ЕСТЬNULL(РеализацияТоваровУслугТовары.Сумма, 0)) КАК Сумма,
		|	ЕСТЬNULL(РеализацияТоваровУслугТовары.СтавкаНДС, ЗаказКлиентаТовары.СтавкаНДС) КАК СтавкаНДС,
		|	СУММА(ЕСТЬNULL(РеализацияТоваровУслугТовары.СуммаНДС, 0)) КАК СуммаНДС
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ЗаказКлиентаТовары.Ссылка = РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента
		|			И ЗаказКлиентаТовары.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
		|			И (РеализацияТоваровУслугТовары.Ссылка.Проведен)
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.НаименованиеТовараКлиента,
		|	ЕСТЬNULL(РеализацияТоваровУслугТовары.Цена, ЗаказКлиентаТовары.Цена),
		|	ЕСТЬNULL(РеализацияТоваровУслугТовары.СтавкаНДС, ЗаказКлиентаТовары.СтавкаНДС)
		|";
		
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.УстановитьПараметр("ЗаказКлиента", Заказ);

	лВыборка = лЗапрос.Выполнить().Выбрать();

	Пока лВыборка.Следующий() Цикл
		НС = ТЗЗаказыИгрушкиТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,лВыборка)
	КонецЦикла;
	
	ПоследнийНомерВерсииЗаказа = ПоследнийНомерВерсииДокумента(Заказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрушкиЗапретитьОтгрузку(Команда)
	
	Если Заказ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Ложь;
	ТекстОшибки = "";
	
	Если ПоследнийНомерВерсииЗаказа = ПоследнийНомерВерсииДокумента(Заказ) Тогда
		РазрешитьОтгрузкуНаСервере(ЗаказНомер + "_" + Формат(ЗаказДата, "ДФ=yy"), 2, Заказ, Результат, ТекстОшибки);
		Если Результат = Истина Тогда
			//Оповестить("ОбновлениеСпискаЗаказыПосылки");
			ЭтаФорма.Закрыть();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	Иначе
		Если Вопрос("Документ был изменен другим пользователем" + Символы.ПС + "Перечитать данные документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПрочитатьДанныеНаСервере();
			ПроверитьНеобходимостьОбработки();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрушкиРазрешитьОтгрузку(Команда)

	Если Заказ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Ложь;
	ТекстОшибки = "";
	
	Если ПоследнийНомерВерсииЗаказа = ПоследнийНомерВерсииДокумента(Заказ) Тогда
		РазрешитьОтгрузкуНаСервере(ЗаказНомер + "_" + Формат(ЗаказДата, "ДФ=yy"), 1, Заказ, Результат, ТекстОшибки);
		Если Результат = Истина Тогда
			//Оповестить("ОбновлениеСпискаЗаказыПосылки");
			ЭтаФорма.Закрыть();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	Иначе
		Если Вопрос("Документ был изменен другим пользователем" + Символы.ПС + "Перечитать данные документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПрочитатьДанныеНаСервере();
			ПроверитьНеобходимостьОбработки();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазрешитьОтгрузкуНаСервере(НомерДокумента, Отгрузка, ДокументСсылка, Результат, ТекстОшибки)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.РазрешитьОтгрузкуНаСервере(НомерДокумента, Отгрузка, ДокументСсылка, Результат, ТекстОшибки);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаСервере
Функция ПоследнийНомерВерсииДокумента(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПроверитьНеобходимостьОбработки(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьОбработки(Отказ = Ложь)
	Если СтатусПроверки <> 2 Тогда
		Предупреждение("Документ не требует обработки");
		//Оповестить("ОбновлениеСпискаЗаказыПосылки");
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



