#Область ОсновныеМетодыФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	RegExp=Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = "[^0-9]";
	
	МассивОшибок = Новый Массив;
	Если Параметры.Свойство("МассивЗаказов") Тогда
		Если ТипЗнч(Параметры.МассивЗаказов) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из Параметры.МассивЗаказов Цикл
				
				ПокупательФИО = "";
				ПокупательТелефон = "";
				ПокупательEmail = "";
				Имя = "";
				Фамилия = "";
				
				РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЭлементМассива, "KDVID, ВитринаИнтернетМагазина, URL, НомерЗаказаНаСайте, ДатаЗаказаНаСайте, ПокупательФИО, ПокупательТелефон, ПокупательEmail");
				
				НомерЗаказаНаСайте = РеквизитыЗаказа.НомерЗаказаНаСайте;
				ДатаЗаказаНаСайте = РеквизитыЗаказа.ДатаЗаказаНаСайте;
				
				Если ПустаяСтрока(РеквизитыЗаказа.KDVID) Тогда
					ПокупательФИО = РеквизитыЗаказа.ПокупательФИО;
					ПокупательТелефон = РеквизитыЗаказа.ПокупательТелефон;
					ПокупательEmail = РеквизитыЗаказа.ПокупательEmail;
				Иначе
					Если РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс")
						ИЛИ РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
						main_partner_kdvid = "Yarche";
					ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
						И СтрНайти(НРег(РеквизитыЗаказа.URL), "kdvonline") > 0 Тогда
						main_partner_kdvid = "KDV";
					ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
						И СтрНайти(НРег(РеквизитыЗаказа.URL), "toybe") > 0 Тогда
						main_partner_kdvid = "Toybe";
					ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
						И СтрНайти(НРег(РеквизитыЗаказа.URL), "yarcheplus") > 0 Тогда
						main_partner_kdvid = "Yarche";
					Иначе
						main_partner_kdvid = Неопределено;
					КонецЕсли;
					СтруктураПерсональныхДанных = KDVID.АвторизоватьсяИПолучитьПерсональныеДанные(РеквизитыЗаказа.KDVID, main_partner_kdvid);
					Если ПустаяСтрока(СтруктураПерсональныхДанных.description) Тогда
						Если ТипЗнч(СтруктураПерсональныхДанных.data) = Тип("Структура") Тогда
							Если СтруктураПерсональныхДанных.data.Свойство("name") Тогда
								Имя = СтруктураПерсональныхДанных.data.name;
							КонецЕсли;
							Если СтруктураПерсональныхДанных.data.Свойство("surname") Тогда
								Фамилия = СтруктураПерсональныхДанных.data.surname;
							КонецЕсли;
							ПокупательФИО = Строка(Фамилия) + ?(ПустаяСтрока(Фамилия), "", " ") + Строка(Имя);
							Если СтруктураПерсональныхДанных.data.Свойство("phone") Тогда
								ПокупательТелефон = СтруктураПерсональныхДанных.data.phone;
							КонецЕсли;
							Если СтруктураПерсональныхДанных.data.Свойство("email") Тогда
								Если ТипЗнч(СтруктураПерсональныхДанных.data.email) = Тип("Структура") И СтруктураПерсональныхДанных.data.email.Свойство("email") Тогда
									ПокупательEmail = СтруктураПерсональныхДанных.data.email.email;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					Иначе 
						Если МассивОшибок.Найти(НомерЗаказаНаСайте) = Неопределено Тогда
							МассивОшибок.Добавить(НомерЗаказаНаСайте);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;

				ПокупательТелефон = СтрЗаменить(ПокупательТелефон, ",", Символы.ПС);
				ПокупательТелефон = СтрЗаменить(ПокупательТелефон, ";", Символы.ПС);
				
				Если СтрЧислоСтрок(ПокупательТелефон) = 0 Тогда
					Если МассивОшибок.Найти(НомерЗаказаНаСайте) = Неопределено Тогда
						МассивОшибок.Добавить(НомерЗаказаНаСайте);
					КонецЕсли;
				КонецЕсли;
				
				Для Сч = 1 По СтрЧислоСтрок(ПокупательТелефон) Цикл
					
					ТелефонДляОтправки = RegExp.Replace(СтрПолучитьСтроку(ПокупательТелефон, Сч), "");
					
					Если СтрДлина(ТелефонДляОтправки)>=10 Тогда
						НС = ТаблицаПолучателей.Добавить();
						НС.Заказ = ЭлементМассива;
						НС.НомерЗаказаНаСайте = НомерЗаказаНаСайте;
						НС.ДатаЗаказаНаСайте = ДатаЗаказаНаСайте;
						НС.ПокупательФИО = ПокупательФИО;
						НС.ПокупательТелефон = "7"+Прав(ТелефонДляОтправки,10);
						НС.Витрина = РеквизитыЗаказа.ВитринаИнтернетМагазина;
					Иначе
						Если МассивОшибок.Найти(НомерЗаказаНаСайте) = Неопределено Тогда
							МассивОшибок.Добавить(НомерЗаказаНаСайте);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ТаблицаПолучателей.Количество() = 0 И МассивОшибок.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ТекстСообщения = "Есть ошибки получения номеров телефонов по заказам:" + Символы.ПС;
		Для Каждого ЭлементМассива Из МассивОшибок Цикл
			ТекстСообщения = ТекстСообщения + ЭлементМассива + Символы.ПС;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьСписокШаблоновСМС()
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Добрый день! Доставка Ярче. Простите, пожалуйста, курьер задерживается на 15 минут. Номер горячей линии 88002504444.", "Опоздание 15 минут");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Добрый день! Доставка Ярче. Простите, пожалуйста, курьер задерживается на 30 минут. Номер горячей линии 88002504444.", "Опоздание 30 минут");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Добрый день! Доставка Ярче. Простите, пожалуйста, курьер задерживается на 1 час. Номер горячей линии 88002504444.", "Опоздание 1 час");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Доставка Ярче. Курьер не может с вами связаться. Позвоните нам, пожалуйста, по номеру 88002504444.", "Курьер не может связаться с клиентом");
	////Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Доставка Ярче. У вас не списались деньги по заказу и он автоматически отменился. Позвоните нам 88002504444 или напишите https://vk.com/yarcheplus", "Не списались деньги за заказ (Яндекс)");
	////Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Доставка Ярче. У вас не списались деньги по заказу. Проверьте баланс на карте, удалите карту в профиле и привяжите ее заново. Мы отправим счёт на оплату этого заказа на электронную почту, указанную в заказе. Письмо придет от Сбербанка. Если у вас остались вопросы, позвоните нам 88002504444 или напишите https://vk.com/yarcheplus", "Не списались деньги за заказ (курьерская)");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Поддержка Ярче Плюс. Вам сейчас придет уведомление о том, что ваш заказ доставлен. Мы завершили его, чтобы он не отменился из-за неосторожных действий курьера Яндекса. Не переживайте, мы проследим за заказом, пока его вам не привезут. Телефон горячей линии 88002504444.", "Мы завершили заказ (Яндекс)");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Доставка Ярче. У вас не списались деньги за заказ. Перейдите в личный кабинет и в заказе нажмите кнопку оплатить. После оплаты курьер сможет привезти заказ. Номер горячей линии 88002504444", "Не списались деньги за заказ");
	//Элементы.ШаблонСМС.СписокВыбора.Добавить("Здравствуйте! Доставка Ярче. Простите, пожалуйста, не можем найти курьера Яндекса на ваш заказ. Позвоните нам, пожалуйста, если готовы ждать заказ 88002504444", "Яндекс опоздание");
КонецПроцедуры

#Область Шаблоны

&НаСервере
Процедура ПолучитьТекстШаблонаСМС()
	Если НЕ ЗначениеЗаполнено(ШаблонСМС) Тогда
		ТекстШаблонаСМС = "";
	Иначе
		РеквизитыШаблона = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ШаблонСМС, "ТекстСообщения");
		ТекстШаблонаСМС = РеквизитыШаблона.ТекстСообщения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСМСПриИзменении(Элемент)
	ПолучитьТекстШаблонаСМС();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСМСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//ПолучитьТекстШаблонаСМС();
КонецПроцедуры

&НаКлиенте
Процедура ШаблонСМСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораШаблона(Элемент, "ПриЗакрытииФормыВыбораШаблона");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораШаблона(Владелец, ПроцедураПриЗакрытии = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки",					ПолучитьНастройкиКомпоновкиДляФормыВыбораШаблона());
	ПараметрыФормы.Вставить("РежимВыбора",								Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",						Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",						Истина);
	ПараметрыФормы.Вставить("ОтображениеТаблицы",						ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.ШаблоныСМС.ФормаВыбора", ПараметрыФормы, Владелец,
		, , , ?(ПроцедураПриЗакрытии = Неопределено, Неопределено, Новый ОписаниеОповещения(ПроцедураПриЗакрытии, ЭтаФорма)));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиКомпоновкиДляФормыВыбораШаблона()
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	МассивВитрин = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаПолучателей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Витрина) Тогда
			Продолжить;
		КонецЕсли;
		Если МассивВитрин.Найти(СтрокаТаблицы.Витрина) = Неопределено Тогда
			МассивВитрин.Добавить(СтрокаТаблицы.Витрина);
		КонецЕсли;
	КонецЦикла;
	СписокДоступныхВитрин = Новый СписокЗначений;
	СписокДоступныхВитрин.ЗагрузитьЗначения(МассивВитрин);
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Витрина");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокДоступныхВитрин;
	
	Возврат НастройкиКомпоновки;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораШаблона(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ПолучитьТекстШаблонаСМС();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьТекстСообщения(Команда)
	ПолучитьТекстШаблонаСМС();
КонецПроцедуры

#КонецОбласти

#Область ОтправитьСМС

&НаКлиенте
Процедура ОтправитьСМС(Команда)
	ОтправитьСМСНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСМСНаСервере();
	
	RegExp=Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	RegExp.IgnoreCase = Истина;
	RegExp.Pattern = "[^0-9]";
	
	СтрокаАбонентов = "";
	Для Каждого СтрокаТаблицы Из ТаблицаПолучателей Цикл
		ТелефонДляОтправки = RegExp.Replace(СтрокаТаблицы.ПокупательТелефон, "");
		Если СтрДлина(ТелефонДляОтправки)>=10 Тогда
			СтрокаАбонентов = СтрокаАбонентов + ?(ПустаяСтрока(СтрокаАбонентов), "", ",") + "7"+Прав(ТелефонДляОтправки,10);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СтрокаАбонентов) Тогда
		МассивРезультатовОтправкиСМС = ИнтеграцияСервер.ОтправитьСМС(СтрокаАбонентов, ТекстШаблонаСМС);
		//О = РеквизитФормыВЗначение("Объект");
		//МассивРезультатовОтправкиСМС = О.ОтправитьСМС(СтрокаАбонентов, ТекстШаблонаСМС);
		//ЗначениеВРеквизитФормы(О, "Объект");
		ТекстПисьма = "";
		Для Каждого РезультатОтправкиСМС ИЗ МассивРезультатовОтправкиСМС Цикл
			Если РезультатОтправкиСМС.Результат = ИСТИНА Тогда
				Продолжить;
			КонецЕсли;
			ТекстПисьма = ТекстПисьма + "Абонент " + РезультатОтправкиСМС.Абонент + ": " + РезультатОтправкиСМС.Комментарий;
		КонецЦикла;
		Если СтрДлина(ТекстПисьма)>0 Тогда
			ТекстПисьма = "Ошибки отправки СМС" + Символы.ПС + ТекстПисьма;
			О = РеквизитФормыВЗначение("Объект");
			О.ОтправитьНаПочту("АРМ ИМ", ТекстПисьма);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ТаблицаПолучателей

&НаКлиенте
Процедура ТаблицаПолучателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Поле.Имя = "ТаблицаПолучателейПокупательТелефон" Тогда
		СтандартнаяОбработка = Ложь; 
		Если ЗначениеЗаполнено(ТаблицаПолучателей[ВыбраннаяСтрока].Заказ) Тогда
			П = Новый Структура("Ключ", ТаблицаПолучателей[ВыбраннаяСтрока].Заказ);
			ФормаДокумента = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента", П);
			ФормаДокумента.ТолькоПросмотр = Истина;
			ФормаДокумента.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
