&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НомерВерсииПриНачалеРедактирования", НомерВерсииПриНачалеРедактирования) Тогда
		НомерВерсииПриНачалеРедактирования = 0;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, ЧекПродажа, ЭквайринговаяОперация, ФормаОплаты, ВозвратMagPayЗапрещен, ВитринаИнтернетМагазина");
	ЗаказНомер				= СтруктураРеквизитов.НомерЗаказаНаСайте;
	ЧекККМ					= СтруктураРеквизитов.ЧекПродажа;
	ЭквайринговаяОперация	= СтруктураРеквизитов.ЭквайринговаяОперация;
	ВитринаИМ				= СтруктураРеквизитов.ВитринаИнтернетМагазина;
	
	ВыполнятьВозвратВМагПей = Ложь;
	Если СтруктураРеквизитов.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная
		ИЛИ СтруктураРеквизитов.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта Тогда
		Если СтруктураРеквизитов.ВозвратMagPayЗапрещен Тогда
			Отказ = Истина;
		Иначе
			ЗаполнитьТаблицуОплатМагПей();
		КонецЕсли;
	КонецЕсли;

	Если ЧекККМ.Пустая() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЕСТЬNULL(ЗаказКлиентаАкцизныеМарки.Количество, ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаАкцизныеМарки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЗаказКлиентаТовары.КоличествоШтук
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК КоличествоШтук,
	               |	ЗаказКлиентаТовары.ПричинаОтмены,
	               |	ЗаказКлиентаТовары.Цена,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаАкцизныеМарки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК МаркируемаяПродукция,
	               |	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	ЕСТЬNULL(ЗаказКлиентаАкцизныеМарки.Марка, """") КАК Марка
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.АкцизныеМарки КАК ЗаказКлиентаАкцизныеМарки
	               |		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиентаАкцизныеМарки.Ссылка
	               |			И ЗаказКлиентаТовары.КодСтроки = ЗаказКлиентаАкцизныеМарки.КлючСвязи
	               |			И (НЕ ЗаказКлиентаАкцизныеМарки.Отменено)
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка = &Заказ
	               |	И НЕ ЗаказКлиентаТовары.Отменено
	               |	И ЗаказКлиентаТовары.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Заказ", Заказ);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
	ПричинаОтменыПустаяСсылка 	= Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();
	ПричинаОтменыБрак			= Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Брак");
	ПричинаОтменыКомплектация	= Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Недостача");
	ТипНоменклатурыУслуга		= Перечисления.ТипыНоменклатуры.Услуга;
	
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Очистить();
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыПустаяСсылка, " ");
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыКомплектация, "Недостача");
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыБрак, "Брак");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОплатМагПей()
	
	ВыполнятьВозвратВМагПей = Истина;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОперацииJSON = ОбработкаОбъект.ЗагрузитьОперацииМагПей(Заказ);
	
	Если ТипЗнч(ОперацииJSON) = Тип("Соответствие") Тогда
		Если Не ОперацииJSON.Получить("data") = Неопределено Тогда 
			Для Каждого ОперацииЗаказаСоответствие Из ОперацииJSON.Получить("data") Цикл
					
				ОперацииЗаказаСтруктура = ОбщегоНазначения.СоответствиеВСтруктуру(ОперацииЗаказаСоответствие);  
				
				Если ОперацииЗаказаСтруктура.Свойство("operations") Тогда
					Для Каждого Операция Из ОперацииЗаказаСтруктура.operations Цикл
						ОперацияСтруктура = ОбщегоНазначения.СоответствиеВСтруктуру(Операция);
						
						//типа операции 
						ТипОперации = Неопределено;
						Если ОперацияСтруктура.Свойство("type", ТипОперации) = Ложь Тогда
							ВыполнятьВозвратВМагПей = Ложь;
							Возврат;
						КонецЕсли;

						Множитель = 0; 
						Если ТипОперации = "SELL" Тогда 
							Множитель = 1;
						ИначеЕсли ТипОперации = "SELL_REFUND" Тогда
							Множитель = -1;
						Иначе      
							ВыполнятьВозвратВМагПей = Ложь;
							Возврат;
						КонецЕсли;							
						
						//реквизиты оплаты текущей операции
						Если ОперацияСтруктура.Свойство("payment") = Ложь Тогда
							ВыполнятьВозвратВМагПей = Ложь;
							Возврат;
						КонецЕсли;
						
						Если ОперацияСтруктура.payment.type <> "CARD" Тогда
							ВыполнятьВозвратВМагПей = Ложь;
							Возврат;
						КонецЕсли;
							
						РРНОперации = ОперацияСтруктура.payment.rrn;
						МерчантОперации = ОперацияСтруктура.payment.merchant;
						ТерминалОперации = ОперацияСтруктура.payment.terminal;
						КодАвторизацииОперации = ОперацияСтруктура.payment.auth_code;
						
						// номенклатура, марки и количество
						ИспользоватьМультичекиВОперации = ОперацияСтруктура.Свойство("cheques");
						Если ИспользоватьМультичекиВОперации Тогда
							
							Для каждого ЧекОперации Из ОперацияСтруктура.cheques Цикл
								ЧекОперацииСтруктура = ОбщегоНазначения.СоответствиеВСтруктуру(ЧекОперации);
								Если ЧекОперацииСтруктура.Свойство("items") = Ложь Тогда
									ВыполнятьВозвратВМагПей = Ложь;
									Возврат;
								КонецЕсли;
								Для Каждого ПозицияЧека Из ЧекОперацииСтруктура.items Цикл
									ПозицияЧекаСтруктура = ОбщегоНазначения.СоответствиеВСтруктуру(ПозицияЧека);
									ИдентификаторНоменклатуры = ПозицияЧекаСтруктура.nomenclature_id;
									УИДНоменклатуры = ПозицияЧекаСтруктура.id;
									КоличествоНоменклатуры = ПозицияЧекаСтруктура.quantity * Множитель;
									Если ПозицияЧекаСтруктура.Свойство("marking_codes") И ПозицияЧекаСтруктура.marking_codes.Количество() > 0 Тогда
										Для Каждого Марка Из ПозицияЧекаСтруктура.marking_codes Цикл
											МаркаПреобразованная = ОбменССайтом.ЭкранироватьНечитаемыеСимволы(Марка,"\u001d");
											НСОперацииМагПей = ТоварыПоОперациямМагПей.Добавить();
											НСОперацииМагПей.ИдентификаторНоменклатуры = ИдентификаторНоменклатуры;
											НСОперацииМагПей.УИДНоменклатуры = УИДНоменклатуры;
											НСОперацииМагПей.Марка = МаркаПреобразованная;
											НСОперацииМагПей.Количество = Множитель;
											НСОперацииМагПей.rrn = РРНОперации;
											НСОперацииМагПей.merchant_id = МерчантОперации;
											НСОперацииМагПей.terminal_id = ТерминалОперации;
											НСОперацииМагПей.auth_code = КодАвторизацииОперации;
										КонецЦикла;
									Иначе        
										НСОперацииМагПей = ТоварыПоОперациямМагПей.Добавить();
										НСОперацииМагПей.ИдентификаторНоменклатуры = ИдентификаторНоменклатуры;
										НСОперацииМагПей.УИДНоменклатуры = УИДНоменклатуры;
										НСОперацииМагПей.Марка = "";
										НСОперацииМагПей.Количество = Множитель * КоличествоНоменклатуры;
										НСОперацииМагПей.rrn = РРНОперации;
										НСОперацииМагПей.merchant_id = МерчантОперации;
										НСОперацииМагПей.terminal_id = ТерминалОперации;
										НСОперацииМагПей.auth_code = КодАвторизацииОперации;
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
									
						Иначе
							
							Если ОперацияСтруктура.Свойство("items") = Ложь Тогда
								ВыполнятьВозвратВМагПей = Ложь;
								Возврат;                       
							КонецЕсли;
							Для Каждого ПозицияЧека Из ОперацияСтруктура.items Цикл  
								ПозицияЧекаСтруктура = ОбщегоНазначения.СоответствиеВСтруктуру(ПозицияЧека);
								ИдентификаторНоменклатуры = ПозицияЧекаСтруктура.nomenclature_id;  
								УИДНоменклатуры = ПозицияЧекаСтруктура.id;
								КоличествоНоменклатуры = ПозицияЧекаСтруктура.quantity;
								Если ПозицияЧекаСтруктура.Свойство("marking_codes") И ПозицияЧекаСтруктура.marking_codes.Количество() > 0 Тогда
									Для Каждого Марка Из ПозицияЧекаСтруктура.marking_codes Цикл  
										МаркаПреобразованная = ОбменССайтом.ЭкранироватьНечитаемыеСимволы(Марка,"\u001d");
										НСОперацииМагПей = ТоварыПоОперациямМагПей.Добавить();
										НСОперацииМагПей.ИдентификаторНоменклатуры = ИдентификаторНоменклатуры; 
										НСОперацииМагПей.УИДНоменклатуры = УИДНоменклатуры;
										НСОперацииМагПей.Марка = МаркаПреобразованная;
										НСОперацииМагПей.Количество = Множитель;
										НСОперацииМагПей.rrn = РРНОперации;
										НСОперацииМагПей.merchant_id = МерчантОперации;
										НСОперацииМагПей.terminal_id = ТерминалОперации;
										НСОперацииМагПей.auth_code = КодАвторизацииОперации;
									КонецЦикла;
								Иначе
									НСОперацииМагПей = ТоварыПоОперациямМагПей.Добавить();
									НСОперацииМагПей.ИдентификаторНоменклатуры = ИдентификаторНоменклатуры;  
									НСОперацииМагПей.УИДНоменклатуры = УИДНоменклатуры;
									НСОперацииМагПей.Марка = "";
									НСОперацииМагПей.Количество = Множитель * КоличествоНоменклатуры;
									НСОперацииМагПей.rrn = РРНОперации;
									НСОперацииМагПей.merchant_id = МерчантОперации;
									НСОперацииМагПей.terminal_id = ТерминалОперации;
									НСОперацииМагПей.auth_code = КодАвторизацииОперации;
								КонецЕсли;
							КонецЦикла;    
							
						КонецЕсли;  // ИспользоватьМультичекиВОперации
					КонецЦикла;  // ОперацииЗаказаСтруктура.operations
				Иначе
					ВыполнятьВозвратВМагПей = Ложь; 
					Возврат;
				КонецЕсли;  // ОперацииЗаказаСтруктура.Свойство("operations")

			КонецЦикла;  // ОперацииJSON.Получить("data")  
			
			// количество из ТЧ марок заказа + Номенклатура
			ТаблицаМарокЗаказа = Заказ.АкцизныеМарки.Выгрузить();
			Для Каждого СтрокаТаблицы Из ТоварыПоОперациямМагПей Цикл 

				СтрокаТаблицы.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.ИдентификаторНоменклатуры));

				Если ПустаяСтрока(СтрокаТаблицы.Марка) Тогда
					Продолжить;
				КонецЕсли;      
				
				Для Каждого СтрокаТаблицыМарокЗаказа Из ТаблицаМарокЗаказа Цикл
					Если СтрокаТаблицы.Марка = СтрЗаменить(СтрокаТаблицыМарокЗаказа.Марка, "\u001d", "")
						ИЛИ СтрокаТаблицы.Марка = СтрокаТаблицыМарокЗаказа.Марка Тогда
						СтрокаТаблицы.Количество = СтрокаТаблицы.Количество * СтрокаТаблицыМарокЗаказа.Количество; 
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
			ТЗ_ТоварыПоОперациямМагПей = ТоварыПоОперациямМагПей.Выгрузить();
			ТЗ_ТоварыПоОперациямМагПей.Свернуть("УИДНоменклатуры, Номенклатура, Марка, rrn, merchant_id, terminal_id, auth_code", "Количество");
			ТоварыПоОперациямМагПей.Загрузить(ТЗ_ТоварыПоОперациямМагПей);
			
		Иначе
			ВыполнятьВозвратВМагПей = Ложь;
			Возврат;
		КонецЕсли;  // Не ОперацииJSON.Получить("data") = Неопределено
	Иначе 
		ВыполнятьВозвратВМагПей = Ложь;
		Возврат;
	КонецЕсли; // ТипЗнч(ОперацииJSON) = Тип("Соответствие")
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДекорацияЧекВМагпей.Заголовок = ?(ВыполнятьВозвратВМагПей, "Будет сформирован чек в MagPay", "");  
	//Если ВыполнятьВозвратВМагПей Тогда
	//	Элементы.ГруппаДанныеОплаты.Видимость = Истина;
	//Иначе                                              
		Элементы.ГруппаДанныеОплаты.Видимость = Ложь;
	//КонецЕсли;
	ОбновитьПоказателиКВозврату();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыНаВозврат(Команда)
	
	//Если ВыполнятьВозвратВМагПей Тогда
	//	ТекстСообщения = "";
	//	//Если ПустаяСтрока(merchant_id) Тогда
	//	//	ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + СтрШаблон(НСтр("ru = '%1 не заполнено'"), "Мерчант ID");
	//	//КонецЕсли;
	//	//Если ПустаяСтрока(terminal_id) Тогда
	//	//	ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + СтрШаблон(НСтр("ru = '%1 не заполнено'"), "Терминал ID");
	//	//КонецЕсли;
	//	//Если ПустаяСтрока(rrn) Тогда
	//	//	ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + СтрШаблон(НСтр("ru = '%1 не заполнено'"), "РРН");
	//	//КонецЕсли;
	//	//Если ПустаяСтрока(auth_code) Тогда
	//	//	ТекстСообщения = ТекстСообщения + ?(ПустаяСтрока(ТекстСообщения), "", Символы.ПС) + СтрШаблон(НСтр("ru = '%1 не заполнено'"), "Код авторизации");
	//	//КонецЕсли;
	//	Если Не ПустаяСтрока(ТекстСообщения) Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
			
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Заказ", Заказ);
	СтруктураПараметров.Вставить("Результат", Истина);
	СтруктураПараметров.Вставить("ОписаниеРезультата", "");
	
	СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров);
	
	Если НЕ СтруктураПараметров.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
	Иначе
		Предупреждение("Документы успешно созданы");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СообщениеОбОшибке = "";
	Если НЕ СтруктураПараметров.Свойство("Заказ") Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СтрДлина(СообщениеОбОшибке)>0, ", ", "") + "Заказ";
	КонецЕсли;
			
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = "Ошибка входных данных, отсутствуют параметры: " + СообщениеОбОшибке;
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
		
	ТЗ_Возврат = Товары.Выгрузить();
	ТЗ_Возврат.Очистить();
	
	Для Каждого СтрокаТЗ Из Товары Цикл
		Если СтрокаТЗ.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		НС = ТЗ_Возврат.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаТЗ);
	КонецЦикла;
	
	Если ТЗ_Возврат.Количество() = 0 Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Нет данных для формирования документов на возврат");
		Возврат;
	КонецЕсли;

	//Формирование таблицы брака
	ТЗ_Брак = ТЗ_Возврат.Скопировать();
	ТЗ_Брак.Очистить();
	Для Каждого СтрокаТЗ Из ТЗ_Возврат Цикл
		Если СтрокаТЗ.ПричинаОтмены = ПричинаОтменыБрак Тогда
			Если СтрокаТЗ.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				Продолжить;
			КонецЕсли;
			НС = ТЗ_Брак.Добавить();
			ЗаполнитьЗначенияСвойств(НС, СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	
	ЕстьЧВ = Ложь;
	ЕстьТН = Ложь;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТЗ_Брак.Количество() > 0 Тогда 
		ТНОбъект = Документы.ТребованиеНакладная.СоздатьДокумент();
		ТЗ_ТоварыДляТН = ТЗ_Брак.Скопировать();
		ТЗ_ТоварыДляТН.Свернуть("Номенклатура", "Количество");
		ОбработкаОбъект.СформироватьТребованиеНакладную(ТНОбъект, СтруктураПараметров.Заказ, ТЗ_ТоварыДляТН);
		ЕстьТН = Истина;
	КонецЕсли;
	
	ЗаказОбъект = СтруктураПараметров.Заказ.ПолучитьОбъект();
	
	Если ВыполнятьВозвратВМагПей Тогда
		
		ТЗ_ТоварыКВозвратуМагПей = ТоварыПоОперациямМагПей.Выгрузить();
		ТЗ_ТоварыКВозвратуМагПей.Очистить();
		ТЗ_ТоварыПоОперациямМагПей = ТоварыПоОперациямМагПей.Выгрузить(); 
		ТЗ_ТоварыКВозврату = ТЗ_Возврат.Скопировать();
		ТЗ_ТоварыКВозврату.Свернуть("Номенклатура, Марка, Цена", "Количество");
		
		Для Каждого СтрокаВозврата Из ТЗ_ТоварыКВозврату Цикл
			
			//СтрокаВозврата.Марка = СтрЗаменить(СтрокаВозврата.Марка, "\u001d", "");
			
			НайденныеСтроки = ТЗ_ТоварыПоОперациямМагПей.НайтиСтроки(Новый Структура("Номенклатура, Марка", СтрокаВозврата.Номенклатура, СтрокаВозврата.Марка));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл

				Если СтрокаВозврата.Количество = 0 Тогда
					//уже распределили
					Продолжить;
				КонецЕсли;
				
				НС = ТЗ_ТоварыКВозвратуМагПей.Добавить();
				ЗаполнитьЗначенияСвойств(НС, НайденнаяСтрока);
				НС.Цена = СтрокаВозврата.Цена;
				Если НайденнаяСтрока.Количество >= СтрокаВозврата.Количество Тогда
					НС.Количество = СтрокаВозврата.Количество;
					СтрокаВозврата.Количество = 0;
				Иначе
					СтрокаВозврата.Количество = СтрокаВозврата.Количество - НС.Количество;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ЧасовойПоясСервера = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ЧасовойПоясСервера");
		СмещениеВремени = 0;
		Если ТипЗнч(ЧасовойПоясСервера) = Тип("Число") Тогда
			СмещениеВремени = ЧасовойПоясСервера * 3600;
		КонецЕсли; 
		
		СерверМП = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("СерверМагпей");
		АпиКлючМП = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("АпиКлючMagPay");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.УИДНоменклатуры КАК СТРОКА(36)) КАК УИДНоменклатуры,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.Марка КАК СТРОКА(100)) КАК Марка,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.Количество КАК ЧИСЛО(15, 3)) КАК Количество,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.Цена КАК ЧИСЛО(15, 2)) КАК Цена,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.rrn КАК СТРОКА(50)) КАК rrn,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.merchant_id КАК СТРОКА(50)) КАК merchant_id,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.terminal_id КАК СТРОКА(50)) КАК terminal_id,
		               |	ВЫРАЗИТЬ(ТоварыКВозврату.auth_code КАК СТРОКА(50)) КАК auth_code
		               |ПОМЕСТИТЬ ТЗ_ТоварыКВозврату
		               |ИЗ
		               |	&ТоварыКВозврату КАК ТоварыКВозврату
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТЗ_ТоварыКВозврату.УИДНоменклатуры КАК УИДНоменклатуры,
		               |	ТЗ_ТоварыКВозврату.Номенклатура,
		               |	ТЗ_ТоварыКВозврату.Марка КАК Марка,
		               |	ТЗ_ТоварыКВозврату.Количество КАК Количество,
		               |	ТЗ_ТоварыКВозврату.Цена КАК Цена,
		               |	ТЗ_ТоварыКВозврату.rrn КАК rrn,
		               |	ТЗ_ТоварыКВозврату.merchant_id КАК merchant_id,
		               |	ТЗ_ТоварыКВозврату.terminal_id КАК terminal_id,
		               |	ТЗ_ТоварыКВозврату.auth_code КАК auth_code,
		               |	ВЫРАЗИТЬ(ТЗ_ТоварыКВозврату.Количество * ТЗ_ТоварыКВозврату.Цена КАК ЧИСЛО(15, 2)) КАК Сумма
		               |ИЗ
		               |	ТЗ_ТоварыКВозврату КАК ТЗ_ТоварыКВозврату
		               |ИТОГИ
		               |	СУММА(Количество),
		               |	МАКСИМУМ(merchant_id),
		               |	МАКСИМУМ(terminal_id),
		               |	МАКСИМУМ(auth_code),
		               |	СУММА(Сумма)
		               |ПО
		               |	rrn,
		               |	УИДНоменклатуры,
		               |	Марка";
	
		Запрос.УстановитьПараметр("ТоварыКВозврату", ТЗ_ТоварыКВозвратуМагПей);
		РезультатЗапроса = Запрос.Выполнить();
	
		Выборкаrrn = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выборкаrrn.Следующий() Цикл
		
			СтруктураPayment = Новый Структура;
			СтруктураPayment.Вставить("type", "CARD");
			СтруктураPayment.Вставить("sum", Выборкаrrn.Сумма);
			СтруктураPayment.Вставить("merchant_id", СокрЛП(Выборкаrrn.merchant_id));
			СтруктураPayment.Вставить("rrn", СокрЛП(Выборкаrrn.rrn));
			СтруктураPayment.Вставить("terminal_id", СокрЛП(Выборкаrrn.terminal_id));
			СтруктураPayment.Вставить("auth_code", СокрЛП(Выборкаrrn.auth_code));

			СоответствиеPositions = Новый Соответствие;

			ВыборкаИдентификаторНоменклатуры = Выборкаrrn.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИдентификаторНоменклатуры.Следующий() Цикл

				СтруктураPositionКоличествоМарки = Новый Структура;
				СтруктураPositionКоличествоМарки.Вставить("quantity", ВыборкаИдентификаторНоменклатуры.Количество);
				
				МассивМарок = Новый Массив;
				ВыборкаМарка = ВыборкаИдентификаторНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаМарка.Следующий() Цикл
					Если ПустаяСтрока(СокрЛП(ВыборкаМарка.Марка)) Тогда
						Продолжить;
					КонецЕсли;
					МассивМарок.Добавить(СокрЛП(ВыборкаМарка.Марка));
				КонецЦикла;
				
				Если МассивМарок.Количество() > 0 Тогда
					СтруктураPositionКоличествоМарки.Вставить("marking_items", МассивМарок);
				КонецЕсли;
				
				СоответствиеPositions.Вставить(ВыборкаИдентификаторНоменклатуры.УИДНоменклатуры, СтруктураPositionКоличествоМарки);
				
			КонецЦикла;
			
			СтруктураОтправки = Новый Структура;
			СтруктураОтправки.Вставить("timestamp", Формат(ТекущаяДата() - СмещениеВремени, "ДЛФ=DT"));
			СтруктураОтправки.Вставить("positions", СоответствиеPositions);
			СтруктураОтправки.Вставить("payment", СтруктураPayment);

			//ТелоЗапроса = JSON_1C.ЗаписатьJSON82(СтруктураОтправки);
			ТелоЗапроса = РаботаСHTTPСервисами.ЗаписьСтруктурыВJSON(СтруктураОтправки);
			ТелоЗапроса = СтрЗаменить(ТелоЗапроса, "\\u001d", "\u001d");
			//ТелоЗапроса = JSONСерверВызовСервера.СформироватьСтрокуJSON(СтруктураОтправки);
			
			ЗаголовкиHTTP = Новый Соответствие;
			ЗаголовкиHTTP.Вставить("Content-Type", "application/json");
			ЗаголовкиHTTP.Вставить("x-access-token", АпиКлючМП);
			ЗаголовкиHTTP.Вставить("Content-Charset", "utf-8");
			
			СтруктураОтвета = ИнтеграцияСервер.ВыполнитьИнтернетЗапрос("post", СерверМП + "/api/v2/order/"+Строка(ЗаказОбъект.MagPayID)+"/refund", ТелоЗапроса, ЗаголовкиHTTP);
		
			Если СтруктураОтвета.Статус <> 200 Тогда  
				СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + СтруктураОтвета.ТелоОтвета;
				ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , Заказ, СообщениеОбОшибке);
				СтруктураПараметров.Вставить("Результат", Ложь);
				СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
				Возврат;
			КонецЕсли;
		
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтруктураОтвета.ТелоОтвета);
			ТелоОтветаСтруктура =  ПрочитатьJSON(ЧтениеJSON, Ложь, "", ФорматДатыJSON.ISO);

			Если ТипЗнч(ТелоОтветаСтруктура) = Тип("Структура") И ТелоОтветаСтруктура.Свойство("error") Тогда
				Ошибка = "";
				Код = 0;
				Описание = "";
				Если ТелоОтветаСтруктура.Свойство("error", Ошибка) = Неопределено Тогда 
					Ошибка = НСтр("ru = 'Ошибка не определена'");
				КонецЕсли;
				Если ТелоОтветаСтруктура.Свойство("code", Код) = Неопределено Тогда 
					Код = 0;
				КонецЕсли;
				Если ТелоОтветаСтруктура.Свойство("message", Описание) = Неопределено Тогда 
					Описание = "";
				КонецЕсли;
				СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + "Ошибка: " + Ошибка + Символы.ПС + "Код: " + Код + Символы.ПС + "Описание: " + Описание;
				ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , Заказ, СообщениеОбОшибке);
				СтруктураПараметров.Вставить("Результат", Ложь);
				СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
		//отправляем заказ в загрузку операций магпей
		ИмяФайлаПМ = "";
		ОбменССайтом.ВыполнитьМетодВнешнейОбработки(Неопределено, "ЗагрузитьОплатуПоЗаказуМагпей", Новый Структура("Заказ", Заказ), ИмяФайлаПМ);
		ОбменССайтом.УдалитьФайлПодключенногоМодуля(ИмяФайлаПМ);
		
		НачатьТранзакцию();
		Попытка
			Если ЕстьТН Тогда 
				ТНОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , Заказ, СообщениеОбОшибке);
			СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ОписаниеОшибки();
			СтруктураПараметров.Вставить("Результат", Ложь);
			СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		КонецПопытки;
		
	Иначе
		
		ЧВОбъект = Документы.ЧекККМВозврат.СоздатьДокумент();
		ЧВОбъектСсылка = Документы.ЧекККМВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор);
		ЧВОбъект.УстановитьСсылкуНового(ЧВОбъектСсылка);

		//корректируем заказ
		Результат = ОбработкаОбъект.СкорректироватьТоварыЗаказа(ЗаказОбъект, ТЗ_Возврат, СообщениеОбОшибке, ЧВОбъектСсылка);
		Если Не Результат Тогда
			СтруктураПараметров.Вставить("Результат", Ложь);
			СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
			Возврат;
		КонецЕсли;		
			
		ТЗ_ВозвратДляЧека = ТЗ_Возврат.Скопировать();
		ТЗ_ВозвратДляЧека.Свернуть("Номенклатура, Цена, СтавкаНДС, Упаковка", "Количество, КоличествоУпаковок, Сумма, СуммаНДС");
		ОбработкаОбъект.СформироватьЧекККМВозврат(ЧВОбъект, СтруктураПараметров.Заказ, ТЗ_ВозвратДляЧека);
		ЕстьЧВ = Истина;
	
		ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(Заказ);
		Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
			СтруктураПараметров.Вставить("Результат", Ложь);
			СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
			Возврат;
		КонецЕсли;
	
		НачатьТранзакцию();
		Попытка
			ЗаказОбъект.ДополнительныеСвойства.Вставить("ПроверкаДатыЗапретаИзменения", Ложь);
		
			Если ЕстьЧВ Тогда
			
				ЧВОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
				ТекстЗапроса = "ВЫБРАТЬ
				               |	ДополнительныеДанныеЧеков.НомерКассовойСмены,
				               |	ДополнительныеДанныеЧеков.ИнтернетМагазин,
				               |	ДополнительныеДанныеЧеков.КассаККМ
				               |ИЗ
				               |	РегистрСведений.ДополнительныеДанныеЧеков КАК ДополнительныеДанныеЧеков
				               |ГДЕ
				               |	ДополнительныеДанныеЧеков.Документ = &ЧекККМ";
				Запрос = Новый Запрос(ТекстЗапроса);
				Запрос.УстановитьПараметр("ЧекККМ", ЧВОбъект.ЧекККМ);
				РезультатВыборка = Запрос.Выполнить().Выбрать();
				Пока РезультатВыборка.Следующий() Цикл
					ДДЧ_МЗ = РегистрыСведений.ДополнительныеДанныеЧеков.СоздатьМенеджерЗаписи();
					ДДЧ_МЗ.Документ = ЧВОбъект.Ссылка;
					ДДЧ_МЗ.НомерКассовойСмены = РезультатВыборка.НомерКассовойСмены;
					ДДЧ_МЗ.ИнтернетМагазин = Истина;
					ДДЧ_МЗ.КассаККМ = ЧВОбъект.КассаККМ;
					ДДЧ_МЗ.Записать(Истина);
					Прервать;
				КонецЦикла;	
			
				//Данные чеков с безналичной оплатой
				МЗРС = РегистрыСведений.ДанныеЧековСБезналичнойОплатой.СоздатьМенеджерЗаписи();
				МЗРС.Период = ЧВОбъект.Дата;
				МЗРС.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта;
				МЗРС.КассаККМ = ЧВОбъект.КассаККМ;
				МЗРС.Склад = ЧВОбъект.Склад;
				МЗРС.ЧекККМ = ЧВОбъект.Ссылка;
				МЗРС.ВитринаИнтернетМагазина = ЗаказОбъект.ВитринаИнтернетМагазина;
				МЗРС.СуммаДокумента = ЧВОбъект.СуммаДокумента;
				МЗРС.Записать();
				
				НС = ЗаказОбъект.Оплаты.Добавить();
				НС.Документ = ЧВОбъект.Ссылка;
				НС.Дата = ТекущаяДата();
				НС.СуммаДокумента = ЧВОбъект.СуммаДокумента;
				НС.Источник = Перечисления.ИсточникиФормированияЧеков.Система;
	
				//{ Константинова 03.09.25 
				РегистрыСведений.ЧекиПоЗаказамКлиента.ДобавитьЗапись(ЧВОбъект.Ссылка, СтруктураПараметров.Заказ);
				//} Константинова
			КонецЕсли;
		
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			
			Если ЕстьТН Тогда 
				ТНОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , Заказ, СообщениеОбОшибке);
			СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ОписаниеОшибки();
			СтруктураПараметров.Вставить("Результат", Ложь);
			СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПричинаОтменыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеЗаказ.ТекущиеДанные;
	
	Если ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
		СвернутьТовары();
	Иначе
		Если ТекущиеДанные.ТипНоменклатуры = ТипНоменклатурыУслуга Тогда
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыКомплектация;
		КонецЕсли;
		АлгоритмВозврата(ТекущиеДанные);
	КонецЕсли;
	
	ОбновитьПоказателиКВозврату();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмВозврата(ТекущиеДанные)
	
	Если ТекущиеДанные.МаркируемаяПродукция Тогда 
		//ничего не делаем просто меняем причину
	Иначе

		КоличествоДляВозврата = ТекущиеДанные.Количество;
		ТекстВопроса = "Сколько вернуть?";
		ОтветПользователя = "";               

		Если ТекущиеДанные.КоличествоШтук > 0 Тогда
			СЗ_Кнопки = новый СписокЗначений;
			СЗ_Кнопки.Добавить("Штуки", "Штуки");
			СЗ_Кнопки.Добавить("Вес", "Вес");
			ОтветПользователя = Вопрос("Возвращаем штуки или вес?", СЗ_Кнопки);
			Если ОтветПользователя = "Штуки" Тогда
				КоличествоДляВозврата = ТекущиеДанные.КоличествоШтук;
				ТекстВопроса = "Сколько штук вернуть?";
			Иначе
				КоличествоДляВозврата = ТекущиеДанные.Количество;
				ТекстВопроса = "Какой вес вернуть?";
			КонецЕсли;
		КонецЕсли;
		ИсходноеКоличество = КоличествоДляВозврата;
	
		Если ВвестиЧисло(КоличествоДляВозврата, ТекстВопроса) Тогда
		
			Если КоличествоДляВозврата > ИсходноеКоличество Тогда
				Предупреждение("Нельзя вернуть больше чем продано!");
				ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				СвернутьТовары();
				Возврат;
			КонецЕсли;

			Если КоличествоДляВозврата < 0 Тогда
				Предупреждение("Нельзя вернуть отрицательное количество!");
				ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				СвернутьТовары();
				Возврат;
			КонецЕсли;
		
			Если ОтветПользователя = "Штуки" Тогда
				КолШтукВозврат = КоличествоДляВозврата;
				КолВозврат = Окр(ТекущиеДанные.Количество * КоличествоДляВозврата / ТекущиеДанные.КоличествоШтук, 3);
			Иначе
				КолШтукВозврат = Окр(КоличествоДляВозврата * ТекущиеДанные.КоличествоШтук / ТекущиеДанные.Количество, 0);
				КолШтукВозврат = ?(КолШтукВозврат = 0 И ТекущиеДанные.КоличествоШтук > 0, 1, КолШтукВозврат);
				КолВозврат = КоличествоДляВозврата;
			КонецЕсли;	
			
			Если КолВозврат < ТекущиеДанные.Количество Тогда
				
				НС = Товары.Добавить();
				НС.Номенклатура = ТекущиеДанные.Номенклатура;
				НС.Количество = ТекущиеДанные.Количество - КолВозврат;
				НС.КоличествоШтук = ТекущиеДанные.КоличествоШтук - КолШтукВозврат;
				НС.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				НС.Цена = ТекущиеДанные.Цена;
				НС.МаркируемаяПродукция = ТекущиеДанные.МаркируемаяПродукция;
				НС.ТипНоменклатуры = ТекущиеДанные.ТипНоменклатуры;
				
				ТекущиеДанные.Количество = КолВозврат;
				ТекущиеДанные.КоличествоШтук = КолШтукВозврат;
				
			КонецЕсли;
		
		Иначе
		
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
		
		КонецЕсли;
		
	КонецЕсли;
		
	Если ТекущиеДанные.МаркируемаяПродукция И ТекущиеДанные.ПричинаОтмены <> ПричинаОтменыБрак ТОгда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для маркируемой продукции возврат возможен только с причиной ""Брак""");
		ТекущиеДанные.ПричинаОтмены = ПричинаОтменыБрак;
	КонецЕсли;
	
	СвернутьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьТовары()
	
	НоменклатураСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.Номенклатура;
	ПричинаОтменыСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.ПричинаОтмены;
	СвернутьТоварыНаСервере();
	Для Каждого СтрокаТаблицы Из Товары Цикл
		Если СтрокаТаблицы.Номенклатура = НоменклатураСтроки 
			И СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыСтроки Тогда
			Элементы.ДанныеЗаказ.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТоварыНаСервере()
	
	ТЗ_Товары = Товары.Выгрузить();
	ТЗ_Товары.Свернуть("Номенклатура, ПричинаОтмены, МаркируемаяПродукция, Марка, Цена, ТипНоменклатуры", "Количество, КоличествоШтук");
	Товары.Загрузить(ТЗ_Товары);
	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиКВозврату()
	
	КоличествоПозицийКВозвратуБрак = 0;
	ОбщееКоличествоКВозвратуБрак = 0;
	ОбщаяСуммаКВозвратуБрак = 0;
	КоличествоПозицийКВозвратуКомплектация = 0;
	ОбщееКоличествоКВозвратуКомплектация = 0;
	ОбщаяСуммаКВозвратуКомплектация = 0;
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыБрак Тогда
			КоличествоПозицийКВозвратуБрак = КоличествоПозицийКВозвратуБрак + 1;
			ОбщееКоличествоКВозвратуБрак = ОбщееКоличествоКВозвратуБрак + СтрокаТаблицы.Количество;
			ОбщаяСуммаКВозвратуБрак = ОбщаяСуммаКВозвратуБрак + Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена,2);
		ИначеЕсли СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыКомплектация Тогда
			КоличествоПозицийКВозвратуКомплектация = КоличествоПозицийКВозвратуКомплектация + 1;
			ОбщееКоличествоКВозвратуКомплектация = ОбщееКоличествоКВозвратуКомплектация + СтрокаТаблицы.Количество;
			ОбщаяСуммаКВозвратуКомплектация = ОбщаяСуммаКВозвратуКомплектация + Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена,2);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.нПоказателиВозвратаБрак.Заголовок = "К возврату позиций (количество) брак: " + КоличествоПозицийКВозвратуБрак + " (" + ОбщееКоличествоКВозвратуБрак + "), на сумму " + Формат(ОбщаяСуммаКВозвратуБрак,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	Элементы.нПоказателиВозвратаКомплектация.Заголовок = "К возврату позиций (количество) комплектация: " + КоличествоПозицийКВозвратуКомплектация + " (" + ОбщееКоличествоКВозвратуКомплектация + "), на сумму " + Формат(ОбщаяСуммаКВозвратуКомплектация,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	ИтогоКоличествоПозицийКВозврату = КоличествоПозицийКВозвратуБрак + КоличествоПозицийКВозвратуКомплектация;
	ИтогоОбщееКоличествоКВозврату =  ОбщееКоличествоКВозвратуБрак + ОбщееКоличествоКВозвратуКомплектация;
	ИтогоОбщаяСуммаКВозврату = ОбщаяСуммаКВозвратуБрак + ОбщаяСуммаКВозвратуКомплектация;
	Элементы.нПоказателиВозвратаИтоги.Заголовок = "Итого к возврату позиций (количество): " + ИтогоКоличествоПозицийКВозврату + " (" + ИтогоОбщееКоличествоКВозврату + "), на сумму " + Формат(ИтогоОбщаяСуммаКВозврату,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
