&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	ПрочитатьДанныеНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Наименование ПОДОБНО ""%Посылки%""";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элементы.Склад.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеНаСервере()
	
	ЗаказНомер = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "Номер");
	ЗаказДата = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "Дата");
	НомерЗаказаНаСайте = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "НомерЗаказаНаСайте");
	ДатаЗаказаНаСайте = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ДатаЗаказаНаСайте");
	ЗаказНомерДата = НомерЗаказаНаСайте + " от " + Формат(ДатаЗаказаНаСайте,"ДФ=дд.ММ.гггг");
	ЖелаемаяДатаОтгрузки = НачалоДня(ТекущаяДата()) + ?( (ТекущаяДата() - НачалоДня(ТекущаяДата())) / 3600 < 18, 0, 24*3600 );//ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ЖелаемаяДатаОтгрузки");
	АдресДоставки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "АдресДоставки");
	ПокупательФИО = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ПокупательФИО");
	Телефон = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ПокупательТелефон");
	Email = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ПокупательEmail");
	Комментарий = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "Комментарий");
	Статус = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "Статус");
	АдресИсходный = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "АдресДоставкиJSON");
	ТЗЗаказыТовары.Очистить();
	
	лТекст = "
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.НаименованиеТовараКлиента,
		|	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.НаименованиеТовараКлиента,
		|	ЗаказКлиентаТовары.Цена,
		|	ЗаказКлиентаТовары.СтавкаНДС
		|";
		
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.УстановитьПараметр("ЗаказКлиента", Заказ);
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл
		НС = ТЗЗаказыТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,лВыборка)
	КонецЦикла;
	
	ПоследнийНомерВерсииЗаказа = ПоследнийНомерВерсииДокумента(Заказ);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоследнийНомерВерсииДокумента(ОбъектСсылка)
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВерсииОбъектов.НомерВерсии) КАК НомерВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект = &Объект
		|";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", ОбъектСсылка);
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
        Возврат РезультатВыборка.НомерВерсии;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаКлиенте
Процедура ПеречитатьДанные(Команда)
	ПрочитатьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен склад", , "Склад");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Соглашение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен Соглашение", , "Соглашение");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОСП_ИД) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен ОСП_ИД", , "ОСП_ИД");
		Возврат;
	КонецЕсли;
	
	Если ПоследнийНомерВерсииЗаказа = ПоследнийНомерВерсииДокумента(Заказ) Тогда
		ЗаписатьЗаказНаСервере();
		//Оповестить("ОбновлениеСпискаЗаказыАли");
		ЭтаФорма.Закрыть();
	Иначе
		Если Вопрос("Документ был изменен другим пользователем" + Символы.ПС + "Перечитать данные документа?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ПрочитатьДанныеНаСервере();
			ПроверитьНеобходимостьОбработки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗаказНаСервере()
	ДокОбъект = Заказ.ПолучитьОбъект();
	Свойство_АдресДоставки = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("АдресДоставки");
	Для Каждого ДопРеквизит Из ДокОбъект.ДополнительныеРеквизиты Цикл
		Если ДопРеквизит.Свойство = Свойство_АдресДоставки Тогда
			ДопРеквизит.Значение = АдресДоставки;
		КонецЕсли;
	КонецЦикла;
	ДокОбъект.АдресДоставки = АдресДоставки;
	ДокОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КВыгрузкеWMS;
	ДокОбъект.Склад = Склад;
	Для каждого Стр Из ДокОбъект.Товары Цикл
		Стр.ДатаОтгрузки = ДокОбъект.ЖелаемаяДатаОтгрузки;
	КонецЦикла;
	ДокОбъект.Широта = Широта;
	ДокОбъект.Долгота = Долгота;
	ДокОбъект.ОСП_ИД = ОСП_ИД;
	ДокОбъект.ЖелаемаяДатаОтгрузки = ЖелаемаяДатаОтгрузки;
	ДокОбъект.Соглашение = Соглашение;
	Для Каждого Стр Из ДокОбъект.Товары Цикл
		Стр.Склад = Склад;	
	КонецЦикла;

	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПроверитьНеобходимостьОбработки(Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьОбработки(Отказ = Ложь)
	Если НеобходимаОбработка(Статус) = Ложь Тогда		
		Предупреждение("Документ не требует обработки");
		//Оповестить("ОбновлениеСпискаЗаказыАли");
		Если ЭтаФорма.Открыта() Тогда
			ЭтаФорма.Закрыть();
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НеобходимаОбработка(СтатусДокумента)
	Возврат СтатусДокумента = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
КонецФункции

&НаКлиенте
Процедура ИсправитьАдрес(Команда)
	ПараметрыАдреса = Новый Структура("АдресИсходный, АдресJSON", АдресДоставки, АдресИсходный);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВыбораАдреса", ПараметрыАдреса, Элементы.АдресДоставки);
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	АдресДоставки = ВыбранноеЗначение.Адрес;
	Широта = ВыбранноеЗначение.Широта;
	Долгота = ВыбранноеЗначение.Долгота;
	Реквизит1 = ВыбранноеЗначение.Адрес;
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Соглашение();
	
КонецПроцедуры

Функция Соглашение()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоглашенияСКлиентами.Ссылка
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
		|ГДЕ
		|	СоглашенияСКлиентами.Склад = &Склад
		|	И СоглашенияСКлиентами.Наименование ПОДОБНО ""%Aliexpress%""";

	Запрос.УстановитьПараметр("Склад", Склад);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Соглашение = ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеАдреса" Тогда
		
		АдресДоставки = Параметр.Адрес;
		Широта = Параметр.Широта;
		Долгота = Параметр.Долгота;
		ОСП_ИД = Параметр.ОСП_ИД;
		
	КонецЕсли;
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры

