#Область ОбщиеМетоды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	УстановитьСписокСкладовИМ(Элементы.ИнтернетМагазин.СписокВыбора);
	
	Если Параметры.Свойство("РольСотрудникаИМ") Тогда
		РольИМ = Параметры.РольСотрудникаИМ;
	КонецЕсли;
	Если Параметры.Свойство("СкладИМ") Тогда
		ИнтернетМагазин = Параметры.СкладИМ;
	КонецЕсли;
	Если Параметры.Свойство("ТекущийКурьер") Тогда
		ТекущийКурьер = Параметры.ТекущийКурьер;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийКурьер) И НЕ ЗначениеЗаполнено(РольИМ) Тогда
		Возврат;
	КонецЕсли;
	
	СвойствоИнтернетМагазин = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ИнтернетМагазин");
	
	ГруппаВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Физические лица""");
	ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон", , ГруппаВидКИ);
	
	РольКурьер = Перечисления.РолиСотрудниковИМ.Курьер;
	
	Если ЗначениеЗаполнено(ТекущийКурьер) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФизическиеЛица.Наименование КАК Наименование,
		               |	ФизическиеЛица.РольИМ КАК РольИМ,
		               |	ФизическиеЛицаДополнительныеРеквизиты.Значение КАК ИнтернетМагазин,
		               |	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона КАК Телефон
		               |ИЗ
		               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ДополнительныеРеквизиты КАК ФизическиеЛицаДополнительныеРеквизиты
		               |		ПО ФизическиеЛица.Ссылка = ФизическиеЛицаДополнительныеРеквизиты.Ссылка
		               |			И (ФизическиеЛицаДополнительныеРеквизиты.Свойство = &СвойствоИнтернетМагазин)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		               |		ПО ФизическиеЛица.Ссылка = ФизическиеЛицаКонтактнаяИнформация.Ссылка
		               |			И (ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		               |			И (ФизическиеЛицаКонтактнаяИнформация.Вид = &ВидКИ)
		               |ГДЕ
		               |	ФизическиеЛица.Ссылка = &ТекущийКурьер";
		
		Запрос.УстановитьПараметр("ТекущийКурьер", ТекущийКурьер);
		Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
		Запрос.УстановитьПараметр("СвойствоИнтернетМагазин", СвойствоИнтернетМагазин);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			ФИО = РезультатЗапроса.Наименование;
			Телефон = СокрЛП(РезультатЗапроса.Телефон);
			ИнтернетМагазин = РезультатЗапроса.ИнтернетМагазин;
			РольИМ = РезультатЗапроса.РольИМ;
			Если ТекущийКурьер.ПометкаУдаления Тогда
				Элементы.нПометкаУдаления.Заголовок = "ВНИМАНИЕ! Данный сотрудник интернет-магазина помечен на удаление!";
			КонецЕсли;
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокСкладовИМ(СписокВыбора)
	
	СвойствоСкладИМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад интернет магазина");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладыДополнительныеРеквизиты.Ссылка КАК Склад,
	               |	СкладыДополнительныеРеквизиты.Ссылка.Наименование КАК СкладНаименование
	               |ИЗ
	               |	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	               |ГДЕ
	               |	СкладыДополнительныеРеквизиты.Свойство = &СвойствоСкладИМ
	               |	И СкладыДополнительныеРеквизиты.Значение = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СкладНаименование";
	
	Запрос.УстановитьПараметр("СвойствоСкладИМ", СвойствоСкладИМ);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад) Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Склад);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьТелефон();
КонецПроцедуры

#КонецОбласти


#Область ЗаписатьИзменения

&НаКлиенте
Процедура Записать(Команда)
	
	ТекстСообщения = "";
	
	Если НЕ ЗначениеЗаполнено(ФИО) Тогда
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + НСтр("ru='""ФИО"" не заполнено!'");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(РольИМ) Тогда
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + НСтр("ru='""Роль"" не заполнено!'");
	КонецЕсли;
	Если РольИМ = РольКурьер И (Лев(СокрЛП(Телефон), 2) <> "+7" ИЛИ СтрДлина(СокрЛП(Телефон)) <> 12) Тогда
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + НСтр("ru='""Телефон"" неверный формат!'");
	КонецЕсли;
	Если РольИМ = ПредопределенноеЗначение("Перечисление.РолиСотрудниковИМ.Комплектовщик") И НЕ ЗначениеЗаполнено(ИнтернетМагазин) Тогда
		ТекстСообщения = ТекстСообщения + ?(ЗначениеЗаполнено(ТекстСообщения), Символы.ПС, "") + НСтр("ru = '""Интернет магазин"" не заполнено!'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	Если ЗаписатьНаСервере() Тогда
		Оповестить("ОбновлениеДанныхСотрудникаИМ");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТекущийКурьер.Пустая() Тогда
		Попытка
			ФЛОбъект = Справочники.ФизическиеЛица.СоздатьЭлемент();
		Исключение
			ШаблонТекстаСообщения = НСтр("ru='Ошибка создания нового элемента: %ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Попытка
			ФЛОбъект = ТекущийКурьер.ПолучитьОбъект();
		Исключение
			ШаблонТекстаСообщения = НСтр("ru='Ошибка доступа к ""%Курьер%"": %ОписаниеОшибки%'");
			ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Курьер%", СокрЛП(ТекущийКурьер.Наименование));
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	ФЛОбъект.Наименование = ФИО;
	ФЛОбъект.РольИМ = РольИМ;
	
	ИзменилиДопРеквизит = Ложь;
	НайденныеСтроки = ФЛОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоИнтернетМагазин));
	Если НайденныеСтроки.Количество() = 0 И ЗначениеЗаполнено(ИнтернетМагазин) Тогда
		НДр = ФЛОбъект.ДополнительныеРеквизиты.Добавить();
		НДр.Свойство = СвойствоИнтернетМагазин;
		НДр.Значение = ИнтернетМагазин;
	ИначеЕсли ЗначениеЗаполнено(ИнтернетМагазин) Тогда
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Значение = ИнтернетМагазин;
		КонецЦикла;
	Иначе
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			ФЛОбъект.ДополнительныеРеквизиты.Удалить(НайденнаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если РольИМ = РольКурьер Тогда
		ИзменилиТелефон = Ложь;
		Для Каждого КИ Из ФЛОбъект.КонтактнаяИнформация Цикл
			Если НЕ КИ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ КИ.Вид = ВидКИ Тогда
				Продолжить;
			КонецЕсли;
			КИ.НомерТелефона = Телефон;
			КИ.НомерТелефонаБезКодов = Телефон;
			КИ.ЗначенияПолей		= "НомерТелефона="+Телефон;
			КИ.Представление		= Телефон;
			ИзменилиТелефон = Истина;
		КонецЦикла;
		
		Если НЕ ИзменилиТелефон Тогда
			НС = ФЛОбъект.КонтактнаяИнформация.Добавить();
			НС.Вид = ВидКИ;
			НС.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НС.НомерТелефона = Телефон;
			НС.НомерТелефонаБезКодов = Телефон;
			НС.ЗначенияПолей		= "НомерТелефона="+Телефон;
			НС.Представление		= Телефон;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ФЛОбъект.Записать();
	Исключение
		ШаблонТекстаСообщения = НСтр("ru='Ошибка записи ""%Курьер%"": %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Курьер%", СокрЛП(ФИО));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти


#Область МетодыЭлементовФормыКлиент

&НаКлиенте
Процедура РольИМПриИзменении(Элемент)
	УстановитьДоступностьТелефон();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьТелефон()
	Элементы.Телефон.Доступность = РольИМ = РольКурьер;
КонецПроцедуры

#КонецОбласти
