
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресИсходный = Параметры.АдресИсходный;   
	АдресJSON = Параметры.АдресJSON;

	СтруктураПараметров = JSONСерверВызовСервера.ПрочитатьJSON82(АдресJSON); 
	Если СтруктураПараметров.Свойство("entrance") Тогда                      
		Подъезд = СтруктураПараметров.entrance;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("floor") Тогда
		Этаж = СтруктураПараметров.floor;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("apartment") Тогда
		Квартира = СтруктураПараметров.apartment;
	КонецЕсли;
	Если СтруктураПараметров.Свойство("intercom") Тогда
		Домофон = СтруктураПараметров.intercom;
	КонецЕсли;
	
	РучноеИзменениеАдресаДоставки = Ложь;
	Если Параметры.Свойство("РучноеИзменениеАдресаДоставки") Тогда
		РучноеИзменениеАдресаДоставки = Истина;
	КонецЕсли;
	
	Если НЕ РучноеИзменениеАдресаДоставки Тогда

		Элементы.ГруппаПодъездЭтажКвартира.Видимость = Истина;
		
		МаксШиринаЛ = 0;
		МаксШиринаП = 0;
		Для Каждого КЗ Из СтруктураПараметров Цикл
			
			П = КЗ.Ключ;
			
			ИмяПараметра = "Параметр_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Элемент = Элементы.Добавить(ИмяПараметра, Тип("ДекорацияФормы"), Элементы.Лево);
			Элемент.Вид = ВидДекорацииФормы.Надпись;
			Элемент.Гиперссылка  = Ложь;
			Элемент.Заголовок  =  КЗ.Ключ;  // сюда вставить имя вложения. будет видно на форме
			Элемент.РастягиватьПоГоризонтали = Истина;
			Элемент.Ширина = СтрДлина(КЗ.Ключ) + 3;
			МаксШиринаЛ = Макс(МаксШиринаЛ, Элемент.Ширина);
			
			ИмяПараметра = "Параметр_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
			Элемент = Элементы.Добавить(ИмяПараметра, Тип("ДекорацияФормы"), Элементы.Право);
			Элемент.Вид = ВидДекорацииФормы.Надпись;
			Элемент.Гиперссылка = Истина;
			Элемент.Заголовок = КЗ.Значение;  // сюда вставить имя вложения. будет видно на форме
			Элемент.РастягиватьПоГоризонтали = Истина;
			//Элемент.РастягиватьПоВертикали = Ложь;
			Элемент.Ширина = СтрДлина(КЗ.Значение);
			МаксШиринаП = Макс(МаксШиринаП, Элемент.Ширина);
			Элемент.УстановитьДействие("Нажатие", "ПНажатие");
			
		КонецЦикла;
		
		Элементы.Лево.Ширина = МаксШиринаЛ + 3;
		Элементы.Право.Ширина = МаксШиринаП + 3;
		
	Иначе
		
		Элементы.ГруппаПодъездЭтажКвартира.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПНажатие(Элемент, СтандартнаяОбработка)
	ЭтаФорма.Адрес = ЭтаФорма.Адрес + ?(ЭтаФорма.Адрес = "", "", ", ") + Элемент.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)    
	СтруктураАдресаJSON = Новый Структура;   
	СтруктураАдресаJSON.Вставить("address", Адрес);
	СтруктураАдресаJSON.Вставить("entrance", Подъезд);
	СтруктураАдресаJSON.Вставить("floor", Этаж);
	СтруктураАдресаJSON.Вставить("apartment", Квартира);
	СтруктураАдресаJSON.Вставить("intercom", Домофон);
//	НовыйАдресJSON = JSON_1C.ЗаписатьJSON82(СтруктураАдресаJSON,);
	НовыйАдресJSON = JSONСерверВызовСервера.СформироватьСтрокуJSON(СтруктураАдресаJSON);
	НовыйАдрес = Адрес + ?(ПустаяСтрока(Адрес),"", ?(ПустаяСтрока(АдресПодъездЭтажКвартира), "", ", "+АдресПодъездЭтажКвартира));
	Оповестить("ИзменениеАдреса", Новый Структура("Адрес, Широта, Долгота, ОСП_ИД, АдресJSON", НовыйАдрес, Широта, Долгота, ОСП_ИД, НовыйАдресJSON));
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Ресурс = "https://geocode-maps.yandex.ru/1.x/?apikey=b8b9636d-df5f-4788-a963-7419290875c0&format=json&geocode=" + СтрЗаменить(Адрес, " ", "+");
	
	Результат = ИнтеграцияСервер.ВыполнитьИнтернетЗапрос("GET", СтрокаВURL(Ресурс),, Новый Массив);
	Статус = Результат.Статус;        
	Если Статус <> 200 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка проверки адреса'"));
		Возврат;
	КонецЕсли;
	ТелоОтвета = JSONСерверВызовСервера.ПрочитатьJSON82(Результат.ТелоОтвета);
	Если Число(ТелоОтвета.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found) = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Неправильный адрес'"));
		Возврат;
	КонецЕсли;
	
	СписокАдресов = Новый СписокЗначений;
	СоответствиеАдресовКоординат = Новый Соответствие;
	
	Для каждого Точка Из ТелоОтвета.response.GeoObjectCollection.featureMember Цикл
		
		Координаты = Точка.GeoObject.Point.pos;	
		Address = Точка.GeoObject.metaDataProperty.GeocoderMetaData.Address;
		postal_code = Неопределено;
		formatted = Неопределено;
		Address.Свойство("postal_code", postal_code); 
		Address.Свойство("formatted", formatted);
		Если postal_code = Неопределено Тогда
			postal_code = "";
		КонецЕсли;
		Если formatted = Неопределено Тогда
			formatted = "";
		КонецЕсли;
		
		Если НЕ РучноеИзменениеАдресаДоставки Тогда
			АдресСтрок = postal_code + ?(postal_code = "", "", ", ") + formatted;
		Иначе
			АдресСтрок = formatted;
		КонецЕсли;                                                                                 
		
		СписокАдресов.Добавить(АдресСтрок);
		СоответствиеАдресовКоординат.Вставить(АдресСтрок, Координаты);
		
	КонецЦикла;

	Если СписокАдресов.Количество() = 1 Тогда
		Адрес = СписокАдресов[0];
	Иначе
		Адрес = ВыбратьИзСписка(СписокАдресов, Элементы.Адрес);
	КонецЕсли;
	
	Если ПустаяСтрока(Адрес) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Адрес не выбран'"));
		Возврат;
	КонецЕсли;
	
	Координаты = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СоответствиеАдресовКоординат.Получить(Адрес), " ");
	Широта = Число(Координаты[1]);
	Долгота = Число(Координаты[0]);

	Если НЕ РучноеИзменениеАдресаДоставки Тогда
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Authorization","Bearer " + ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ТокенДеливери"));
		Ресурс = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					"https://core-delivery2.mdk.dev.magdv.com/api/v1/os/warehouses/address?lat=%1&lon=%2"
					, СтрЗаменить(Широта, ",", "."), СтрЗаменить(Долгота, ",", "."));
		Рез = ИнтеграцияСервер.ВыполнитьИнтернетЗапрос("GET", Ресурс, "", Заголовки);
	
		Если Рез.Статус = 200 Тогда
		
			Тело = JSONСерверВызовСервера.ПрочитатьJSON82(Рез.ТелоОтвета);
			Если Тело.data.Количество() Тогда
				ОСП_ИД = Строка(Тело.data[0].guid);
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаВURL(Строка="") 
	ScrCtrl = Новый COMОбъект("MSScriptControl.ScriptControl"); 
	ScrCtrl.Language="JScript"; 
	Сообщение = ScrCtrl.eval("var uri='"+Строка+"'; encodeURI(uri);") ; 
	Возврат Сообщение; 
КонецФункции 

&НаКлиенте
Функция ПолучитьСтрокуПодъездЭтажКвартира()
	
	СтрокаИтоговая = "";
	Если НЕ ПустаяСтрока(Подъезд) Тогда                      
		СтрокаИтоговая = СтрокаИтоговая + ?(ПустаяСтрока(СтрокаИтоговая), "", ", ") + Подъезд + " под.";
	КонецЕсли;
	Если НЕ ПустаяСтрока(Этаж) Тогда
		СтрокаИтоговая = СтрокаИтоговая + ?(ПустаяСтрока(СтрокаИтоговая), "", ", ") + Этаж + " эт.";
	КонецЕсли;
	Если НЕ ПустаяСтрока(Квартира) Тогда
		СтрокаИтоговая = СтрокаИтоговая + ?(ПустаяСтрока(СтрокаИтоговая), "", ", ") + Квартира + " кв.";
	КонецЕсли;

	Возврат СтрокаИтоговая;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АдресПодъездЭтажКвартира = ПолучитьСтрокуПодъездЭтажКвартира();
КонецПроцедуры

&НаКлиенте
Процедура ПодъездПриИзменении(Элемент)
	АдресПодъездЭтажКвартира = ПолучитьСтрокуПодъездЭтажКвартира();
КонецПроцедуры

&НаКлиенте
Процедура ЭтажПриИзменении(Элемент)
	АдресПодъездЭтажКвартира = ПолучитьСтрокуПодъездЭтажКвартира();
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	АдресПодъездЭтажКвартира = ПолучитьСтрокуПодъездЭтажКвартира();
КонецПроцедуры
