
&НаСерверебезКонтекста
Функция НайтиОбработкуПечати(НаименованиеОбработки)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОбработки);
КонецФункции

&НаКлиенте
Процедура ПечатьТН(Команда)
	ВнешняяОбработка = НайтиОбработкуПечати("Печатная форма: Приложение N 4 к Правилам перевозок грузов автомобильным транспортом");
	МассивПеремещений = Элементы.списокперемещений.ВыделенныеСтроки;
	Если ЗначениеЗаполнено(ВнешняяОбработка) Тогда  
		ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьОбработку(ВнешняяОбработка,"ПечатнаяФорма","ТранспортнаяНакладная",Истина,"ВызовСерверногоМетода",ИСТИНА,"ПечатьMXL",МассивПеремещений)
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
    ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтаФорма);
    Диалог = Новый ДиалогРедактированияСтандартногоПериода;
    Диалог.Период = ПериодЖДП;
    Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
    Если РезультатВыбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ПериодЖДП.ДатаНачала=РезультатВыбора.ДатаНачала;
    ПериодЖДП.ДатаОкончания=РезультатВыбора.ДатаОкончания;
КонецПроцедуры

&НаСервере
Процедура ВыбратьЗаказыНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокЗаказНаПеремещение.Ссылка КАК Заказ,
		|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ВыбратьЗаказыНаСервере.ТабЗаказы}}"" КАК НаименованиеЗапроса
		|ПОМЕСТИТЬ ТабЗаказы
		|ИЗ
		|	Документ.ЗаказНаПеремещение КАК ДокЗаказНаПеремещение
		|ГДЕ
		|	ДокЗаказНаПеремещение.Проведен
		|	И ДокЗаказНаПеремещение.СкладОтправитель = &СкладОтправитель
		|	И ДокЗаказНаПеремещение.СкладПолучатель В (&СкладПолучатель)
		|	И ДокЗаказНаПеремещение.ЖелаемаяДатаПоступления МЕЖДУ &ДатаНачало И &ДатаКонец
		|	И ДокЗаказНаПеремещение.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.Ссылка КАК Заказ,
		|	ЗаказыНаПеремещениеОстатки.Номенклатура,
		|	ЗаказыНаПеремещениеОстатки.КодСтроки,
		|	ЗаказыНаПеремещениеОстатки.КОформлениюОстаток КАК Количество,
		|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ВыбратьЗаказыНаСервере.ТабОстатки}}"" КАК НаименованиеЗапроса
		|ПОМЕСТИТЬ ТабОстатки
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(
		|			,
		|			ЗаказНаПеремещение В
		|				(ВЫБРАТЬ
		|					ТабЗаказы.Заказ
		|				ИЗ
		|					ТабЗаказы КАК ТабЗаказы)) КАК ЗаказыНаПеремещениеОстатки
		|ГДЕ
		|	ЗаказыНаПеремещениеОстатки.КОформлениюОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК Пометка,
		|	ТабОстатки.Заказ КАК Заказ,
		|	ТабОстатки.Номенклатура,
		|	ТабОстатки.КодСтроки,
		|	ТабОстатки.Количество,
		|	ТабОстатки.Количество КАК КоличествоОстаток,
		|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ВыбратьЗаказыНаСервере.Результат1}}"" КАК НаименованиеЗапроса
		|ИЗ
		|	ТабОстатки КАК ТабОстатки
		|ИТОГИ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЗаказы.Заказ,
		|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ВыбратьЗаказыНаСервере.Результат2}}"" КАК НаименованиеЗапроса
		|ИЗ
		|	ТабЗаказы КАК ТабЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабОстатки КАК ТабОстатки
		|		ПО ТабЗаказы.Заказ = ТабОстатки.Заказ
		|ГДЕ
		|	ТабОстатки.Заказ ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ДатаКонец", ПериодЖДП.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачало", ПериодЖДП.ДатаНачала);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Дерево = РезультатЗапроса[2].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией); 
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл    
		СтрокаДерева = Дерево.Строки.Добавить();   
		СтрокаДерева.Заказ = Выборка.Заказ;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево,"ЗаказыДерево");    
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаказы(Команда)
	Если ПроверитьЗаполнение() Тогда  
		ВыбратьЗаказыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьПеремещенияНаСервере()
	Дерево = РеквизитФормыВЗначение("ЗаказыДерево");
	ТаблицаНоменклатуры = СформироватьТаблицуНоменклатурыДляЗапроса(Дерево);
	
	ЕстьСозданныеДокументы = ЛОЖЬ;
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если Не СтрокаДерева.Пометка Тогда   
			Продолжить;
		КонецЕсли;
		ТаблицаНоменклатуры.Очистить();              
		Для каждого СтрокаНоменклатура Из СтрокаДерева.Строки Цикл 
			НовСтр = ТаблицаНоменклатуры.Добавить();    
			ЗаполнитьЗначенияСвойств(НовСтр,СтрокаНоменклатура); 
		КонецЦикла;
		Если СоздатьПеремещениеПоЗаказу(СтрокаДерева.Заказ, ТаблицаНоменклатуры) Тогда
			Если НетОстатковПоЗаказу(СтрокаДерева.Заказ) Тогда  
				ТаблицаНоменклатуры.Очистить();
				ЗакрытьЗаказНаСервере(СтрокаДерева.Заказ, ТаблицаНоменклатуры);
			КонецЕсли;
			ЕстьСозданныеДокументы = Истина;
		КонецЕсли; 
	КонецЦикла;	  
	ВыбратьЗаказыНаСервере();   

КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНоменклатурыДляЗапроса(Дерево)
	ТипНоменклатура = Дерево.Колонки.Номенклатура.ТипЗначения;
	ТипКоличество = Дерево.Колонки.Количество.ТипЗначения;   
	ТипКодСтроки = Дерево.Колонки.КодСтроки.ТипЗначения;   
	ТипПометка = Дерево.Колонки.Пометка.ТипЗначения;
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Пометка",ТипПометка);
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура",ТипНоменклатура);
	ТаблицаНоменклатуры.Колонки.Добавить("Количество",ТипКоличество);
	ТаблицаНоменклатуры.Колонки.Добавить("КоличествоОстаток",ТипКоличество);
	ТаблицаНоменклатуры.Колонки.Добавить("КодСтроки",ТипКодСтроки); 
	Возврат ТаблицаНоменклатуры;
КонецФункции	


&НаКлиенте
Процедура СоздатьПеремещения(Команда)
	СоздатьПеремещенияНаСервере();   
	ОповеститьОбИзменении(Тип("ДокументСсылка.ПеремещениеТоваров")); 
	Элементы.списокперемещений.ВыделенныеСтроки.Очистить();
	Для каждого ЭлементСписка Из СозданныеПеремещения Цикл   
		Элементы.списокперемещений.ВыделенныеСтроки.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ДополнитьПеремещенияНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьПеремещения(Команда)
	ДополнитьПеремещенияНаСервере();
КонецПроцедуры  

&НаСервере
Функция СоздатьПеремещениеПоЗаказу(ЗаказНаПеремещение, ТаблицаНоменклатуры)
	ЗначенияРеквизитов = ОбщегоНазначенияУТ.ПолучитьЗначенияРеквизитовОбъекта(ЗаказНаПеремещение,
				Новый Структура("Организация, СкладОтправитель, СкладПолучатель, Подразделение, Сделка",
								"Организация", "СкладОтправитель", "СкладПолучатель", "Подразделение", "Сделка"));

	СозданныеПеремещения.Очистить();
	ДокументСоздан = ЛОЖЬ;			
	ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент(); 
	ДокОбъект.ЗаказНаПеремещение = ЗаказНаПеремещение;
	ДокОбъект.Дата = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(ДокОбъект, ЗначенияРеквизитов);
 	ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДатаРаспоряжения = ДокОбъект.Дата;
	ДокОбъект.ВидЦены = Справочники.Склады.ПолучитьУчетныйВидЦены(ДокОбъект.СкладОтправитель);

	Успех = ЗаполнитьТабличнуюЧастьТовары(ЗаказНаПеремещение, ДокОбъект, ТаблицаНоменклатуры);
	Если Не Успех Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	ДокОбъект.СтатусОтгрузки = Перечисления.СтатусыОтгрузки.Отгружено;      
	ДокОбъект.Водитель = Водитель;
	ДокОбъект.Экспедитор = Экспедитор;
	ДокОбъект.Автомобиль = Автомобиль;
	ДокОбъект.Перевозчик = Перевозчик;
	Попытка
		ДокОбъект.Записать();
		СтрПеремещ = СозданныеПеремещения.Добавить(ДокОбъект.Ссылка);
		ДокументСоздан = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение    
		ТекстОшибки = ОписаниеОшибки();
		Сообщить(ТекстОшибки);
	КонецПопытки;
	Возврат ДокументСоздан;
КонецФункции

&НаСервере
Функция ЗаполнитьТабличнуюЧастьТовары(ЗаказНаПеремещение,ДокОбъект, ТаблицаНоменклатуры) 

	Выборка = ПолучитьРезультатЗапросаПоОстаткамЗаказа(ЗаказНаПеремещение,ДокОбъект.Дата,ТаблицаНоменклатуры).Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.КоличествоОстаток <> Выборка.КоличествоОстатокВФорме Тогда 
			Сообщить("Остаток по заказу отличается от остатка в подготовленных данных. Перемещение по заказу "+ЗаказНаПеремещение+" не будет создано. Отметьте заказ для создания перемещения заново");    
			возврат ложь;
		КонецЕсли;
		Если Выборка.Пометка И Выборка.Количество > 0 Тогда
			СтрокаТоваров = ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, Выборка, "Номенклатура, КодСтроки, Количество");
			Если ЗначениеЗаполнено(СтрокаТоваров.Упаковка) Тогда
				СтрокаТоваров.КоличествоУпаковок = СтрокаТоваров.Количество / Выборка.Коэффициент;
			Иначе
				СтрокаТоваров.КоличествоУпаковок = СтрокаТоваров.Количество;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПолучитьРезультатЗапросаПоОстаткамЗаказа(ЗаказНаПеремещение, Дата = Неопределено, ТаблицаНоменклатуры)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ",       ЗаказНаПеремещение);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Пометка КАК Пометка,
	|	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
	|	ТаблицаНоменклатуры.Количество КАК Количество,
	|	ТаблицаНоменклатуры.КоличествоОстаток КАК КоличествоОстаток,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ПолучитьРезультатЗапросаПоОстаткамЗаказа.ТаблицаНоменклатуры}}"" КАК НаименованиеЗапроса
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.Номенклатура КАК Номенклатура,
	|	Заказы.КодСтроки КАК КодСтроки,
	|	Заказы.КОформлениюОстаток КАК Количество,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ПолучитьРезультатЗапросаПоОстаткамЗаказа.ТаблицаОстатки}}"" КАК НаименованиеЗапроса
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(, ЗаказНаПеремещение = &Заказ) КАК Заказы
	|ГДЕ
	|	Заказы.КОформлениюОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(Товары.НомерСтроки) КАК НомерСтроки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.КодСтроки КАК КодСтроки,
	|	МАКСИМУМ(Товары.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(Товары.НачалоОтгрузки) КАК ДатаОтгрузки,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ПолучитьРезультатЗапросаПоОстаткамЗаказа.ТаблицаТовары}}"" КАК НаименованиеЗапроса
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТаблицаОстатки.Количество, 0) КАК КоличествоОстаток,
	|	ТаблицаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
	|	ТаблицаТовары.Упаковка КАК Упаковка,
	|	ТаблицаТовары.Упаковка.Коэффициент КАК Коэффициент,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.КоличествоОстаток, 0) КАК КоличествоОстатокВФорме,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.Пометка, ЛОЖЬ) КАК Пометка,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ПолучитьРезультатЗапросаПоОстаткамЗаказа.Результат}}"" КАК НаименованиеЗапроса
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТовары КАК ТаблицаТовары
	|			ПО ТаблицаОстатки.Номенклатура = ТаблицаТовары.Номенклатура
	|				И ТаблицаОстатки.КодСтроки = ТаблицаТовары.КодСтроки
	|		ПО (ТаблицаОстатки.Номенклатура = ТаблицаНоменклатуры.Номенклатура)
	|			И (ТаблицаОстатки.КодСтроки = ТаблицаНоменклатуры.КодСтроки)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТовары.НомерСтроки";
	Возврат Запрос.Выполнить();

КонецФункции

&НаКлиенте
Процедура ЗаказыНаПеремещениеДеревоПометкаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ЗаказыДерево.ТекущиеДанные;
	ЭтоВерхнийУровень = Не ЗначениеЗаполнено(ТекущиеДанные.Номенклатура);	
	
	Если Не ЭтоВерхнийУровень И ТекущиеДанные.Пометка = 2 Тогда 
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	Если Не ЭтоВерхнийУровень Тогда
		ЕстьЗаполненные = Ложь;
		ЭлементРодитель = ТекущиеДанные.ПолучитьРодителя();
		ЭлементРодитель.Пометка = 1;
		Для Каждого ЭлементДерева Из ЭлементРодитель.ПолучитьЭлементы() Цикл
			Если ЭлементДерева.Пометка = 0 Тогда 
				ЭлементРодитель.Пометка = 2;
			ИначеЕсли ЭлементДерева.Пометка = 1 Тогда 
				ЕстьЗаполненные = Истина;
			КонецЕсли;
		КонецЦикла;
		Если ЭлементРодитель.Пометка = 2 И Не ЕстьЗаполненные Тогда
			ЭлементРодитель.Пометка = 0;
		КонецЕсли;
	Иначе
		Если ТекущиеДанные.Пометка = 2 Тогда 
			ТекущиеДанные.Пометка = 0;
		КонецЕсли;
		
		Для Каждого ЭлементДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			Если ТекущиеДанные.Пометка = 2 Тогда 
				ЭлементДерева.Пометка = 0;
			Иначе
				ЭлементДерева.Пометка = Элементы.ЗаказыДерево.ТекущиеДанные.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗакрытьЗаказНаСервере(Заказ, ТаблицаНоменклатуры)
	ПричинаОтмены = Справочники.ПричиныОтменыЗаказовПоставщикам.НайтиПоНаименованию("Недопоставка");
	ПричинаОтменыПерепоставка = Справочники.ПричиныОтменыЗаказовПоставщикам.НайтиПоНаименованию("Перепоставка");
	ДокументОбъект = Заказ.Получитьобъект();
	Если ДокументОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению Тогда
		ДокументОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закрытие заказа доступно только для заказов в статусе ""К выполнению"". Закрытие заказа "+Заказ+" не будет выполнено."); 
		Возврат ЛОЖЬ;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заказ",       Заказ);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры",ТаблицаНоменклатуры);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.Пометка КАК Пометка,
	|	ТаблицаНоменклатуры.КодСтроки КАК КодСтроки,
	|	ТаблицаНоменклатуры.Количество КАК Количество,
	|	ТаблицаНоменклатуры.КоличествоОстаток КАК КоличествоОстаток,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ЗакрытьЗаказНаСервере.ТаблицаНоменклатуры}}"" КАК НаименованиеЗапроса
	|ПОМЕСТИТЬ ТаблицаНоменклатуры
	|ИЗ
	|	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.Номенклатура КАК Номенклатура,
	|	Заказы.КодСтроки КАК КодСтроки,
	|	ЕСТЬNULL(Заказы.КОформлениюОстаток, 0) КАК КОформлениюОстаток,
	|	ЕСТЬNULL(Заказы.ЗаказаноОстаток, 0) КАК ЗаказаноОстаток,
	|	ЕСТЬNULL(ТаблицаНоменклатуры.КоличествоОстаток, 0) КАК КоличествоОстатокВФорме,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ЗакрытьЗаказНаСервере.Результат1}}"" КАК НаименованиеЗапроса
	|ИЗ
	|	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение.Остатки(, ЗаказНаПеремещение = &Заказ) КАК Заказы
	|		ПО ТаблицаНоменклатуры.Номенклатура = Заказы.Номенклатура
	|			И ТаблицаНоменклатуры.КодСтроки = Заказы.КодСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(УпаковкиНоменклатуры.Коэффициент) КАК Коэффициент,
	|	УпаковкиНоменклатуры.Ссылка КАК Упаковка,
	|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.ЗакрытьЗаказНаСервере.Результат2}}"" КАК НаименованиеЗапроса
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО ЗаказНаПеремещениеТовары.Упаковка = УпаковкиНоменклатуры.Ссылка
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка = &Заказ
	|
	|СГРУППИРОВАТЬ ПО
	|	УпаковкиНоменклатуры.Ссылка";
	
	РезультатЗапроса =  Запрос.Выполнить();
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ЕстьОшибка = ЛОЖЬ;
	Если Не РезультатЗапроса[1].Пустой() Тогда 
		Выборка         = РезультатЗапроса[1].Выбрать();
		ВыборкаУпаковок = РезультатЗапроса[2].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.КОформлениюОстаток <> Выборка.КоличествоОстатокВФорме Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Остаток по заказу отличается от остатка в подготовленных данных. Отметьте заказ для создания перемещения заново");    
				ЕстьОшибка = Истина;
			КонецЕсли;

			Если Выборка.КОформлениюОстаток<>Выборка.ЗаказаноОстаток Тогда  
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказано остаток в регистре<>К оформлению остаток по номенклатуре "+Выборка.Номенклатура); 
				ЕстьОшибка = Истина;
			КонецЕсли;
			Если Выборка.КОформлениюОстаток > 0 Тогда
				
				КоличествоКУдалению = Выборка.КОформлениюОстаток;
				
				НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, КодСтроки, Отменено", Выборка.Номенклатура, Выборка.КодСтроки, Ложь));
				
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
						
						КоличествоКУдалениюВСтроке = Мин(НайденнаяСтрока.Количество, КоличествоКУдалению);
						Если КоличествоКУдалениюВСтроке >= НайденнаяСтрока.Количество Тогда
							
							// вычеркиваем строку полностью
							НайденнаяСтрока.Отменено = Истина;
							НайденнаяСтрока.ПричинаОтмены = ПричинаОтмены;
							КоличествоКУдалению = КоличествоКУдалению - НайденнаяСтрока.Количество;
							
						Иначе
							
							// добавляем строку отмены
							НоваяСтрока = ДокументОбъект.Товары.Добавить(); 
							ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
							
							НоваяСтрока.КодСтроки     = 0;
							НоваяСтрока.Отменено      = Истина;
							НоваяСтрока.ПричинаОтмены = ПричинаОтмены;
							ТекКоличество             = НайденнаяСтрока.Количество;
							
							Если ЗначениеЗаполнено(НайденнаяСтрока.Упаковка) Тогда
								ВыборкаУпаковок.Сбросить();
								Если ВыборкаУпаковок.НайтиСледующий(НайденнаяСтрока.Упаковка, "Упаковка") Тогда
									КоэффициентУпаковки = ВыборкаУпаковок.Коэффициент;
								Иначе
									КоэффициентУпаковки = 1;
								КонецЕсли; 
							Иначе	
								КоэффициентУпаковки = 1;	
							КонецЕсли;
							
							НайденнаяСтрока.Количество         = ТекКоличество - КоличествоКУдалениюВСтроке;
							НайденнаяСтрока.КоличествоУпаковок = (ТекКоличество - КоличествоКУдалениюВСтроке) / КоэффициентУпаковки;
							
							НоваяСтрока.Количество         = КоличествоКУдалениюВСтроке;
							НоваяСтрока.КоличествоУпаковок = КоличествоКУдалениюВСтроке / КоэффициентУпаковки;
							
							КоличествоКУдалению = КоличествоКУдалению - КоличествоКУдалениюВСтроке;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				//
				//КоличествоКДобавлению = -1 * Выборка.Количество;
				//
				//НоваяСтрока = ДокументОбъект.Товары.Добавить();
				//НоваяСтрока.Номенклатура = Выборка.Номенклатура;
				//НоваяСтрока.КодСтроки = Выборка.КодСтроки;
				//НоваяСтрока.Количество = КоличествоКДобавлению;
				//НоваяСтрока.КоличествоУпаковок = КоличествоКДобавлению;
				//НоваяСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
				//НоваяСтрока.НачалоОтгрузки = ДокументОбъект.Дата;
				//НоваяСтрока.ОкончаниеПоступления = ДокументОбъект.ЖелаемаяДатаПоступления;
				//НоваяСтрока.ПричинаОтмены = ПричинаОтменыПерепоставка;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перепоставка по номенклатуре "+Выборка.Номенклатура); 
				ЕстьОшибка = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
	//ДокументОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
	Если ЕстьОшибка Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Закрытие заказа "+Заказ+" не будет выполнено"); 
		Возврат ЛОЖЬ;
	КонецЕсли;
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);      
		Возврат Истина;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при Закрытии заказа "+Заказ+" :"+КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат ЛОЖЬ;
	КонецПопытки;
КонецФункции

&НаСервереБезКонтекста
Функция НетОстатковПоЗаказу(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение,
		|	ЗаказыНаПеремещениеОстатки.Номенклатура,
		|	ЗаказыНаПеремещениеОстатки.КодСтроки,
		|	""{{ВнешниеОбработки.АРМОтгрузкиОборудования.НетОстатковПоЗаказу.Результат}}"" КАК НаименованиеЗапроса
		|ИЗ
		|	РегистрНакопления.ЗаказыНаПеремещение.Остатки(, ЗаказНаПеремещение = &ЗаказНаПеремещение) КАК ЗаказыНаПеремещениеОстатки
		|ГДЕ
		|	ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение = &ЗаказНаПеремещение";
	
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();

КонецФункции

&НаСервере
Процедура ЗакрытьЗаказыНаСервере()
	Дерево = РеквизитФормыВЗначение("ЗаказыДерево");
	ТаблицаНоменклатуры = СформироватьТаблицуНоменклатурыДляЗапроса(Дерево);

	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		Если СтрокаДерева.Пометка = 0 Тогда   
			Продолжить;
		КонецЕсли;                      
	
		ТаблицаНоменклатуры.Очистить();              
		Для каждого СтрокаНоменклатура Из СтрокаДерева.Строки Цикл 
			НовСтр = ТаблицаНоменклатуры.Добавить();    
			ЗаполнитьЗначенияСвойств(НовСтр,СтрокаНоменклатура); 
		КонецЦикла;

		ЗаказЗакрыт = ЗакрытьЗаказНаСервере(СтрокаДерева.Заказ, ТаблицаНоменклатуры);	 
	КонецЦикла;	
	ВыбратьЗаказыНаСервере();   
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказы(Команда)
	ЗакрытьЗаказыНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(ПериодЖДП.ДатаНачала) Или Не ЗначениеЗаполнено(ПериодЖДП.ДатаОкончания) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле Период не заполнено",,,"ПериодЖДП");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	списокперемещений.Параметры.УстановитьЗначениеПараметра("СкладОтправитель",СкладОтправитель);
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	списокперемещений.Параметры.УстановитьЗначениеПараметра("СкладПолучатель",СкладПолучатель);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	списокперемещений.Параметры.УстановитьЗначениеПараметра("СкладОтправитель",СкладОтправитель);
	списокперемещений.Параметры.УстановитьЗначениеПараметра("СкладПолучатель",СкладПолучатель);  
	Элементы.списокперемещений.Период.Вариант = ВариантСтандартногоПериода.Сегодня;
КонецПроцедуры


