
#Область Фильтры

&НаКлиенте
Процедура ФильтрМагазин()
	
	//ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Заказы, "Склад");
	
	ПКДСклад = Новый ПолеКомпоновкиДанных("Склад");
	
	Если ЗначениеЗаполнено(Магазин) Тогда 
		
		СкладУстановлен = Ложь;
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДСклад Тогда
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = Магазин;
				СкладУстановлен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СкладУстановлен Тогда
			ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "Склад", Магазин, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
	Иначе
		
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДСклад Тогда
				ЭлементОтбора.Использование = Ложь;
				ЭлементОтбора.ПравоеЗначение = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЖДП(КоличествоДней = 2, Включить = Истина)
	
	Если ЗначениеЗаполнено(Дата) Тогда
		ДатаНачалаОтбора = Дата;
		ДатаОкончанияОтбора = Дата;
	Иначе
		ДатаНачалаОтбора = ТекущаяДатаСервера() - КоличествоДней * 24 * 3600;
		ДатаОкончанияОтбора = ТекущаяДатаСервера() + КоличествоДней * 24 * 3600;
	КонецЕсли;
	
	ОтборЖДП = Новый ПолеКомпоновкиДанных("ЖелаемаяДатаОтгрузки");
	
	//заказы
	ДатаНачалаУстановлена = Ложь;
	ДатаокончанияУстановлена = Ложь;
	
	Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
		Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементОтбора.ЛевоеЗначение = ОтборЖДП И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно Тогда
			ЭлементОтбора.Использование = Включить;
			ЭлементОтбора.ПравоеЗначение = ДатаНачалаОтбора;
			ДатаНачалаУстановлена = Истина;
		ИначеЕсли ЭлементОтбора.ЛевоеЗначение = ОтборЖДП И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно Тогда
			ЭлементОтбора.ПравоеЗначение = ДатаОкончанияОтбора;
			ЭлементОтбора.Использование = Включить;
			ДатаокончанияУстановлена = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ДатаНачалаУстановлена Тогда
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ЖелаемаяДатаОтгрузки", ДатаНачалаОтбора, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	КонецЕсли;
	Если НЕ ДатаокончанияУстановлена Тогда
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ЖелаемаяДатаОтгрузки", ДатаОкончанияОтбора, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрНомерЗаказа()
	
	ПКДНомерЗаказаНаСайте = Новый ПолеКомпоновкиДанных("НомерЗаказаНаСайте");
	
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда 
		
		НомерЗаказаУстановлен = Ложь;
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДНомерЗаказаНаСайте Тогда
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = НомерЗаказа;
				НомерЗаказаУстановлен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НомерЗаказаУстановлен Тогда
			ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "НомерЗаказаНаСайте", НомерЗаказа, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
		ФильтрЖДП(2, Ложь);
		
	Иначе
		
		ФильтрЖДП(2, Истина);
		
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДНомерЗаказаНаСайте Тогда
				ЭлементОтбора.Использование = Ложь;
				ЭлементОтбора.ПравоеЗначение = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗаказПросрочен()
	
	ПросроченныеЗаказы = ОтборыСписковКлиентСервер.СоздатьГруппуЭлементовОтбора(Заказы.Отбор.Элементы,	"ПросроченныеЗаказы", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	Если ЗаказПросрочен Тогда
		Заказы.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСервера());
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораГруппыСписка(ПросроченныеЗаказы, "СборкаПросрочена", Истина, Истина, ВидСравненияКомпоновкиДанных.Равно);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораГруппыСписка(ПросроченныеЗаказы, "ДоставкаПросрочена", Истина, Истина, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		ПросроченныеЗаказы.Использование = Ложь;
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораГруппыСписка(ПросроченныеЗаказы, "СборкаПросрочена", Истина, Ложь, ВидСравненияКомпоновкиДанных.Равно);
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораГруппыСписка(ПросроченныеЗаказы, "ДоставкаПросрочена", Истина, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТребуетсяОбработка()
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(Заказы, "ТребуетсяОбработка", ТребуетсяВнимание, ТребуетсяВнимание);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрТрекНомер()
	
	ФильтрЖДП(2, Истина);
	
	ОтборыСписковКлиентСервер.УдалитьЭлементОтбораСписка(Заказы, "ТрекНомер");
	
	Если ЗначениеЗаполнено(ТрекНомер) Тогда
		
		ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ТрекНомер", ТрекНомер, ВидСравненияКомпоновкиДанных.Содержит);
		ФильтрЖДП(30, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрВитрина()

	ПКДВитринаИнтернетМагазина = Новый ПолеКомпоновкиДанных("ВитринаИнтернетМагазина");
	
	Если ЗначениеЗаполнено(Витрина) Тогда 
		
		ВитринаУстановлен = Ложь;
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДВитринаИнтернетМагазина Тогда
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ПравоеЗначение = Витрина;
				ВитринаУстановлен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ВитринаУстановлен Тогда
			ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ВитринаИнтернетМагазина", Витрина, ВидСравненияКомпоновкиДанных.Равно);
		КонецЕсли;
		
	Иначе
		
		Для Каждого ЭлементОтбора Из Заказы.Отбор.Элементы Цикл
			Если Не ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.ЛевоеЗначение = ПКДВитринаИнтернетМагазина Тогда
				ЭлементОтбора.Использование = Ложь;
				ЭлементОтбора.ПравоеЗначение = Неопределено;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ФильтрЖДП(ФильтрКоличествоДнейПоВитрине(Витрина), Истина);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ФильтрКоличествоДнейПоВитрине(Витрина)

	Если Витрина = Справочники.ВитриныИнтернетМагазина.Игрушки Тогда
		Возврат 15;
	ИначеЕсли Витрина = Справочники.ВитриныИнтернетМагазина.ОЗОН Тогда
		Возврат 15;
	ИначеЕсли Витрина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		Возврат 7;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	ФильтрМагазин();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ФильтрЖДП(2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаказаПриИзменении(Элемент)
	
	ФильтрНомерЗаказа();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПросроченПриИзменении(Элемент)
	
	ФильтрЗаказПросрочен();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяВниманиеПриИзменении(Элемент)
	ФильтрТребуетсяОбработка();
КонецПроцедуры

&НаКлиенте
Процедура ТрекНомерПриИзменении(Элемент)
	
	ФильтрТрекНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура ВитринаПриИзменении(Элемент)
	
	ФильтрВитрина();
	
КонецПроцедуры

#КонецОбласти

#Область ПринадлежностьВитрине

&НаСервереБезКонтекста
Функция ЭтоОЗОН(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ОЗОН Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоЯрчеПлюс(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоИгрушки(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.Игрушки Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоКДВ(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.КДВ Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоАлиэкспресс(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.Алиэкспресс Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоЯндексЕда(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯндексЕда Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоДаркКитчен(ЗаказСсылка)
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		Возврат РеквизитыЗаказа.НомерЗаказаНаСайте;
	КонецЕсли;
	Возврат "";
КонецФункции

#КонецОбласти

#Область МетодыФормыИСписоков

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним;
	ЭтаФорма.Заголовок = Заголовок;
	
	ПолныеПрава = РольДоступна("ПолныеПрава");
	ТехподдержкаИМРасширенная = РольДоступна("ТехподдержкаИМРасширенная");
	
	МассивВитринАРМ = Новый Массив;
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс);
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.ДаркКитчен);
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.Игрушки);
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.ОМС);
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.КДВ);
	МассивВитринАРМ.Добавить(Справочники.ВитриныИнтернетМагазина.ЯндексЕда);
	
	Элементы.Витрина.СписокВыбора.ЗагрузитьЗначения(МассивВитринАРМ);
	
	ДатаСейчас = ТекущаяДатаСервера();
	Заказы.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ДатаСейчас);
	//Заказы.Параметры.УстановитьЗначениеПараметра("ТекущаяДатаМинус20", ДатаСейчас - 20 * 3600 * 24);

	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ЖелаемаяДатаОтгрузки", ДатаСейчас - 2 * 24 * 3600, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Заказы, "ЖелаемаяДатаОтгрузки", ДатаСейчас + 2 * 24 * 3600, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
	СписокСкладовИМ = Новый СписокЗначений;
	УстановитьСписокСкладовИМ(СписокСкладовИМ);
	Элементы.Магазин.СписокВыбора.ЗагрузитьЗначения(СписокСкладовИМ.ВыгрузитьЗначения());
	Элементы.ВыгрузкаОстатковМагазин.СписокВыбора.ЗагрузитьЗначения(СписокСкладовИМ.ВыгрузитьЗначения());
	
	СписокСкладовРозничныеМагазины = Новый СписокЗначений;
	УстановитьСписокСкладовРозничныеМагазины(СписокСкладовРозничныеМагазины);
	Элементы.КоординатыМагазин.СписокВыбора.ЗагрузитьЗначения(СписокСкладовРозничныеМагазины.ВыгрузитьЗначения());
	
	КурьерыИКомплектовщикиСкрытьПомеченныеНаУдаление = Истина;

	ОтборИгрушкиДатаНачала = ДобавитьМесяц(ДатаСейчас, -2);
	ОтборИгрушкиДатаОкончания = ДатаСейчас + 2 * 24 * 3600;
	
	//ОтборЗаказыАлиДатаНачала = ДатаСейчас - 15 * 86400;
	//ОтборЗаказыАлиДатаОкончания = ДатаСейчас + 2 * 86400;
	
	СКД = О.ПолучитьМакет("ОстаткиМагазина");
	АдресВХ = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
	ОстаткиКомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	ОстаткиКомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	ПКДСклад = новый ПолеКомпоновкиДанных("Склад");
	ПКДНоменклатура = Новый ПолеКомпоновкиДанных("Номенклатура");
	Для Каждого ЭлементОтбораКомпоновщика Из ОстаткиКомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбораКомпоновщика) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Продолжить;
		КонецЕсли;
		Если ЭлементОтбораКомпоновщика.ЛевоеЗначение = ПКДСклад Тогда
			ЭлементОтбораКомпоновщика.Использование = Истина;
			ЭлементОтбораКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбораКомпоновщика.ПравоеЗначение = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;
		Если ЭлементОтбораКомпоновщика.ЛевоеЗначение = ПКДНоменклатура Тогда
			ЭлементОтбораКомпоновщика.Использование = Истина;
			ЭлементОтбораКомпоновщика.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			ЭлементОтбораКомпоновщика.ПравоеЗначение = Справочники.Номенклатура.НайтиПоНаименованию("Ассортиментная матрица");
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(О, "Объект");
	
	ПерезаполнитьТаблицуИнтернетМагазиныНаСервере();
	
	СвойствоШиротаСклада = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Широта");
	СвойствоДолготаСклада = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Долгота");
	СвойствоКоординатыГугл = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Координаты Google");
	СвойствоСтатусАктивности = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СтатусАктивнсти");
	
	ДоступныРасширенныеФункцииАРМ = ПолныеПрава ИЛИ ТехподдержкаИМРасширенная;
	
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и мороженого", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и выпечки", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и заморозки", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и выпечки и заморозки", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и мороженого и выпечки", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энергетиков и мороженого и заморозки", Истина));
	СписокСегментовЯрчеПлюс.Добавить(Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Ярче плюс без энерг. морож. выпеч. замороз", Истина));
	Для Каждого ЭлементСписка Из СписокСегментовЯрчеПлюс Цикл
		Элементы.СменаСегментаЦелевойСегмент.СписокВыбора.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбменССайтом.Склад КАК Склад,
	               |	ОбменССайтом.Витрина КАК Витрина,
	               |	ОбменССайтомУдержанияПриОтмене.Номенклатура КАК Номенклатура,
	               |	ОбменССайтомУдержанияПриОтмене.УдержаниеУстановленнойЦены КАК УдержаниеУстановленнойЦены,
	               |	ОбменССайтомУдержанияПриОтмене.УдержаниеПроцентаОтСуммыЗаказа КАК УдержаниеПроцентаОтСуммыЗаказа,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОбменССайтомУдержанияПриОтмене.Номенклатура) КАК Наименование
	               |ИЗ
	               |	ПланОбмена.ОбменССайтом.УдержанияПриОтмене КАК ОбменССайтомУдержанияПриОтмене
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменССайтом КАК ОбменССайтом
	               |		ПО ОбменССайтомУдержанияПриОтмене.Ссылка = ОбменССайтом.Ссылка
	               |ГДЕ
	               |	ОбменССайтом.Витрина В(&МассивВитрин)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад,
	               |	Витрина,
	               |	УдержаниеУстановленнойЦены,
	               |	УдержаниеПроцентаОтСуммыЗаказа
	               |ИТОГИ ПО
	               |	Склад,
	               |	Витрина
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("МассивВитрин", МассивВитринАРМ);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклад.Следующий() Цикл
		ВыборкаВитрина = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВитрина.Следующий() Цикл
			ВыборкаДетальныеЗаписи = ВыборкаВитрина.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НС = ТаблицаНоменклатурОтменыДаркКитчен.Добавить();
				ЗаполнитьЗначенияСвойств(НС, ВыборкаДетальныеЗаписи);
			КонецЦикла;
			НС = ТаблицаНоменклатурОтменыДаркКитчен.Добавить();
			НС.Склад = ВыборкаВитрина.Склад;
			НС.Витрина = ВыборкаВитрина.Витрина;
			НС.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			НС.Наименование = "Не удерживать";
			НС.УдержаниеУстановленнойЦены = Ложь;
			НС.УдержаниеПроцентаОтСуммыЗаказа = 0;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	ОтборРЗ = Новый Структура;
	ОтборРЗ.Вставить("Наименование", "Запуск обработок: Отмена заказов Ярче плюс");
	МассивРЗ = РегламентныеЗадания.ПолучитьРегламентныеЗадания(ОтборРЗ);
	Для каждого ЭлементМассива Из МассивРЗ Цикл
		УИДРоботаОтменыЗаказов = ЭлементМассива.УникальныйИдентификатор;
		Прервать;
	КонецЦикла;
	ДатаЗапускаРоботаОтменыЗаказовС = ТекущаяДата() + 3*86400;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму(Команда)
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	
	Заказы.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСервера());
	Элементы.Заказы.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ПодключитьОбработчикОжидания("ОбновитьОтображение", 120);
	//ЗаказыПосылкиЗапуститьФоновоеЗадание();
	//ЗаказыАлиЗапуститьФоновоеЗадание();
	
	//Элементы.ВыгрузкаОстатковНКЗ.Доступность = ПолныеПрава;
	Элементы.ВыгрузкаОстатковСтатусАктивности.Доступность = ПолныеПрава;
	Элементы.ЗаказыКонтекстноеМенюРазрешитьВозвратMagPay.Видимость = ДоступныРасширенныеФункцииАРМ;
	Элементы.ГруппаРоботОтменыЗаказов.Видимость = ДоступныРасширенныеФункцииАРМ И ЗначениеЗаполнено(УИДРоботаОтменыЗаказов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//Если ИмяСобытия = "ВводИнтервала" Тогда
	//	
	//	Для Каждого Заказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
	//		
	//		ВремяДоставки = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ВремяДоставкиС");
	//		ПеренестиЗаказ(Заказ, Параметр.ВремяДоставкиС, Параметр.ВремяДоставкиПо);
	//		Если НачалоДня(ВремяДоставки) - НачалоДня(Параметр.ВремяДоставкиС) <> 0 Тогда
	//			ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(Заказ);
	//		КонецЕсли;
	//		
	//	КонецЦикла; 
	//	
	//КонецЕсли;
	
	Если ИмяСобытия = "ОбновлениеДанныхСотрудникаИМ" Тогда
		ПеречитатьТаблицуКК();
	КонецЕсли;
	
	//Если ИмяСобытия = "ОбновлениеСпискаЗаказыПосылки" Тогда
	//	ОбновитьЗаказыПосылкиНаСервере();
	//	ОбновитьЗаголовокСтраницыЗаказыПосылки();
	//КонецЕсли;
	//
	//Если ИмяСобытия = "ОбновлениеСпискаЗаказыАли" Тогда
	//	ОбновитьЗаказыАлиНаСервере();
	//	ОбновитьЗаголовокСтраницыЗаказыАли();
	//КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеАдреса" Тогда
		Если Элементы.Заказы.ВыделенныеСтроки.Количество() <> 1 Тогда
			Возврат;
		КонецЕсли;
		ИзменитьАдресДоставкиЗаказа(Элементы.Заказы.ВыделенныеСтроки[0], Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.ГруппаВыгрузкаОстатковНаСайт Тогда
		ПолучитьТекущуюДатуЗапускаРоботаОтменыЗаказов();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ДополнительныеМетоды

&НаСервереБезКонтекста
Функция ТекущаяДатаСервера()
	Возврат ТекущаяДата();
КонецФункции

&НаСервере
Процедура ПерезаполнитьТаблицуИнтернетМагазиныНаСервере()
	
	ТаблицаИнтернетМагазины.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыДополнительныеРеквизиты.Ссылка КАК Магазин,
		|	ЕСТЬNULL(СкладыДополнительныеРеквизиты1.Значение, ЛОЖЬ) КАК СортировкаПоДатеЗаказа
		|ИЗ
		|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты1
		|		ПО СкладыДополнительныеРеквизиты.Ссылка = СкладыДополнительныеРеквизиты1.Ссылка
		|			И (СкладыДополнительныеРеквизиты1.Свойство.Наименование = ""СортировкаПоДатеЗаказаИМ"")
		|ГДЕ
		|	СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Склад интернет магазина""
		|	И СкладыДополнительныеРеквизиты.Значение = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	СортировкаПоДатеЗаказа УБЫВ,
		|	СкладыДополнительныеРеквизиты.Ссылка.Наименование";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаИнтернетМагазины.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСписокСкладовИМ(СписокВыбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СкладыДополнительныеРеквизиты.Ссылка КАК Склад,
		|	СкладыДополнительныеРеквизиты.Ссылка.Наименование КАК СкладНаименование
		|ИЗ
		|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменССайтом КАК ОбменССайтом
		|		ПО СкладыДополнительныеРеквизиты.Ссылка = ОбменССайтом.Склад
		|ГДЕ
		|	СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Склад интернет магазина""
		|	И СкладыДополнительныеРеквизиты.Значение = ИСТИНА
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладНаименование";
		
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад) Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Склад);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСписокСкладовРозничныеМагазины(СписокВыбора)
	
	Склад = Новый Массив;
	Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины работающие")); // Магазины работающие ()
	Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины готовы к открытию")); // Магазины готовы к открытию ()
	Склад.Добавить(Справочники.Склады.НайтиПоНаименованию("Цеха Dark Kitchen")); // Цеха Dark Kitchen ()
	
	КодТекущегоУзла = ОбщегоНазначенияСерверПовтИсп.ПолучитьКодТекущегоУзла();
	УзелОбмена = Справочники.ИнформационныеБазыОбмена.ПолучитьИнформационнуюБазуПоКодуУзла(КодТекущегоУзла);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкладыУзлаОбменаРИБ.Склад КАК Склад
	               |ИЗ
	               |	РегистрСведений.СкладыУзлаОбменаРИБ КАК СкладыУзлаОбменаРИБ
	               |ГДЕ
	               |	СкладыУзлаОбменаРИБ.УзелОбмена = &УзелОбмена
	               |	И СкладыУзлаОбменаРИБ.Склад В ИЕРАРХИИ(&Склад)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Запрос.УстановитьПараметр("Склад", Склад);
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Склад) Тогда
			Продолжить;
		КонецЕсли;
		СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Склад);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЧекИлиЭквайринговаяОперацияСуществуют(ЗаказСсылка)
	
	Если ЗначениеЗаполнено(ЗаказСсылка.ЧекПродажа) ИЛИ ЗначениеЗаполнено(ЗаказСсылка.ЭквайринговаяОперация) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСоглашениеПоСкладу(Знач Склад)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СоглашенияСКлиентами.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
	               |ГДЕ
	               |	СоглашенияСКлиентами.Склад = &Склад
	               |	И СоглашенияСКлиентами.Наименование ПОДОБНО ""Интернет-магазин%""";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Склад", Склад);
	РезультатВыборка = Запрос.Выполнить().Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		Возврат РезультатВыборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.СоглашенияСКлиентами.ПустаяСсылка();
	
КонецФункции

#КонецОбласти



#Область Печать

&НаКлиенте
Процедура ПечатьЗаказа(Команда)
	
	МассивЗаказовДляПечати = ПолучитьМассивЗаказовДляПечати(Элементы.Заказы.ВыделенныеСтроки);
	
	Если МассивЗаказовДляПечати.Количество() = 0 Тогда
		Сообщить("Нет заказов для печати");
		Возврат;
	КонецЕсли;
	
	ВнешняяПечатнаяФорма = НайтиПечатнуюФормуЗаказа();
	ВнешняяПечатнаяФормаЭтикетка = НайтиПечатнуюФормуЭтикетки();
	
	Если НЕ ВнешняяПечатнаяФорма.Пустая() Тогда
		ПараметрыОткрытия = Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных = ВнешняяПечатнаяФорма;
		ПараметрыОткрытия.ПараметрыИсточника = Новый Структура("ИдентификаторКоманды, БезопасныйРежим, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды = "ЗаказКлиентаИМ";
		ПараметрыОткрытия.ПараметрыИсточника.БезопасныйРежим = Ложь;
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения = МассивЗаказовДляПечати;
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, , Истина, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не обнаружена печатная форма заказа");
	КонецЕсли;
	//Если НЕ ВнешняяПечатнаяФормаЭтикетка.Пустая() Тогда
	//	ПараметрыОткрытияЭтикетка = Новый Структура("ИсточникДанных, ПараметрыИсточника");
	//    ПараметрыОткрытияЭтикетка.ИсточникДанных = ВнешняяПечатнаяФормаЭтикетка;
	//    ПараметрыОткрытияЭтикетка.ПараметрыИсточника = Новый Структура("ИдентификаторКоманды, БезопасныйРежим, ОбъектыНазначения");
	//    ПараметрыОткрытияЭтикетка.ПараметрыИсточника.ИдентификаторКоманды = "Этикетка";
	//	ПараметрыОткрытияЭтикетка.ПараметрыИсточника.БезопасныйРежим = Ложь;
	//    ПараметрыОткрытияЭтикетка.ПараметрыИсточника.ОбъектыНазначения = МассивЗаказовДляПечати;
	//    ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытияЭтикетка, , Истина); 
	//Иначе
	//	Сообщить("Не обнаружена печатная форма этикетки");
	//КонецЕсли;
	
	//Если НЕ ВнешняяПечатнаяФорма.Пустая() ИЛИ НЕ ВнешняяПечатнаяФормаЭтикетка.Пустая() Тогда
	Если НЕ ВнешняяПечатнаяФорма.Пустая() Тогда
		ОтметитьЗаказыКакНапечатанные(МассивЗаказовДляПечати);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьЗаказыКакНапечатанные(МассивЗаказовДляПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	СвойствоШК = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Штрихкод документа");
	Для Каждого ЭлементЗаказ Из МассивЗаказовДляПечати Цикл
		РСМЗ = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		РСМЗ.Объект = ЭлементЗаказ;
		РСМЗ.Свойство = СвойствоШК;
		РСМЗ.Значение = ЭлементЗаказ.НомерЗаказаНаСайте;
		РСМЗ.Записать(Истина);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивЗаказовДляПечати(Знач ИсходныйМассив)
	
	МассивЗаказов = новый Массив;
	Для Каждого ЭлементЗаказ Из ИсходныйМассив Цикл	
		//Если ЭлементЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		//	Продолжить;
		//КонецЕсли;
		ЕстьОшибка = Ложь;
		Если НЕ ЗначениеЗаполнено(ЭлементЗаказ.MagPayID) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ЭлементЗаказ.НомерЗаказаНаСайте + " ошибка! Отсутствует ""MagPayID""");
			ЕстьОшибка = Истина;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ЭлементЗаказ.MagPayRef) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + ЭлементЗаказ.НомерЗаказаНаСайте + " ошибка! Отсутствует ""MagPayRef""");
			ЕстьОшибка = Истина;
		КонецЕсли;
		Если ЕстьОшибка Тогда
			Продолжить;
		КонецЕсли;
		МассивЗаказов.Добавить(ЭлементЗаказ);
	КонецЦикла;
	Возврат МассивЗаказов;
	
КонецФункции

&НаСервере
Функция НайтиПечатнуюФормуЗаказа()
	
	СсылкаНаВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Заказ клиента (Интернет-магазин)");
	Возврат СсылкаНаВПФ;
	
КонецФункции

&НаСервере
Функция НайтиПечатнуюФормуЭтикетки()
	
	СсылкаНаВПФ = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("ЗаказКлиентаЭтикетка");
	Возврат СсылкаНаВПФ;
	
КонецФункции

#КонецОбласти

#Область ЯндексТакси

&НаКлиенте
Процедура СформироватьФайлЗаказаЯндексТакси(Команда)
	
	СписокТабДок = новый СписокЗначений;
	
	//СписокТабДок = ЯндексТаксиПолучитьСписокТабличныхДокументов(Элементы.Заказы.ВыделенныеСтроки);
	СписокТабДок = ЯндексТаксиПолучитьСписокТабличныхДокументов20230427(Элементы.Заказы.ВыделенныеСтроки);
	Если СписокТабДок.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Ошибка формирование файла'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение); 
	ДиалогСохраненияФайла.ПолноеИмяФайла = "Заявка вызова яндекс такси "+Формат(ТекущаяДата(),"ДФ=гггг-ММ-дд_ЧЧ-мм"); 
	ДиалогСохраненияФайла.Фильтр = "Книга Excel (*.xlsx)|*.xlsx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь; 
	ДиалогСохраненияФайла.Заголовок = "Выберите файл"; 
	Если ДиалогСохраненияФайла.Выбрать() Тогда 
		ИмяФайла = ДиалогСохраненияФайла.ПолноеИмяФайла; 
	Иначе
		Возврат;
	КонецЕсли;   	
	
	СохранитьОтчетыВФайлExcelСЛистами(СписокТабДок, ИмяФайла);
	ОбщегоНазначенияКлиентСервер.Задержка(5);
	ЗапуститьПриложение(ИмяФайла);
	
КонецПроцедуры

&НаСервере
Функция ЯндексТаксиПолучитьСписокТабличныхДокументов(Знач МассивЗаказов)
	
	СписокТабДок = Новый СписокЗначений;
	СписокЗаказов = Новый СписокЗначений;
	СписокЗаказов.ЗагрузитьЗначения(МассивЗаказов);
	СписокСкладов = Новый СписокЗначений;
	Для Каждого ЭлементЗаказ Из МассивЗаказов Цикл
		Если ЭлементЗаказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		Если СписокСкладов.НайтиПоЗначению(ЭлементЗаказ.Склад) = Неопределено Тогда
			СписокСкладов.Добавить(ЭлементЗаказ.Склад);
		КонецЕсли;
	КонецЦикла;
	О = РеквизитФормыВЗначение("Объект"); 
    НомераЗаказовСтрокой = "";
	//Страница 1
	ТабДок1 = Новый ТабличныйДокумент;
	МакетСтраница1 = О.ПолучитьМакет("ЯндексТаксиOrders");    
	ОбластьШапка = МакетСтраница1.ПолучитьОбласть("ОбластьШапка");
	ТабДок1.Вывести(ОбластьШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказКлиента.НомерЗаказаНаСайте,
	|	ЗаказКлиента.Широта,
	|	ЗаказКлиента.Долгота,
	|	ЗаказКлиента.ПокупательФИО,
	|	ЗаказКлиента.АдресДоставки,
	|	ЗаказКлиента.АдресДоставкиJSON,
	|	ЗаказКлиента.ПокупательТелефон,
	|	ЗаказКлиента.ВремяДоставкиС,
	|	ЗаказКлиента.ВремяДоставкиПо,
	|	ЗаказКлиента.Комментарий,
	|	ЗаказКлиента.КоличествоПакетов,
	|	ЕСТЬNULL(зкСтроки.КоличествоСтрок,0) КАК КоличествоСтрок,
	|	ЕСТЬNULL(ДС_Вес.Значение, 0) КАК Вес
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.НомерСтроки) КАК КоличествоСтрок
	|			ИЗ
	|				Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|			ГДЕ
	|				НЕ ЗаказКлиентаТовары.Отменено
	|			СГРУППИРОВАТЬ ПО
	|				ЗаказКлиентаТовары.Ссылка) КАК зкСтроки
	|		ПО ЗаказКлиента.Ссылка = зкСтроки.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДС_Вес
	|	ПО ЗаказКлиента.Ссылка = ДС_Вес.Объект
	|		И (ДС_Вес.Свойство.Наименование = ""Вес(ВМС)"")
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&СписокЗаказов)
	|";
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	ВыборкаЗаказы = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗаказы.Следующий() Цикл
		
		КоличествоМест = ВыборкаЗаказы.КоличествоПакетов;
		Если КоличествоМест < 1 Тогда //2020-11-30 только для перехода (1-2 дня), пока есть заказы с КолчествоПакетов = 0
			КоличествоМестТочное = ВыборкаЗаказы.КоличествоСтрок / 10;
			КоличествоМест = Цел(КоличествоМестТочное);
			Если КоличествоМестТочное - КоличествоМест > 0 Тогда
				КоличествоМест = КоличествоМест + 1;
			КонецЕсли;
		КонецЕсли;
		
		ВремяДоставкиС = ВыборкаЗаказы.ВремяДоставкиС;
		ВремяДоставкиПо = ВыборкаЗаказы.ВремяДоставкиПо;
		Если ПланыОбмена.Полный.ЭтотУзел().Код = "000" Тогда
			ВремяДоставкиС = ВремяДоставкиС - 4*3600;
			ВремяДоставкиПО = ВремяДоставкиПо - 4*3600;
		КонецЕсли;

		АдресДоставкиJSON = ВыборкаЗаказы.АдресДоставкиJSON;
		Попытка
			СтруктураАдресДоставкиJSON = JSONСерверВызовСервера.ПрочитатьJSON82(АдресДоставкиJSON);
		Исключение
			СтруктураАдресДоставкиJSON = новый Структура;
		КонецПопытки;
		Если ТипЗнч(СтруктураАдресДоставкиJSON) = Тип("Массив") Тогда
			Если СтруктураАдресДоставкиJSON.Количество()>0 Тогда
				СтруктураАдресДоставкиJSON = СтруктураАдресДоставкиJSON[0];
			Иначе
				СтруктураАдресДоставкиJSON = Новый Структура;
			КонецЕсли;
		КонецЕсли;
		АдресДоставки = ВыборкаЗаказы.АдресДоставки;
		Подъезд = "";
		Этаж = "";
		Квартира = "";
		Домофон = "";
		Если ТипЗнч(СтруктураАдресДоставкиJSON) = Тип("Структура") Тогда
			Если СтруктураАдресДоставкиJSON.Свойство("address") Тогда
				Если ЗначениеЗаполнено(СтруктураАдресДоставкиJSON.address) Тогда
					АдресДоставки = СтруктураАдресДоставкиJSON.address;
				КонецЕсли;
			КонецЕсли;
			Если СтруктураАдресДоставкиJSON.Свойство("entrance") Тогда
				Подъезд = СтруктураАдресДоставкиJSON.entrance;
			КонецЕсли;
			Если СтруктураАдресДоставкиJSON.Свойство("floor") Тогда
				Этаж = СтруктураАдресДоставкиJSON.floor;
			КонецЕсли;
			Если СтруктураАдресДоставкиJSON.Свойство("apartment") Тогда
				Квартира = СтруктураАдресДоставкиJSON.apartment;
			КонецЕсли;
			Если СтруктураАдресДоставкиJSON.Свойство("intercom") Тогда
				Домофон = СтруктураАдресДоставкиJSON.intercom;
			КонецЕсли;
		КонецЕсли;
		
		Попытка 
			Широта = Число(Лев(СокрЛП(ВыборкаЗаказы.Широта),10));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В заказе " + ВыборкаЗаказы.НомерЗаказаНаСайте + " не заполнена ""Широта"" доставки");
			Широта = "";
		КонецПопытки;
		Попытка
			Долгота = Число(Лев(СокрЛП(ВыборкаЗаказы.Долгота),10));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В заказе " + ВыборкаЗаказы.НомерЗаказаНаСайте + " не заполнена ""Долгота"" доставки");
			Долгота = "";
		КонецПопытки;
		
		НомераЗаказовСтрокой = НомераЗаказовСтрокой + ?(СтрДлина(НомераЗаказовСтрокой)>0, ", ", "") + ВыборкаЗаказы.НомерЗаказаНаСайте;
		ОбластьСтрока = МакетСтраница1.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.НомерЗаказа = ВыборкаЗаказы.НомерЗаказаНаСайте;
		ОбластьСтрока.Параметры.Широта = Широта;
		ОбластьСтрока.Параметры.Долгота = Долгота;
		ОбластьСтрока.Параметры.НаименованиеПолучателя = ВыборкаЗаказы.ПокупательФИО;
		ОбластьСтрока.Параметры.АдресПолучателя = АдресДоставки;
		ОбластьСтрока.Параметры.Подъезд = Подъезд;
		ОбластьСтрока.Параметры.Этаж = Этаж;
		ОбластьСтрока.Параметры.Квартира = Квартира;
		ОбластьСтрока.Параметры.Домофон = "";
		ОбластьСтрока.Параметры.Телефон = ВыборкаЗаказы.ПокупательТелефон;
		ОбластьСтрока.Параметры.ВременноеОкно = Формат(ВремяДоставкиС, "ДФ = ЧЧ:мм") + " - " + Формат(ВремяДоставкиПо, "ДФ = ЧЧ:мм");
		ОбластьСтрока.Параметры.ЖесткоеВременноеОкно = "TRUE";
		ОбластьСтрока.Параметры.ВремяОбслуживанияНаАдрес = 600;
		ОбластьСтрока.Параметры.ВремяОбслуживанияНаЗаказ = 120;
		ОбластьСтрока.Параметры.ВесБрутто = Окр(ВыборкаЗаказы.Вес+0.5,0,РежимОкругления.Окр15как20);
		ОбластьСтрока.Параметры.КоличествоМест = КоличествоМест;
		ОбластьСтрока.Параметры.Ширина = "";
		ОбластьСтрока.Параметры.Глубина = "";
		ОбластьСтрока.Параметры.Высота = "";
		ОбластьСтрока.Параметры.ТипЗаказа = "delivery";
		ОбластьСтрока.Параметры.МестоНазначения = "";
		ОбластьСтрока.Параметры.ТипСовместимости = "food";
		ОбластьСтрока.Параметры.ВремяЗагрузкиНаСкладе = 180;
		ОбластьСтрока.Параметры.Комментарий = ВыборкаЗаказы.Комментарий;
		ТабДок1.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	//Страница 2
	ТабДок2 = Новый ТабличныйДокумент;
	МакетСтраница2 = О.ПолучитьМакет("ЯндексТаксиDepot");    
	ОбластьШапка = МакетСтраница2.ПолучитьОбласть("ОбластьШапка");
	ТабДок2.Вывести(ОбластьШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Склады.Наименование КАК Наименование,
	|	ЕСТЬNULL(СкладыКонтактнаяИнформация.Представление, """") КАК Адрес,
	|	ЕСТЬNULL(ДРШирота.Значение, """") КАК Широта,
	|	ЕСТЬNULL(ДРДолгота.Значение, """") КАК Долгота,
	|	ЕСТЬNULL(ДРКодСклада.Значение, """") КАК КодСклада,
	|	ЕСТЬNULL(ПользователиКонтактнаяИнформация.НомерТелефона, """") КАК НомерТелефона
	|ИЗ
	|	Справочник.Склады КАК Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	|		ПО Склады.Ссылка = СкладыКонтактнаяИнформация.Ссылка
	|			И (СкладыКонтактнаяИнформация.Тип = &ТипКИ)
	|			И (СкладыКонтактнаяИнформация.Вид.Наименование = ""Адрес склада"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК ДРШирота
	|		ПО Склады.Ссылка = ДРШирота.Ссылка
	|			И (ДРШирота.Свойство.Наименование = ""Широта"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК ДРДолгота
	|		ПО Склады.Ссылка = ДРДолгота.Ссылка
	|			И (ДРДолгота.Свойство.Наименование = ""Долгота"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК ДРКодСклада
	|		ПО Склады.Ссылка = ДРКодСклада.Ссылка
	|			И (ДРКодСклада.Свойство.Наименование = ""КодМагазинаСклада"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	|		ПО ПользователиКонтактнаяИнформация.Ссылка = &ТекущийПользователь
	|			И ПользователиКонтактнаяИнформация.Тип = &ТипКИПользователя
	|			И ПользователиКонтактнаяИнформация.Вид = &ВидКИПользователя
	|ГДЕ
	|	Склады.Ссылка В (&СписокСкладов)";
	Запрос.УстановитьПараметр("СписокСкладов", СписокСкладов);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);                                      
		ГруппаВидКИПользователя = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Пользователи""");
		ВидКИПользователя = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон", , ГруппаВидКИПользователя);
	Запрос.УстановитьПараметр("ВидКИПользователя", ВидКИПользователя);
	Запрос.УстановитьПараметр("ТипКИПользователя", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ВыборкаСклады = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСклады.Следующий() Цикл
		
		АдресМагазина = ВыборкаСклады.Адрес;
		Если ВыборкаСклады.КодСклада = "М040" Тогда
			АдресМагазина = СокрЛП("Королёв, проспект Космонавтов, 4Г");
		КонецЕсли;
		
		Попытка 
			Широта = Число(Лев(СокрЛП(ВыборкаСклады.Широта),10));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для магазина " + ВыборкаСклады.КодСклада + " не заполнена ""Широта""");
			Широта = "";
		КонецПопытки;
		Попытка
			Долгота = Число(Лев(СокрЛП(ВыборкаСклады.Долгота),10));
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для магазина " + ВыборкаСклады.КодСклада + " не заполнена ""Долгота""");
			Долгота = "";
		КонецПопытки;
		
		ОбластьСтрока = МакетСтраница2.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.КодСклада = ВыборкаСклады.КодСклада;
		ОбластьСтрока.Параметры.НазваниеСклада = "Ярче";
		ОбластьСтрока.Параметры.АдресСклада = АдресМагазина;
		ОбластьСтрока.Параметры.Подъезд = "";
		ОбластьСтрока.Параметры.Этаж = "";
		ОбластьСтрока.Параметры.Квартира = "";
		ОбластьСтрока.Параметры.Домофон = "";
		ОбластьСтрока.Параметры.Широта = Широта;
		ОбластьСтрока.Параметры.Долгота = Долгота;
		ОбластьСтрока.Параметры.ВремяРаботы = "09:00 - 22:00";
		ОбластьСтрока.Параметры.ДатаРасчетаМаршрута = Формат(ТекущаяДата(), "ДФ = дд.ММ.гггг");
		ОбластьСтрока.Параметры.ГибкоеВремяСтарта = "";
		ОбластьСтрока.Параметры.ЖесткоеВремяРаботыСклада = "";
		ОбластьСтрока.Параметры.ВремяОбслуживанияВНачалеМаршрута = "";
		ОбластьСтрока.Параметры.ВремяОбслуживанияВКонцеМаршрута = "";
		ОбластьСтрока.Параметры.Комментарий = "Доставка из магазина Ярче. Менеджеру скажите, что заказ по доставке Яндекс.Такси. Назовите номер(а) заказа(ов) "+НомераЗаказовСтрокой+" и заберите посылку. Заказ оплачен безналично, при передаче заказа нельзя требовать с получателя деньги за доставку.";
		ОбластьСтрока.Параметры.ПочтаСклада = "support@yarcheplus.ru";
		ОбластьСтрока.Параметры.ТелефонСклада = ?(СтрДлина(ВыборкаСклады.НомерТелефона) = 0, "78002504444", СокрЛП(ВыборкаСклады.НомерТелефона));
		ОбластьСтрока.Параметры.ВозвратНаСклад = "";
		ТабДок2.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	//Страница 3
	ТабДок3 = Новый ТабличныйДокумент;
	МакетСтраница3 = О.ПолучитьМакет("ЯндексТаксиIncompatible_order_types");    
	ОбластьШапка = МакетСтраница3.ПолучитьОбласть("ОбластьШапка");
	ТабДок3.Вывести(ОбластьШапка);
	
	//Страница 4
	ТабДок4 = Новый ТабличныйДокумент;
	МакетСтраница4 = О.ПолучитьМакет("ЯндексТаксиOptions");    
	ОбластьШапка = МакетСтраница4.ПолучитьОбласть("ОбластьШапка");
	ТабДок4.Вывести(ОбластьШапка);
	ОбластьСтрока = МакетСтраница4.ПолучитьОбласть("ОбластьСтрока");
	ОбластьСтрока.Параметры.Мультизаказы = "TRUE";
	ОбластьСтрока.Параметры.МинимизацияРискаОпозданий = "";
	ОбластьСтрока.Параметры.ФакторУстойчивостиМаршрута = 1.3;
	ОбластьСтрока.Параметры.ИзбегатьПлатныеДороги = "TRUE";
	ТабДок4.Вывести(ОбластьСтрока);
	
	СписокТабДок.Добавить(ТабДок1, "Orders");
	СписокТабДок.Добавить(ТабДок2, "Depot");
	СписокТабДок.Добавить(ТабДок3, "Incompatible_order_types");
	СписокТабДок.Добавить(ТабДок4, "Options");
	
	Возврат СписокТабДок;
	
КонецФункции

&НаСервере
Функция ЯндексТаксиПолучитьСписокТабличныхДокументов20230427(Знач МассивЗаказов)
	
	СписокТабДок = Новый СписокЗначений;
	СписокЗаказов = Новый СписокЗначений;
	СписокЗаказов.ЗагрузитьЗначения(МассивЗаказов);
	СписокСкладов = Новый СписокЗначений;
	Для Каждого ЭлементЗаказ Из МассивЗаказов Цикл
		Если ЭлементЗаказ = Документы.ЗаказКлиента.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		Если СписокСкладов.НайтиПоЗначению(ЭлементЗаказ.Склад) = Неопределено Тогда
			СписокСкладов.Добавить(ЭлементЗаказ.Склад);
		КонецЕсли;
	КонецЦикла;
	О = РеквизитФормыВЗначение("Объект"); 
	//Страница 1
	ТабДок1 = Новый ТабличныйДокумент;
	МакетСтраница1 = О.ПолучитьМакет("ЯндексТаксиOrders20230423");    
	ОбластьШапка = МакетСтраница1.ПолучитьОбласть("ОбластьШапка");
	ТабДок1.Вывести(ОбластьШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.НомерЗаказаНаСайте КАК НомерЗаказа,
	               |	""Ярче"" КАК ИмяОтправителя,
	               |	""+78002504444"" КАК ТелефонОтправителя,
	               |	ЕСТЬNULL(СкладыКонтактнаяИнформация.Представление, """") КАК АдресОтправления,
	               |	ЕСТЬNULL(СкладыКонтактнаяИнформация.ЗначенияПолей, """") КАК АдресОтправленияЗначенияПолей,
	               |	"""" КАК ПочтовыйИндексОтправления,
	               |	""Доставка из магазина Ярче!. Продавцу на кассе скажите, что заказ по доставке Яндекс.Go. Назовите номер заказа YR номер заказа и заберите посылку. Заказ оплачен безналично, при передаче заказа нельзя требовать с получателя деньги за доставку."" КАК КомментарийКТочкеОтправления,
	               |	ЗаказКлиента.ПокупательФИО КАК ИмяПолучателя,
	               |	ЗаказКлиента.ПокупательТелефон КАК ТелефонПолучателя,
	               |	ЗаказКлиента.АдресДоставки КАК АдресДоставки,
	               |	"""" КАК ПочтовыйИндексПолучателя,
	               |	ЗаказКлиента.ДополнительнаяИнформация КАК КомментарийКТочкеДоставки,
	               |	"""" КАК Ширина,
	               |	"""" КАК Высота,
	               |	"""" КАК Длина,
	               |	ЕСТЬNULL(ДС_Вес.Значение, """") КАК Вес,
	               |	ЗаказКлиента.СуммаДокумента КАК СтоимостьЗаказа,
	               |	""RUB"" КАК ВалютаISO,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(зкСтроки.КоличествоСтрок, 0) / 10 - ЦЕЛ(ЕСТЬNULL(зкСтроки.КоличествоСтрок, 0) / 10) = 0
	               |			ТОГДА ЦЕЛ(ЕСТЬNULL(зкСтроки.КоличествоСтрок, 0) / 10)
	               |		ИНАЧЕ ЦЕЛ(ЕСТЬNULL(зкСтроки.КоличествоСтрок, 0) / 10) + 1
	               |	КОНЕЦ КАК Количество,
	               |	ЗаказКлиента.ПокупательEmail КАК АдресЭлектроннойПочтыПолучателя,
	               |	""FALSE"" КАК Автопринятие,
	               |	""express"" КАК Тариф,
	               |	ЕСТЬNULL(зкСтроки.КоличествоСтрок, 0) КАК КоличествоСтрок,
	               |	ЛЕВ(ЗаказКлиента.Склад.Наименование, 4) КАК КодСклада,
	               |	ЗаказКлиента.KDVID,
	               |	ЗаказКлиента.ВитринаИнтернетМагазина,
	               |	ЗаказКлиента.URL
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказКлиентаТовары.Ссылка КАК Ссылка,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.НомерСтроки) КАК КоличествоСтрок
	               |		ИЗ
	               |			Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ГДЕ
	               |			НЕ ЗаказКлиентаТовары.Отменено
	               |			И ЗаказКлиентаТовары.Ссылка В(&СписокЗаказов)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЗаказКлиентаТовары.Ссылка) КАК зкСтроки
	               |		ПО ЗаказКлиента.Ссылка = зкСтроки.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДС_Вес
	               |		ПО ЗаказКлиента.Ссылка = ДС_Вес.Объект
	               |			И (ДС_Вес.Свойство.Наименование = ""Вес(ВМС)"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК СкладыКонтактнаяИнформация
	               |		ПО ЗаказКлиента.Склад = СкладыКонтактнаяИнформация.Ссылка
	               |			И (СкладыКонтактнаяИнформация.Тип = &ТипКИ)
	               |			И (СкладыКонтактнаяИнформация.Вид.Наименование = ""Адрес склада"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |		ПО (ПользователиКонтактнаяИнформация.Ссылка = &ТекущийПользователь)
	               |			И (ПользователиКонтактнаяИнформация.Тип = &ТипКИПользователя)
	               |			И (ПользователиКонтактнаяИнформация.Вид = &ВидКИПользователя)
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка В(&СписокЗаказов)";
	Запрос.УстановитьПараметр("СписокЗаказов", СписокЗаказов);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Адрес);                                      
		ГруппаВидКИПользователя = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Пользователи""");
		ВидКИПользователя = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон", , ГруппаВидКИПользователя);
	Запрос.УстановитьПараметр("ВидКИПользователя", ВидКИПользователя);
	Запрос.УстановитьПараметр("ТипКИПользователя", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ВыборкаЗаказы = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗаказы.Следующий() Цикл
		
		ОбластьСтрока = МакетСтраница1.ПолучитьОбласть("ОбластьСтрока");                 
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, ВыборкаЗаказы); 

		//kdv id
		Если ВыборкаЗаказы.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") Тогда
			main_partner_kdvid = "Yarche";
		ИначеЕсли ВыборкаЗаказы.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
			И СтрНайти(НРег(ВыборкаЗаказы.URL), "kdvonline") > 0 Тогда
			main_partner_kdvid = "KDV";
		ИначеЕсли ВыборкаЗаказы.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
			И СтрНайти(НРег(ВыборкаЗаказы.URL), "toybe") > 0 Тогда
			main_partner_kdvid = "Toybe";
		ИначеЕсли ВыборкаЗаказы.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
			И СтрНайти(НРег(ВыборкаЗаказы.URL), "yarcheplus") > 0 Тогда
			main_partner_kdvid = "Yarche";
		Иначе
			main_partner_kdvid = Неопределено;		
		КонецЕсли;
		СтруктураПерсональныхДанных = KDVID.АвторизоватьсяИПолучитьПерсональныеДанные(ВыборкаЗаказы.KDVID, main_partner_kdvid);
		Если ПустаяСтрока(СтруктураПерсональныхДанных.description) Тогда
			Если ТипЗнч(СтруктураПерсональныхДанных.data) = Тип("Структура") Тогда
				Если СтруктураПерсональныхДанных.data.Свойство("phone") Тогда
					ТелефонПолучателя = СтруктураПерсональныхДанных.data.phone;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТелефонПолучателя = ВыборкаЗаказы.ТелефонПолучателя;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.ИмяПолучателя = "Уважаемый клиент";
		ОбластьСтрока.Параметры.АдресЭлектроннойПочтыПолучателя = "service.yarche@yandex.ru"; 
		ОбластьСтрока.Параметры.ТелефонПолучателя = ТелефонПолучателя;
		
		АдресОтправленияСЗ = ПолучитьСписокЗначенийИзСтрокиАдреса(ВыборкаЗаказы.АдресОтправленияЗначенияПолей);

		Если ВРег(ВыборкаЗаказы.КодСклада) = ВРег("М096") Тогда
			АдресОтправления = ВыборкаЗаказы.АдресОтправления;
			АО_Индекс = "";
			Для Каждого ЗначениеАдреса Из АдресОтправленияСЗ Цикл
				Если ЗначениеАдреса.Представление = "Индекс" Тогда 
					АО_Индекс = ЗначениеАдреса.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			АдресОтправления = СокрЛП(СтрЗаменить(АдресОтправления, АО_Индекс+",", ""));
		Иначе
			АО_Индекс = "";
			АО_Регион = "";
			АО_Город = ""; 
			АО_НаселенныйПункт = "";
			АО_Улица = "";
			АО_Дом = "";
			АО_ТипДома = "";
			АО_Корпус = "";   
			АО_Строение = "";
			АО_Дополнение = "";
			Для Каждого ЗначениеАдреса Из АдресОтправленияСЗ Цикл
				Если ЗначениеАдреса.Представление = "Индекс" Тогда 
					АО_Индекс = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "Регион" Тогда 
					АО_Регион = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "Город" Тогда 
					АО_Город = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "НаселенныйПункт" Тогда
					АО_НаселенныйПункт = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "Улица" Тогда 
					АО_Улица = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "Дом" Тогда 
					АО_Дом = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "ТипДома" Тогда 
					АО_ТипДома = ЗначениеАдреса.Значение;
				КонецЕсли;   
				Если ЗначениеАдреса.Представление = "Корпус" Тогда
					АО_Корпус = ЗначениеАдреса.Значение;
				КонецЕсли;            
				Если ЗначениеАдреса.Представление = "Строение" Тогда  
					АО_Строение = ЗначениеАдреса.Значение;
				КонецЕсли;
				Если ЗначениеАдреса.Представление = "Дополнение" Тогда
					АО_Дополнение = ЗначениеАдреса.Значение;
				КонецЕсли;
			КонецЦикла;
			АдресОтправления = АО_Регион
								+ ?(ПустаяСтрока(АО_Город), "", ", ") + АО_Город
								+ ?(ПустаяСтрока(АО_НаселенныйПункт), "", ", ") + АО_НаселенныйПункт
								+ ?(ПустаяСтрока(АО_Улица), "", ", ") + АО_Улица
								+ ?(ПустаяСтрока(АО_ТипДома), "", ", ") + АО_ТипДома + ?(ПустаяСтрока(АО_ТипДома), "", " ")
								+ ?(ПустаяСтрока(АО_Дом), "", "№ ") + АО_Дом
								+ ?(ПустаяСтрока(АО_Корпус), "", ", к. ") + АО_Корпус
								+ ?(ПустаяСтрока(АО_Строение), "", ", стр. ") + АО_Строение
								+ ?(ПустаяСтрока(АО_Дополнение), "", ", ") + АО_Дополнение;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.АдресОтправления = АдресОтправления;
		ОбластьСтрока.Параметры.ПочтовыйИндексОтправления = АО_Индекс;
		
		ТабДок1.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	СписокТабДок.Добавить(ТабДок1, "data");
	
	Возврат СписокТабДок;
	
КонецФункции

&НаКлиенте
Процедура СохранитьОтчетыВФайлExcelСЛистами(СписокОтчетов, ИмяФайла) Экспорт
	
	Эксель    = Новый COMObject("Excel.Application");
	Эксель.FileValidation = 1;	
	Эксель.DisplayAlerts = false;	
	
	Первый = истина;
	
	//Для защиты от дублей имен
	СооИмена = Новый СписокЗначений();
	
	//Перебираем отчеты в MXL
	Для Каждого Элемент ИЗ СписокОтчетов Цикл
		ТабДок = Элемент.Значение;
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("XLSX");
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX); //Сохраняем в временный файл

		ТекКнига = Эксель.Workbooks.Open(ИмяВременногоФайла, ,1);
		Если Первый Тогда
			Книга = ТекКнига; //Первый файл и есть результат, чтобы сохранялись цвета
		Иначе
			ТекКнига.Sheets(1).Copy(, Книга.Sheets(Книга.Sheets.Count)); //Copy(Before, After)
		КонецЕсли;

		УдалитьФайлы(ИмяВременногоФайла);
		
        //Защита от одинаковых ярлыков
		ТекБазаНаименование = Элемент.Представление;
		ТекНаименование = ТекБазаНаименование; СчНаименований = 2;
		Пока СооИмена.НайтиПоЗначению(ТекНаименование) <> Неопределено Цикл
			ТекНаименование = ТекБазаНаименование + "(" + СчНаименований + ")";
			СчНаименований = СчНаименований + 1;
		КонецЦикла;
		СооИмена.Добавить(ТекНаименование);
		Книга.Sheets(Книга.Sheets.Count).Name = ТекНаименование; //Переименовываем

		Если Первый Тогда
			//Делаем доступными ярлыки листов
			Эксель.ActiveWindow.DisplayWorkbookTabs = 1;
			Эксель.ActiveWindow.TabRatio = 0.6;
			Первый = ложь;
		Иначе
			ТекКнига.Close();
		КонецЕсли;

	КонецЦикла;
	
	//Удаляем, чтобы не переспрашивал
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;

	Книга.SaveAs(ИмяФайла, 51); //18 - xls 97-2003; 51 - xlsx 2007-2013

	Книга.Close();
	Эксель.Application.Quit();
	
КонецПроцедуры

#КонецОбласти

#Область KDVID

&НаКлиенте
Процедура KDVID(Команда)
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ПерсональныеДанные", Новый Структура("Заказ", Элементы.Заказы.ТекущаяСтрока));
КонецПроцедуры

#КонецОбласти

#Область ОтправитьСМС

&НаКлиенте
Процедура ОтправитьСМСКлиенту(Команда)
	
	П = Новый Структура;
	П.Вставить("МассивЗаказов", Элементы.Заказы.ВыделенныеСтроки);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаОтправкиСМСКлиенту", П);
	
КонецПроцедуры

#КонецОбласти

#Область ОтменитьЗаказ

&НаКлиенте
Процедура ОтменитьЗаказ(Команда)
	
	ОтветПользователя = Вопрос(НСтр("ru = 'Вы действительно хотите отменить выделенные заказы?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		
		ПричинаОтмены = "";
		ВвестиСтроку(ПричинаОтмены, "Введите причину отмены: ");
		
		Для Каждого Стр Из Элементы.Заказы.ВыделенныеСтроки Цикл
			
			ОтменаКлиентом = Ложь;
			НоменклатураУдержание = Неопределено;
			
			РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Стр, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина, Статус, ПриложениеСборщика, ЧекПродажа, ЭквайринговаяОперация, Доставлен, Склад");
			НомерЗаказаНаСайте = РеквизитыЗаказа.НомерЗаказаНаСайте;
			ВитринаЗаказа = РеквизитыЗаказа.ВитринаИнтернетМагазина;
			
			//проверки
			Если НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") И 
				НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") И 
				НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.КДВ") И 
				НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ОЗОН") И
				НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " не является заказом ЯрчеПлюс, Посылки, КДВ ИМ, ОЗОН, ДаркКитчен" + Символы.ПС + "Отмена заказа невозможна");
				Продолжить;
			КонецЕсли;
			
			Если (ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") ИЛИ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен"))
				И РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " закрыт" + Символы.ПС + "Отмена закрытого заказа невозможна");
				Продолжить;
			КонецЕсли;
			
			Если ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.Игрушки") 
				И РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт")
				И ЗначениеЗаполнено(РеквизитыЗаказа.ЭквайринговаяОперация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " закрыт" + Символы.ПС + "Отмена закрытого заказа невозможна");
				Продолжить;
			КонецЕсли;
			
			Если ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.КДВ") 
				И РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт")
				И РеквизитыЗаказа.Доставлен = Истина Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " закрыт" + Символы.ПС + "Отмена закрытого заказа невозможна");
				Продолжить;
			КонецЕсли;
			
			Если ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ОЗОН") 
				И РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт")
				И (РеквизитыЗаказа.Доставлен = Истина ИЛИ ЗначениеЗаполнено(РеквизитыЗаказа.ЭквайринговаяОперация)) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " закрыт" + Символы.ПС + "Отмена закрытого заказа невозможна");
				Продолжить;
			КонецЕсли;
			
			//логика отмены по витринам
			Если ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ОЗОН") Тогда
				
				Если Вопрос("Заказ ОЗОН " + НомерЗаказаНаСайте + " отменен по инициативе клиента (невозможности вручить клиенту заказ)?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ОтменаКлиентом = Истина;
				КонецЕсли;
				
			ИначеЕсли ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
				
				ОтменаКлиентом = Истина;
				
				СписокНоменклатурОтменыДаркКитчен = Новый СписокЗначений;
				НайденныеСтроки = ТаблицаНоменклатурОтменыДаркКитчен.НайтиСтроки(Новый Структура("Склад, Витрина", РеквизитыЗаказа.Склад, ВитринаЗаказа));
				Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
					СписокНоменклатурОтменыДаркКитчен.Добавить(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Наименование);
				КонецЦикла;
				Если СписокНоменклатурОтменыДаркКитчен.Количество() Тогда
					РезультатВыбора = СписокНоменклатурОтменыДаркКитчен.ВыбратьЭлемент(Строка(НомерЗаказаНаСайте) + ": Выбери удержание");
					Если РезультатВыбора = Неопределено Тогда
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Заказ %1: не выбрано удержание.
                                                                                      |Отмена заказа невозможна'"), НомерЗаказаНаСайте));
						Продолжить;
					КонецЕсли;
					НоменклатураУдержание = РезультатВыбора.Значение;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗакрытьЗаказ(Стр, ПричинаОтмены, ОтменаКлиентом, НоменклатураУдержание);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗакрытьЗаказ(ЗаказСсылка, ОписаниеПричиныОтмены, ОтменаКлиентом = Ложь, НоменклатураУдержание = Неопределено)
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина, Статус, ПриложениеСборщика, ЧекПродажа, ЭквайринговаяОперация, Доставлен, Склад");
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПричинаОтмены = Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Отказ");
	ДатаОтменыЗаказа = ТекущаяДата();
	МассивДобавленныхНоменклатур = Новый Массив;
	
	ИспользуемКорРТУ = Ложь;
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.КДВ Тогда
		ИспользуемКорРТУ = Истина;
	КонецЕсли;
	
	Заказ = ЗаказСсылка.ПолучитьОбъект();
	
	//отменяем заказ
	Для Каждого СЗ Из Заказ.Товары Цикл
		Если НЕ СЗ.Отменено Тогда
			СЗ.Отменено = Истина;
			СЗ.ПричинаОтмены = ПричинаОтмены;
		КонецЕсли;
	КонецЦикла;
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		
		Если ЗначениеЗаполнено(НоменклатураУдержание) Тогда
			
			ЦенаДопУслуги = 0;
			РеквизитыСоглашения = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ.Соглашение, "ВидЦен");
			
			НайденныеСтроки = ТаблицаНоменклатурОтменыДаркКитчен.НайтиСтроки(Новый Структура("Склад, Витрина, Номенклатура", РеквизитыЗаказа.Склад, РеквизитыЗаказа.ВитринаИнтернетМагазина, НоменклатураУдержание));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				Если НайденнаяСтрока.УдержаниеУстановленнойЦены Тогда
					Если ЗначениеЗаполнено(РеквизитыСоглашения.ВидЦен) Тогда
						ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
						ЦенаДопУслуги = ОбработкаОбъект.ПолучитьЦенуНоменклатуры(НоменклатураУдержание, РеквизитыСоглашения.ВидЦен);
					КонецЕсли;
				Иначе
					ЦенаДопУслуги = Окр(Заказ.СуммаДокумента * НайденнаяСтрока.УдержаниеПроцентаОтСуммыЗаказа / 100, 2)
				КонецЕсли;
			КонецЦикла;
			
			Если ЦенаДопУслуги <> 0 Тогда
				
				ДопУслугаОтмены = Заказ.Товары.Добавить();
				ДопУслугаОтмены.Номенклатура = НоменклатураУдержание;
				ДопУслугаОтмены.КоличествоУпаковок = 1;
				ДопУслугаОтмены.Количество = 1;
				ДопУслугаОтмены.ВидЦены = РеквизитыСоглашения.ВидЦен;
				ДопУслугаОтмены.Цена = ЦенаДопУслуги;
				ДопУслугаОтмены.КоличествоШтук = 1;
				ДопУслугаОтмены.ДатаОтгрузки = Заказ.ЖелаемаяДатаОтгрузки;
				ДопУслугаОтмены.Склад = Заказ.Склад;
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Заказ.НалогообложениеНДС);
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Заказ));
				
				СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
				
				КэшированныеЗначения = ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
				ОбработкаТабличнойЧастиТоварыСервер.ОбработатьСтрокуТЧСервер(ДопУслугаОтмены, СтруктураДействий, КэшированныеЗначения);
				
				МассивДобавленныхНоменклатур.Добавить(НоменклатураУдержание);
				
				Заказ.Доставлен = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	Заказ.Комментарий = Заказ.Комментарий + ?(ЗначениеЗаполнено(Заказ.Комментарий), Символы.ПС, "") 
												+ Формат(ДатаОтменыЗаказа, "ДФ='dd.MM.yyyy HH:mm:ss'") + " " + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС
												+ "Отменен по причине:" + ОписаниеПричиныОтмены;
	Заказ.ПользовательОтмены = ПараметрыСеанса.ТекущийПользователь;
	Заказ.СуммаДокумента = Заказ.ПолучитьСуммуЗаказанныхСтрок();
	Заказ.ОтменаКлиентом = ОтменаКлиентом;
	Заказ.ЗаполнитьЭтапыГрафикаОплаты();
	Заказ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
	Заказ.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
	Заказ.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	
	Реализация = Неопределено;
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.Игрушки
		ИЛИ РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.КДВ
		ИЛИ РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ОЗОН Тогда 
		
		Реализация = ИнтернетМагазинСлужебный.РеализацияПоЗаказу(ЗаказСсылка);
		Если Реализация <> Неопределено Тогда
			
			ВозвратОбъект = Неопределено;
			КорректировкаРегистровОбъект = Неопределено;

			Если ИспользуемКорРТУ Тогда
				ОснованиеКорректировки = ИнтернетМагазинСлужебный.ДокументаОснованиеДляКорректировкиРеализации(Реализация);
				КорректировкаРеализацииОбъект = ИнтернетМагазинСлужебный.СоздатьКорректировкуРеализации(ОснованиеКорректировки, ДатаОтменыЗаказа, ИнтернетМагазинСлужебный.ИнициализацияТаблицыТоваров()); 
				ВозвратОбъект = ИнтернетМагазинСлужебный.СоздатьВозвратОтКлиентаПоРеализации(ДатаОтменыЗаказа, Реализация);
			Иначе 
				ВозвратОбъект = ИнтернетМагазинСлужебный.СоздатьВозвратОтКлиентаПоРеализации(ДатаОтменыЗаказа, Реализация);
				РеализацияОбъект = Реализация.ПолучитьОбъект();
				РеализацияОбъект.Товары.Очистить();
				//РеализацияОбъект.ДатыВыпуска.Очистить();
				//РеализацияОбъект.ТоварыГИСМ.Очистить();
				//РеализацияОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьДатуЗапретаРедактирования", Истина);
				РеализацияОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
				РеализацияОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
				СписокТоваров = ИнтернетМагазинСлужебный.ПолучитьСписокТоваровДляКорректировкиРегистров(Реализация); 
				Если СписокТоваров <> Неопределено Тогда
					КорректировкаРегистровОбъект = ИнтернетМагазинСлужебный.СформироватьКорректировкуРегистров_ОтменаЗаказа(Реализация, СписокТоваров, ДатаОтменыЗаказа, " # Закрыто роботом # Возврат по заказу клиенту, формирование резерва по свободным остаткам");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Если Реализация <> Неопределено Тогда
			Если ИспользуемКорРТУ Тогда 
				Если КорректировкаРеализацииОбъект <> Неопределено Тогда
					КорректировкаРеализацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
					СФОбъект = ИнтернетМагазинСлужебный.СоздатьСФПоРТУ(КорректировкаРеализацииОбъект.Ссылка, ДатаОтменыЗаказа, Заказ.Организация);
					СФОбъект.Записать();
				КонецЕсли;
			Иначе
				РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если ВозвратОбъект <> Неопределено Тогда
				ВозвратОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			Если КорректировкаРегистровОбъект <> Неопределено Тогда
				КорректировкаРегистровОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
		ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(ЗаказСсылка);
		
		Если РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
			ДаркКитченСервер.ЗаписатьОтменуЗаказаПоРегистрамДК(ЗаказСсылка, Ложь);
			Для Каждого ЭлементМассива Из МассивДобавленныхНоменклатур Цикл
				СтруктураЗаписиРегистраПроизводства = Новый Структура;
				СтруктураЗаписиРегистраПроизводства.Вставить("Склад", Заказ.Склад);
				СтруктураЗаписиРегистраПроизводства.Вставить("Цех", Справочники.ЦехДК.ПустаяСсылка());
				СтруктураЗаписиРегистраПроизводства.Вставить("Номенклатура", ЭлементМассива);
				СтруктураЗаписиРегистраПроизводства.Вставить("Документ", ЗаказСсылка);
				СтруктураЗаписиРегистраПроизводства.Вставить("ДатаНовый", ТекущаяДата());
				СтруктураЗаписиРегистраПроизводства.Вставить("ЖДВ", Заказ.ВремяДоставкиС);
				СтруктураЗаписиРегистраПроизводства.Вставить("Количество", 1);
				СтруктураЗаписиРегистраПроизводства.Вставить("ТекущийСтатус", Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке);
				СтруктураДополнительныеСвойства = Новый Структура("НЕПишемРСДК", Истина);
				ДаркКитченСервер.ДобавитьСтрокуВРССтатусыПроизводстваДК(СтруктураЗаписиРегистраПроизводства, СтруктураДополнительныеСвойства);
			КонецЦикла;
			//временно делаем отправку изменений заказов ДаркКитчен в телегу
			ТекстСообщения = Строка(ЗаказСсылка) + Символы.ПС + Строка(Заказ.НомерЗаказаНаСайте) + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + "<b>Отмена заказа ДаркКитчен</b>";
			Telegram_Admin.SendMessage(Строка(ОбщегоНазначенияПовтИсп.ПолучитьАббревиатуруТекущейБазы()) + Символы.ПС + ТекстСообщения,, "-728074965", "HTML");
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СообщениеОбОшибке);
		СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		Возврат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПеренестиСрок

&НаКлиенте
Процедура ПеренестиСрок(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Измененеие сроков доставки не выполняется для группы заказов");
		Возврат;
	КонецЕсли;
	
	ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов( Элементы.Заказы.ВыделенныеСтроки[0], "Ссылка, ВитринаИнтернетМагазина, ВремяДоставкиПо, ВремяДоставкиС, ПриложениеСборщика, НомерЗаказаНаСайте, Статус");
	
	//Если ДанныеЗаказа.ПриложениеСборщика <> 0 Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " управляется сайтом" + Символы.ПС + "Изменение в 1С запрещено");
	//	Возврат;
	//КонецЕсли;
	
	Если ДанныеЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен")
		И ДанныеЗаказа.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Согласован") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Изменение времени доставки заказов ""Дарк китчен"" разрешено только в статусе ""Новый""'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВыборИнтервала", ДанныеЗаказа, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Комментарий

&НаКлиенте
Процедура ДобавитьКомментарий(Команда)
	
	Комментарий = "";
	ВвестиСтроку(Комментарий, "Введите комментарий");
	Если ЗначениеЗаполнено(Комментарий) Тогда
		Для Каждого Стр Из Элементы.Заказы.ВыделенныеСтроки Цикл
			//ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Стр, "ПриложениеСборщика, НомерЗаказаНаСайте");
			//Если ДанныеЗаказа.ПриложениеСборщика <> 0 Тогда
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " управляется сайтом" + Символы.ПС + "Изменение в 1С запрещено");
			//	Продолжить;
			//КонецЕсли;
			ВвестиКомментарий(Стр, Комментарий)
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВвестиКомментарий(ЗаказСсылка, Комментарий)
	
	УстановитьПривилегированныйРежим(Истина);
	Заказ = ЗаказСсылка.ПолучитьОбъект();
	Заказ.Комментарий = Заказ.Комментарий + ?(ЗначениеЗаполнено(Заказ.Комментарий), Символы.ПС, "") + Комментарий;
	Заказ.ДополнительнаяИнформация = Заказ.ДополнительнаяИнформация + ?(ЗначениеЗаполнено(Заказ.ДополнительнаяИнформация), Символы.ПС, "") + Комментарий;
	Заказ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
	Заказ.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	Заказ.Записать(РежимЗаписиДокумента.Запись);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ПереносНаДругойМагазин

&НаКлиенте
Процедура ПеренестиНаДругойМагазин(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтветПользователя = Вопрос(НСтр("ru = 'Вы действительно хотите переместить выделенные заказы на другой магазин?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		
		СписокСкладовДляВыбора = Новый СписокЗначений;
		МассивДоступныхСкладов = ПолучитьМассивСкладовДляЗамены(Элементы.Заказы.ВыделенныеСтроки);
		СписокСкладовДляВыбора.ЗагрузитьЗначения(МассивДоступныхСкладов);
		
		РезультатВыбора = СписокСкладовДляВыбора.ВыбратьЭлемент("Выбери новый склад:");
		Если РезультатВыбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		НовыйСклад = РезультатВыбора.Значение;
		
		Для Каждого Заказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
			
			РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина, Статус, Доставлен, ОтменаКлиентом, Склад");
			НомерЗаказаНаСайте = РеквизитыЗаказа.НомерЗаказаНаСайте;
			ВитринаЗаказа = РеквизитыЗаказа.ВитринаИнтернетМагазина;
			
			Если РеквизитыЗаказа.Склад = НовыйСклад Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " не изменен." + Символы.ПС + "Текущий магазин заказа равен выбранному магазину");
				Продолжить;
			КонецЕсли;
			
			//проверки
			Если НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") И 
				НЕ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " не является заказом ЯрчеПлюс, ДаркКитчен" + Символы.ПС + "Передача на другой магазин невозможна");
				Продолжить;
			КонецЕсли;
			
			Если (ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") ИЛИ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен"))
				И (РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Закрыт") ИЛИ РеквизитыЗаказа.Доставлен) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " закрыт" + Символы.ПС + "Передача на другой магазин невозможна");
				Продолжить;
			КонецЕсли;
			
			Если (ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") ИЛИ ВитринаЗаказа = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен"))
				И РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + НомерЗаказаНаСайте + " собран" + Символы.ПС + "Передача на другой магазин невозможна");
				Продолжить;
			КонецЕсли;
			
			ПеренестиНаДругойМагазинНаСервере(Заказ, РеквизитыЗаказа.Склад, НовыйСклад);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСкладовДляЗамены(Знач МассивЗаказов)
	
	МассивСкладов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбменССайтом.Склад КАК Склад
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.ОбменССайтом КАК ОбменССайтом
		|		ПО ЗаказКлиента.ВитринаИнтернетМагазина = ОбменССайтом.Витрина
		|			И (ОбменССайтом.ОбменЗаказами)
		|			И (ОбменССайтом.ИспользоватьРегламентныеЗадания)
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Склад
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивСкладов.Добавить(ВыборкаДетальныеЗаписи.Склад);
	КонецЦикла;
	
	Возврат МассивСкладов;
	
КонецФункции

&НаСервере
Процедура ПеренестиНаДругойМагазинНаСервере(Заказ, СтарыйСклад, НовыйСклад)
	
	НоваяЗонаДоставки = ЗонаДоставкиСклада(НовыйСклад);
	НовоеСоглашение = ПолучитьСоглашениеПоСкладу(НовыйСклад);
	
	ОбъектЗаказ = Заказ.ПолучитьОбъект();
	ОбъектЗаказ.Склад = НовыйСклад;
	ОбъектЗаказ.ЗонаДоставки = НоваяЗонаДоставки;
	ОбъектЗаказ.Соглашение = НовоеСоглашение;
	ОбъектЗаказ.ДатаНачалаКомплектовки = Дата(1,1,1);
	ОбъектЗаказ.ДатаОкончанияКомплектовки = Дата(1,1,1);
	ОбъектЗаказ.Комплектовщик = Справочники.ФизическиеЛица.ПустаяСсылка();
	ОбъектЗаказ.ТерминалИд = "";
	
	Для Каждого СтрокаТовары Из ОбъектЗаказ.Товары Цикл
		СтрокаТовары.Склад = НовыйСклад;
	КонецЦикла;
	
	НаименованиеГруппыДопРеквизита = "Документ ""Заказ на клиента""";
	ГруппаДопРеквизита = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(НаименованиеГруппыДопРеквизита, Истина);
	ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ЗонаДоставки", Истина, ГруппаДопРеквизита);
	НайденныеСтроки = ОбъектЗаказ.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ДопРеквизит));
	Для Каждого СтрокаДопРеквизитов Из НайденныеСтроки Цикл
		СтрокаДопРеквизитов.Значение = НоваяЗонаДоставки;
	КонецЦикла;
	
	Если ОбъектЗаказ.ПриложениеСборщика = 0 Тогда
		ОбъектЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.Согласован;
	КонецЕсли;
	
	Шаблон = "Изменение %1 с %2 на %3 %4 %5";
	ТекстКоммента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон
																			, "Склад"
																			, СокрЛП(СтарыйСклад)
																			, СокрЛП(НовыйСклад)
																			, ПараметрыСеанса.ТекущийПользователь
																			, ТекущаяДата()
																			); 
	ОбъектЗаказ.Комментарий = ОбъектЗаказ.Комментарий + ?(ЗначениеЗаполнено(ОбъектЗаказ.Комментарий), Символы.ПС, "") + ТекстКоммента;
	ОбъектЗаказ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
	ОбъектЗаказ.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
	
	ЗаказНужноГотовить = Ложь;
	Отказ = Ложь;
	
	НачатьТранзакцию();
	Попытка
		
		Если ОбъектЗаказ.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
			ДаркКитченСервер.ЗаписатьОтменуЗаказаПоРегистрамДК(Заказ, Отказ);
			ЗаказНужноГотовить = ДаркКитченСервер.ЗаказНужноГотовить(ОбъектЗаказ);
			ДаркКитченСервер.ЗаписатьПустыеСтатусыВРССтатусыПроизводстваДК(ОбъектЗаказ, Отказ);
			Если НЕ ЗаказНужноГотовить Тогда
				ДаркКитченСервер.ЗаписатьСборкуЗаказаПоРегистрам(ОбъектЗаказ, Отказ);
			Иначе
				ДаркКитченСервер.ЗаписатьНовыйВРССтатусыЗаказовДК(ОбъектЗаказ, Отказ);
				ДаркКитченСервер.ЗаписатьНовыйВРССтатусыПроизводстваДК(ОбъектЗаказ, Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОписаниеРезультата = ОписаниеОшибки();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка переноса заказа " + ОбъектЗаказ.НомерЗаказаНаСайте + Символы.ПС + ОписаниеОшибки());
			Возврат;
		КонецЕсли;
		
		ОбъектЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОписаниеРезультата = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка переноса заказа " + ОбъектЗаказ.НомерЗаказаНаСайте + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЗонаДоставкиСклада(Склад)
	Если Склад = Справочники.Склады.ПустаяСсылка() ИЛИ НЕ ТипЗнч(Склад) = Тип("СправочникСсылка.Склады") Тогда
		Возврат "";
	КонецЕсли;
	Возврат Лев(Склад.Наименование, 4);
КонецФункции

#КонецОбласти

#Область Версионирование

&НаКлиенте
Процедура ВосстановитьСобранный(Команда)
	
	Для Каждого Заказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
		
		ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "ПриложениеСборщика, НомерЗаказаНаСайте");
		Если ДанныеЗаказа.ПриложениеСборщика <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " управляется сайтом" + Символы.ПС + "Изменение в 1С запрещено");
			Продолжить;
		КонецЕсли;
		
		Версия = ВерсияСборка(Заказ, Ложь);
		Если Версия = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " " + "не собирался");
			Продолжить;
		КонецЕсли;
			
		ОписаниеРезультата = "";
		Если НЕ ВосстановитьНаВерсию(Заказ, Версия, ОписаниеРезультата) Тогда
			Сообщить(Строка(Заказ) + Символы.ПС + ОписаниеРезультата);
			Продолжить;
		КонецЕсли;
		
		ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(Заказ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаИсходную(Команда)
	Для Каждого Заказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
		ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "ПриложениеСборщика, НомерЗаказаНаСайте");
		Если ДанныеЗаказа.ПриложениеСборщика <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " управляется сайтом" + Символы.ПС + "Изменение в 1С запрещено");
			Продолжить;
		КонецЕсли;
		ОписаниеРезультата = "";
		Если НЕ ВосстановитьНаВерсию(Заказ, 1, ОписаниеРезультата) Тогда
			Сообщить(Строка(Заказ) + Символы.ПС + ОписаниеРезультата);
			Продолжить;
		КонецЕсли;
		ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(Заказ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНачалоСборки(Команда)
	
	Для Каждого Заказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
		
		ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "ПриложениеСборщика, НомерЗаказаНаСайте");
		Если ДанныеЗаказа.ПриложениеСборщика <> 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + ДанныеЗаказа.НомерЗаказаНаСайте + " управляется сайтом" + Символы.ПС + "Изменение в 1С запрещено");
			Продолжить;
		КонецЕсли;
			
		Версия = ВерсияСборка(Заказ, Истина);
		Если Версия = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + Заказ.НомерЗаказаНаСайте + " " + "не собирался");
			Продолжить;
		КонецЕсли;
			
		ОписаниеРезультата = "";
		Если НЕ ВосстановитьНаВерсию(Заказ, Версия, ОписаниеРезультата) Тогда
			Сообщить(Строка(Заказ) + Символы.ПС + ОписаниеРезультата);
			Продолжить;
		КонецЕсли;
		ИнтернетМагазинСлужебный.УдалитьИзМаршрутов(Заказ);

	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ВерсияСборка(Ссылка, Начало = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	isnull(@МинМакс(ВерсииОбъектов.НомерВерсии),0) КАК НомерВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.Объект = &Ссылка
		|	И ВерсииОбъектов.АвторВерсии.Наименование = ""USER1CWEB""";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "@МинМакс", ?(Начало, "МИНИМУМ", "МАКСИМУМ"));
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.НомерВерсии;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ВосстановитьНаВерсию(Заказ, Версия, ОписаниеРезультата)
	
	ОписаниеРезультата = "";
	Если Заказ.ВитринаИнтернетМагазина <> Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		ОписаниеРезультата = ОписаниеРезультата + ?(ПустаяСтрока(ОписаниеРезультата), "", Символы.ПС) + "Восстановление заказов " + Заказ.ВитринаИнтернетМагазина + " - не поддерживается";
	КонецЕсли;
	Если ЗначениеЗаполнено(Заказ.ЧекПродажа) Тогда
		ОписаниеРезультата = ОписаниеРезультата + ?(ПустаяСтрока(ОписаниеРезультата), "", Символы.ПС) + "Для заказа зарегистрирован документ оплаты: " + Строка(Заказ.ЧекПродажа);
	КонецЕсли;
	Если ЗначениеЗаполнено(Заказ.ЭквайринговаяОперация) Тогда
		ОписаниеРезультата = ОписаниеРезультата + ?(ПустаяСтрока(ОписаниеРезультата), "", Символы.ПС) + "Для заказа зарегистрирован документ оплаты: " + Строка(Заказ.ЭквайринговаяОперация);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ОписаниеРезультата) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаДокументовОплаты = Заказ.Оплаты.Выгрузить();
	ПриложениеСборщика = Заказ.ПриложениеСборщика;
	НачатьТранзакцию();
	Попытка
		РегистрыСведений.ВерсииОбъектов.ВернутьсяКВерсии(Заказ, Версия);
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ЗаказОбъект.Оплаты.Загрузить(ТаблицаДокументовОплаты);
		ЗаказОбъект.ПриложениеСборщика = ПриложениеСборщика;
		ЗаказОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОписаниеРезультата = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

#КонецОбласти

#Область ИзменитьСостав

&НаКлиенте
Процедура ИзменитьСостав(Команда)
	
	ОписаниеРезультата = "";
	
	РазрешитьВыполнение = Истина;
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Элементы.Заказы.ТекущаяСтрока, "Ссылка, ВитринаИнтернетМагазина, Статус");
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс") Тогда
		
		Если РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Согласован")
			ИЛИ РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
			РазрешитьВыполнение = Истина;
		Иначе
			ОписаниеРезультата = "Изменение заказов ""Ярче плюс"" разрешено только в статусах ""Новый"", ""Собран"", ""Передан курьеру""";
			РазрешитьВыполнение = Ложь;
		КонецЕсли;
		
	ИначеЕсли РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
		
		Если РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Согласован")
			Или РеквизитыЗаказа.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
			
			ТекущийСтатусДокумента = ДаркКитченСервер.ПолучитьТекущийСтатусДокумента(Элементы.Заказы.ТекущаяСтрока);
			Если ТекущийСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхЗаказовДК.Новый")
				ИЛИ ТекущийСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхЗаказовДК.ВПроизводстве")
				ИЛИ ТекущийСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхЗаказовДК.Согласован")
				ИЛИ ТекущийСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхЗаказовДК.ВСборке") Тогда
				РазрешитьВыполнение = Истина;
			Иначе
				ОписаниеРезультата = "Изменение заказов ""Дарк Китчен"" разрешено только до момента начала сборки";
				РазрешитьВыполнение = Ложь;
			КонецЕсли;
			
		Иначе
			ОписаниеРезультата = "Изменение заказов ""Дарк Китчен"" разрешено только в статусах ""Новый"", ""На сборке""";
			РазрешитьВыполнение = Ложь;
		КонецЕсли;
		
	Иначе //заглушка, пропускаем только ярче плюс
		
		ОписаниеРезультата = "Разрешено изменение заказов ""Ярче плюс"", ""Дарк Китчен""";
		РазрешитьВыполнение = Ложь;
		
	КонецЕсли;
	
	Если Не РазрешитьВыполнение Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеРезультата);
		Возврат;
	КонецЕсли;
	
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(РеквизитыЗаказа.Ссылка);
	ПараметрыОткрытия = Новый Структура("Заказ, НомерВерсииПриНачалеРедактирования", РеквизитыЗаказа.Ссылка, ТекущийНомерВерсии);
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина = ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаИзмененияСоставаЗаказаДаркКитчен", ПараметрыОткрытия);
	Иначе
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаИзмененияСоставаЗаказа", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратТоваров

&НаКлиенте
Процедура ВозвратТоваров(Команда)
	
	ТекущийЗаказа = Элементы.Заказы.ТекущаяСтрока;
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(ТекущийЗаказа);
	ВариантВозврата = ПолучитьВариантВозвратаЗаказа(ТекущийЗаказа);
	
	Если ВариантВозврата = "ярчеплюс" Тогда
		П = Новый Структура;
		П.Вставить("Заказ", ТекущийЗаказа);
		П.Вставить("НомерВерсииПриНачалеРедактирования", ТекущийНомерВерсии);
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВозвратаТоваров", П);
	ИначеЕсли ВариантВозврата = "дарккитчен" Тогда
		П = Новый Структура;
		П.Вставить("Заказ", ТекущийЗаказа);
		П.Вставить("НомерВерсииПриНачалеРедактирования", ТекущийНомерВерсии);
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВозвратаТоваров", П);
	ИначеЕсли ВариантВозврата = "озон" Тогда 
		П = Новый Структура;
		П.Вставить("Заказ", ТекущийЗаказа);
		П.Вставить("НомерВерсииПриНачалеРедактирования", ТекущийНомерВерсии); 
		П.Вставить("ВариантВозврата", ВариантВозврата);
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВозвратаТоваровРЦ", П);
	ИначеЕсли ВариантВозврата = "игрушки" Тогда
		//Сообщить("Возврат заказов посылочной торговли запрещен");
		П = Новый Структура;
		П.Вставить("Заказ", ТекущийЗаказа);
		П.Вставить("НомерВерсииПриНачалеРедактирования", ТекущийНомерВерсии);
		П.Вставить("ВариантВозврата", ВариантВозврата);
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВозвратаТоваровРЦ", П);
	ИначеЕсли ВариантВозврата = "неопределено" Тогда
		Сообщить("Ошибка определения состояния заказа, возврат невозможен");
	Иначе
		Сообщить(ВариантВозврата);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВариантВозвратаЗаказа(Заказ)
	
	МассивФормОплаты = Новый Массив;
	МассивФормОплаты.Добавить(Перечисления.ФормыОплаты.Безналичная);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Заказ,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказКлиентаОплаты.Документ ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			КОГДА ЗаказКлиентаОплаты.Документ.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.СБП)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК СБП
		|ПОМЕСТИТЬ ВТ_ОплатаСБП
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Оплаты КАК ЗаказКлиентаОплаты
		|		ПО ЗаказКлиента.Ссылка = ЗаказКлиентаОплаты.Ссылка
		|ГДЕ
		|	ЗаказКлиентаОплаты.Ссылка = &Заказ
		|	И ЗаказКлиентаОплаты.Документ ССЫЛКА Документ.ЧекККМ
		|	И ЗаказКлиента.ФормаОплаты В(&ФормаОплаты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Заказ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И ЕСТЬNULL(ВТ_ОплатаСБП.СБП, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""Заказ оплачен по QR-коду. Необходимо выполнить возврат в магпей.""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ЗаказКлиента.ВозвратMagPayЗапрещен
		|			ТОГДА ""Возврат запрещен, требуется разрешение на возврат этого заказа""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И НЕ ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|			ТОГДА ""Возврат разрешен только для закрытых заказов Ярче плюс с чеком продажи""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|			ТОГДА ""Возврат разрешен только для закрытых заказов Ярче плюс с чеком продажи""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|				И НЕ ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|				И НЕ ЗаказКлиента.ВозвратMagPayЗапрещен
		|				И ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ""ярчеплюс""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		|				И ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|				И НЕ ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|			ТОГДА ""ярчеплюс""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И ЕСТЬNULL(ВТ_ОплатаСБП.СБП, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""Заказ оплачен по QR-коду. Необходимо выполнить возврат в магпей.""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|				И ЗаказКлиента.ВозвратMagPayЗапрещен
		|			ТОГДА ""Возврат запрещен, требуется разрешение на возврат этого заказа""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И НЕ ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|			ТОГДА ""Возврат разрешен только для закрытых заказов Дарк китчен с чеком продажи""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|			ТОГДА ""Возврат разрешен только для закрытых заказов Дарк китчен с чеком продажи""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|				И НЕ ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|				И НЕ ЗаказКлиента.ВозвратMagPayЗапрещен
		|				И ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная)
		|			ТОГДА ""дарккитчен""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ДаркКитчен)
		|				И ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|				И НЕ ЗаказКлиента.ЧекПродажа = ЗНАЧЕНИЕ(Документ.ЧекККМ.ПустаяССылка)
		|			ТОГДА ""дарккитчен""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ОЗОН)
		|				И НЕ ЗаказКлиента.Доставлен
		|			ТОГДА ""Возврат разрешен только доставленных заказов""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ОЗОН)
		|				И ЗаказКлиента.Доставлен
		|			ТОГДА ""озон""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.Игрушки)
		|				И ЗаказКлиента.ЭквайринговаяОперация = ЗНАЧЕНИЕ(Документ.ОперацияПоПлатежнойКарте.ПустаяСсылка)
		|			ТОГДА ""Возврат разрешен только при наличии документа оплаты""
		|		КОГДА ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.Игрушки)
		|				И НЕ ЗаказКлиента.ЭквайринговаяОперация = ЗНАЧЕНИЕ(Документ.ОперацияПоПлатежнойКарте.ПустаяСсылка)
		|			ТОГДА ""игрушки""
		|		ИНАЧЕ ""неопределено""
		|	КОНЕЦ КАК ВариантВозврата
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОплатаСБП КАК ВТ_ОплатаСБП
		|		ПО ЗаказКлиента.Ссылка = ВТ_ОплатаСБП.Заказ
		|ГДЕ
		|	ЗаказКлиента.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ); 
	Запрос.УстановитьПараметр("ФормаОплаты", МассивФормОплаты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "неопределено";
	КонецЕсли;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ВариантВозврата;
	
КонецФункции

#КонецОбласти

#Область ЗарегистрироватьКОбмену

&НаКлиенте
Процедура ЗарегистрироватьКОбмену(Команда)
	мЗаказы = Элементы.Заказы.ВыделенныеСтроки;
	ЗарегистрироватьКОбменуСервер(мЗаказы);
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьКОбменуСервер(мЗаказы)
	
	Для Каждого ЭлементМассива Из мЗаказы Цикл
		Отказ = Ложь;
		ОбменССайтом.ОбменССайтомПриЗаписиОбъектаПриЗаписи(ЭлементМассива, Отказ);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка регистрации заказа %1 к выгрузке на сайт'"), Строка(ЭлементМассива)));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьКОбменуMagPay(Команда)
	мЗаказы = Элементы.Заказы.ВыделенныеСтроки;
	ЗарегистрироватьКОбменуMagPayСервер(мЗаказы);
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьКОбменуMagPayСервер(мЗаказы)
	
	Для Каждого ЭлементМассива Из мЗаказы Цикл
		Отказ = Ложь;
		ПодпискиНаСобытия.ОбменСMagPayПриЗаписи(ЭлементМассива, Отказ);
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка регистрации заказа %1 к выгрузке в MagPay'"), Строка(ЭлементМассива)));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Доставлен

&НаКлиенте
Процедура Доставлен(Команда)
	
	Для Каждого СтрЗаказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
		УстановитьФлагДоставлен(СтрЗаказ);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФлагДоставлен(Заказ)
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "ЖелаемаяДатаОтгрузки, Доставлен, СуммаДокумента, СпособДоставки, ВитринаИнтернетМагазина, ПриложениеСборщика, ОтменаКлиентом");
	
	Сообщение = "";
	
	Если РеквизитыЗаказа.Доставлен Тогда
		//уже флаг установлен
		Возврат;
	КонецЕсли;
	
	Если РеквизитыЗаказа.СуммаДокумента = 0 ИЛИ РеквизитыЗаказа.ОтменаКлиентом Тогда
		Сообщение = Сообщение + ?(ПустаяСтрока(Сообщение), "", Символы.ПС) + "%1 - отменен";
	КонецЕсли;
	
	Если ЧекИлиЭквайринговаяОперацияСуществуют(Заказ) = Истина Тогда
		Сообщение = Сообщение + ?(ПустаяСтрока(Сообщение), "", Символы.ПС) + "%1 - существует документ оплаты";
	КонецЕсли;
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина <> Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс
		И РеквизитыЗаказа.ВитринаИнтернетМагазина <> Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		Сообщение = Сообщение + ?(ПустаяСтрока(Сообщение), "", Символы.ПС) + "%1 - это не ЯрчеПлюс и не ДаркКитчен";
	КонецЕсли;
	
	Если Не Сообщение = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Сообщение, Строка(Заказ)));
		Возврат;
	КонецЕсли;
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ЗаказОбъект.Доставлен = Истина;
	ЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	
	Если РеквизитыЗаказа.СпособДоставки = Перечисления.СпособыДоставки.Аутсорс Тогда
		ЗаказОбъект.Курьер = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("КурьерАутсорсИМ");
	Иначе
		ЗаказОбъект.Курьер = Заказ.Комплектовщик;
	КонецЕсли;
	
	Попытка
		СформироватьЧек(ЗаказОбъект);
		ЗаказОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Заказ));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки()); 
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, "АРМ установка флага доставлен" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры 

&НаСервере
Процедура СформироватьЧек(ЗаказОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
		
	ВнешнийМодуль = Неопределено;
	ВнешнийМодульОбработка = Неопределено;
	Если ОбменССайтом.ИспользоватьВнешнийМодульИнтернетМагазина(ВнешнийМодульОбработка) Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("epf");
		ВнешнийМодульОбработка.Записать(ИмяФайла);
		Попытка
			ВнешнийМодуль = ВнешниеОбработки.Создать(ИмяФайла, Ложь);//в небезопасном режиме, т.к. ПМ может содержать небезопасный код
		Исключение
			ВнешнийМодуль = Неопределено;
		КонецПопытки;
	КонецЕсли;
		
	Если ВнешнийМодуль = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(ЗаказОбъект.Ссылка));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно создать чек по заказу");
		Возврат;
	КонецЕсли;
	
	КассаЭквайринговыйТерминал = ВнешнийМодуль.ПолучитьДанныеДляЧекаПоЗаказу(ЗаказОбъект.Ссылка);
	ДанныеЧекаКассы = Новый Структура("date_check, organization, typepay, identnumber, terminalid, ordercheck, numcheck, uniqnumber, regnumber, shiftnumber, СуммаЧека, Склад, ЭквайринговыйТерминал, ВитринаИнтернетМагазина"
											, ТекущаяДата()
											, КассаЭквайринговыйТерминал.Организация
											, КассаЭквайринговыйТерминал.ТипОплаты
											, 0
											, 0
											, 0
											, 0
											, 0
											, 0
											, 1
											, ЗаказОбъект.СуммаДокумента
											, КассаЭквайринговыйТерминал.Склад
											, КассаЭквайринговыйТерминал.ЭквайринговыйТерминал
											, ЗаказОбъект.ВитринаИнтернетМагазина);
	
	ЧекККМ = ВнешнийМодуль.СоздатьЧекПоЗаказу(ЗаказОбъект.Ссылка, ДанныеЧекаКассы, КассаЭквайринговыйТерминал.Касса, ЗаказОбъект.Товары);
	ЗаказОбъект.ЧекПродажа = ЧекККМ;
	ЗаказОбъект.КассаККМ = КассаЭквайринговыйТерминал.Касса;
	ВнешнийМодуль.ДобавитьДокументОплатыВЗаказОплаты(ЗаказОбъект, ЧекККМ, , Перечисления.ИсточникиФормированияЧеков.Система); 
	ВнешнийМодуль.ДобавитьДокументПродажиВТабличнуюЧастьАкцизныеМаркиЗаказаВсеСтроки(ЗаказОбъект, ЧекККМ, Ложь);	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеАдресаДоставки

&НаКлиенте
Процедура ИзменитьАдресДоставки(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать 1 заказ для изменения адреса'"));
		Возврат;
	КонецЕсли;
	
	СтруктураДанныхЗаказа = ПолучитьСтруктуруДанныхЗаказа(Элементы.Заказы.ВыделенныеСтроки[0]);
	
	Если СтруктураДанныхЗаказа.Свойство("ПричинаОтказа") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанныхЗаказа.ПричинаОтказа);
	Иначе
		ПараметрыАдреса = Новый Структура("АдресИсходный, АдресJSON, РучноеИзменениеАдресаДоставки", СтруктураДанныхЗаказа.АдресДоставки, СтруктураДанныхЗаказа.АдресДоставкиJSON, Истина);
		ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаВыбораАдреса", ПараметрыАдреса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДанныхЗаказа(ЗаказСсылка)
	
	ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "АдресДоставки, АдресДоставкиJSON, ВитринаИнтернетМагазина, ЧекПродажа, Статус, СуммаДокумента, ОтменаКлиентом, Доставлен");
	
	Если ДанныеЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		
		Если ДанныеЗаказа.СуммаДокумента = 0 Тогда
			ДанныеЗаказа.Вставить("ПричинаОтказа", "Заказ отменен, изменение адреса доставки невозможно.");
			Возврат ДанныеЗаказа;
		ИначеЕсли ДанныеЗаказа.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
			ДанныеЗаказа.Вставить("ПричинаОтказа", "Заказ доставлен, изменение адреса доставки невозможно.");
			Возврат ДанныеЗаказа;
		КонецЕсли;
		
	ИначеЕсли ДанныеЗаказа.ВитринаИнтернетМагазина <> Справочники.ВитриныИнтернетМагазина.ДаркКитчен Тогда
		
		Если ДанныеЗаказа.ОтменаКлиентом Тогда
			ДанныеЗаказа.Вставить("ПричинаОтказа", "Заказ отменен, изменение адреса доставки невозможно.");
			Возврат ДанныеЗаказа;
		ИначеЕсли ДанныеЗаказа.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт ИЛИ ДанныеЗаказа.Доставлен Тогда
			ДанныеЗаказа.Вставить("ПричинаОтказа", "Заказ доставлен, изменение адреса доставки невозможно.");
			Возврат ДанныеЗаказа;
		КонецЕсли;
		
	Иначе
		
		ДанныеЗаказа.Вставить("ПричинаОтказа", "Изменять адрес доставки возможно только для заказов Ярче плюс и Дарк китчен");
		Возврат ДанныеЗаказа;
		
	КонецЕсли;
	
	Возврат ДанныеЗаказа;
	
КонецФункции

&НаСервере
Процедура ИзменитьАдресДоставкиЗаказа(Заказ, Параметр)
	
	Попытка
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		ИсходныйАдресДоставки = ЗаказОбъект.АдресДоставки;
		ЗаказОбъект.АдресДоставки = Параметр.Адрес;
		АдресДоставкиСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("АдресДоставки");
		НайденныеСтроки = ЗаказОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", АдресДоставкиСвойство));
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Значение = Параметр.Адрес;
		КонецЦикла;
		ЗаказОбъект.Широта = Параметр.Широта;
		ЗаказОбъект.Долгота = Параметр.Долгота;
		ЗаказОбъект.АдресДоставкиJSON = Параметр.АдресJSON;
		ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + ?(ПустаяСтрока(ЗаказОбъект), "", Символы.ПС) + "Адрес доставки изменен:" + Символы.ПС + "Исходный - " + ИсходныйАдресДоставки + Символы.ПС + "Новый - " + ЗаказОбъект.АдресДоставки;
		ЗаказОбъект.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка изменения адреса доставки: " + Символы.ПС + ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, "Ошибка изменения адреса доставки: " + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СтатусОплаты

&НаКлиенте
Процедура СтатусОплаты(Команда)
	
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ДанныеОплаты", Новый Структура("Заказ", Элементы.Заказы.ТекущаяСтрока));
	
	Если ЧекИлиЭквайринговаяОперацияСуществуют(Элементы.Заказы.ТекущаяСтрока) Тогда
		Возврат;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Неопределено);
	МассивПараметров.Добавить("ЗагрузитьОплатуПоЗаказуМагпей");
	МассивПараметров.Добавить(Новый Структура("Заказ", Элементы.Заказы.ТекущаяСтрока));
	МассивПараметров.Добавить(Неопределено);
	
	ДлительныеОперации.СоздатьФоновоеЗадание("ОбменССайтом.ВыполнитьМетодВнешнейОбработки", МассивПараметров, "ЗагрузкаЧекаМагпей" + Новый УникальныйИдентификатор(), "ЗагрузкаЧекаМагпей");
	
КонецПроцедуры

#КонецОбласти
 
#Область РазрешитьВозвратMagPay

&НаКлиенте
Процедура РазрешитьВозвратMagPay(Команда)
	
	МассивЗаказов = Новый Массив;
	Для Каждого СтрЗаказ Из Элементы.Заказы.ВыделенныеСтроки Цикл
		МассивЗаказов.Добавить(СтрЗаказ);
	КонецЦикла;
	
	Если МассивЗаказов.Количество() > 0 Тогда
		РазрешитьВозвратMagPayНаСервере(МассивЗаказов);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура РазрешитьВозвратMagPayНаСервере(МассивЗаказов)
	
	Для Каждого ЭлементМассива Из МассивЗаказов Цикл
		
		ЗаказОбъект = ЭлементМассива.ПолучитьОбъект();
		Если ЗаказОбъект.ВозвратMagPayЗапрещен Тогда
			ЗаказОбъект.ВозвратMagPayЗапрещен = Ложь;
			ЗаказОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьДатуЗапретаРедактирования", Истина);
			Попытка
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(ЭлементМассива));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				ЗаписьЖурналаРегистрации("ИМ.АРМСнятиеФлагаВозвратMagPayЗапрещен", УровеньЖурналаРегистрации.Ошибка, ЭлементМассива.Метаданные(), ЭлементМассива, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область СтатусГотовки

&НаКлиенте
Процедура СтатусГотовки(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество() <> 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать 1 заказ Дарк китчен для просмотра статуса готовки'"));
		Возврат;
	КонецЕсли;
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Элементы.Заказы.ТекущаяСтрока, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина");
	
	Если РеквизитыЗаказа.ВитринаИнтернетМагазина <> ПредопределенноеЗначение("Справочник.ВитриныИнтернетМагазина.ДаркКитчен") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Заказ %1 не является заказом Дарк китчен'"), РеквизитыЗаказа.НомерЗаказаНаСайте));
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаСтатусыЗаказовКухни", Новый Структура("Заказ", Элементы.Заказы.ТекущаяСтрока));

КонецПроцедуры

#КонецОбласти


#Область Игрушки

&НаСервере
Функция ЗапуститьФоновоеЗадание(ИмяМетода, МассивПараметровМетода, КлючНаименование = "")
	МассивСостоянийФоновыхЗаданий = Новый Массив;
	МассивСостоянийФоновыхЗаданий.Добавить(СостояниеФоновогоЗадания.Активно);
	МассивСостоянийФоновыхЗаданий.Добавить(СостояниеФоновогоЗадания.Завершено);
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ключ", КлючНаименование);
	СтруктураОтбора.Вставить("Состояние", МассивСостоянийФоновыхЗаданий);
	СтруктураОтбора.Вставить("Начало", ТекущаяДата() - 5*60);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураОтбора);
	Если МассивЗаданий.Количество() = 0 Тогда
		Задание = ФоновыеЗадания.Выполнить(ИмяМетода, МассивПараметровМетода, КлючНаименование, КлючНаименование);
		Возврат Задание.УникальныйИдентификатор;
	Иначе
		Возврат МассивЗаданий[0].УникальныйИдентификатор;
	КонецЕсли;
КонецФункции

//посылки индикатор в фоне:
//есть заказы: изменяется заголовок закладки происходит обновление динмического списка
//нет заказов: изменяется заголовок закладки
&НаСервереБезКонтекста
Функция ТекстЗапросаЗаказыПосылки()
	
	лТекст = "ВЫБРАТЬ
	         |	ЗаказКлиента.Ссылка,
	         |	ЗаказКлиента.НомерЗаказаНаСайте,
	         |	ЗаказКлиента.ДатаЗаказаНаСайте,
	         |	ЗаказКлиента.Склад,
	         |	ЗаказКлиента.СуммаДокумента,
	         |	ЗаказКлиента.ЖелаемаяДатаОтгрузки,
	         |	ЗаказКлиента.Статус,
	         |	ВЫБОР
	         |		КОГДА ЗаказКлиента.СтатусПроверки = 0
	         |			ТОГДА ""Проверку Не Проходил""
	         |		КОГДА ЗаказКлиента.СтатусПроверки = 1
	         |			ТОГДА ""Проверку Прошел""
	         |		КОГДА ЗаказКлиента.СтатусПроверки = 2
	         |			ТОГДА ""Выявлены Отклонения""
	         |		КОГДА ЗаказКлиента.СтатусПроверки = 3
	         |			ТОГДА ""Отгрузка Разрешена""
	         |		КОГДА ЗаказКлиента.СтатусПроверки = 4
	         |			ТОГДА ""Отгрузка Запрещена""
	         |		ИНАЧЕ """"
	         |	КОНЕЦ КАК СтатусПроверки,
	         |	ЗаказКлиента.АдресДоставки,
	         |	ЗаказКлиента.ПокупательФИО,
	         |	ЗаказКлиента.ПокупательТелефон,
	         |	ЗаказКлиента.ПокупательEmail,
	         |	ЗаказКлиента.Комментарий,
	         |	ЗаказКлиента.ВитринаИнтернетМагазина,
	         |	""{{ДополнительнаяОбработка.АРМЗаказовИнтернетМагазина.ТекстЗапросаЗаказыПосылки}}"" КАК НаименованиеЗапроса
	         |ИЗ
	         |	Документ.ЗаказКлиента КАК ЗаказКлиента
	         |ГДЕ
	         |	(ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.Игрушки)
	         |			ИЛИ ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.КДВ))
	         |	И ЗаказКлиента.ЖелаемаяДатаОтгрузки МЕЖДУ &ДатаНачала И &ДатаОкончания
	         |	И ЗаказКлиента.СтатусПроверки = &СтатусПроверки
	         |	И ЗаказКлиента.Статус В(&МассивСтатусов)";
		
	Возврат лТекст;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивСтатусовЗаказовПосылки()
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.НеСогласован); // Не согласован
	МассивСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.Согласован); // Согласован
	МассивСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОбеспечению); // К обеспечению
	МассивСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КВыгрузкеWMS); // К выгрузке WMS
	МассивСтатусов.Добавить(Перечисления.СтатусыЗаказовКлиентов.КОтгрузке); // К отгрузке
	Возврат МассивСтатусов;	
КонецФункции

&НаКлиенте
Процедура ЗаказыПосылкиЗапуститьФоновоеЗадание()
	
	МассивСтатусов = ПолучитьМассивСтатусовЗаказовПосылки();
	
	ИмяМетода = "ДлительныеОперации.ВыполнитьЗапросВФоне";
	ТекстЗапроса = ТекстЗапросаЗаказыПосылки();
	МассивПараметровМетода = Новый Массив;
	МассивПараметровМетода.Добавить(ТекстЗапроса);
	МассивПараметровМетода.Добавить(Новый Структура("ДатаНачала, ДатаОкончания, СтатусПроверки, МассивСтатусов", НачалоДня(ОтборИгрушкиДатаНачала), КонецДня(ОтборИгрушкиДатаОкончания), 2, МассивСтатусов));
	КлючНаименование = "ПолучениеПризнакаНаличиеЗаказовИгрушки";
	
	ПосылкиКлючФЗ = ЗапуститьФоновоеЗадание(ИмяМетода, МассивПараметровМетода, КлючНаименование);
	
	//ЭтаФорма.ПодключитьОбработчикОжидания("ЗаказыПосылкиРезультатФоновогоЗаданияНаКлиенте", 300);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПосылкиРезультатФоновогоЗаданияНаКлиенте()
	
	ЗаданиеВыполнено = Ложь;
	ЗаказыПосылкиРезультатФоновогоЗадания(ПосылкиКлючФЗ, ЗаданиеВыполнено);
	Если ЗаданиеВыполнено Тогда 
		ЭтаФорма.ОтключитьОбработчикОжидания("ЗаказыПосылкиРезультатФоновогоЗаданияНаКлиенте");
		ОбновитьЗаголовокСтраницыЗаказыПосылки();
		ЗаказыПосылкиЗапуститьФоновоеЗадание();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаказыПосылкиРезультатФоновогоЗадания(ИдЗадания, ЗаданиеВыполнено = Ложь)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдЗадания);
	Если ТипЗнч(Задание) = Тип("ФоновоеЗадание") Тогда
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Сообщения = Задание.ПолучитьСообщенияПользователю();
			ЗаданиеВыполнено = Истина;
			Если Сообщения.Количество() > 0 Тогда 
				Рез = ЗначениеИзСтрокиВнутр(Сообщения[0].Текст);
				Если ТипЗнч(Рез) = Тип("РезультатЗапроса") Тогда
					ОбновитьТаблицуЗаказыПосылкиНаСервере(Рез);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЗаданиеВыполнено = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИгрушкиЗапретитьОтгрузку(Команда)
	
	ТД = Элементы.ЗаказыИгрушки.ТекущиеДанные;
	
	Результат = Ложь;
	ТекстОшибки = "";
	
	ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТД.Ссылка, "Номер, Дата");
	Если ТД <> Неопределено Тогда
		РазрешитьОтгрузкуНаСервере(ДанныеЗаказа.Номер + "_" + Формат(ДанныеЗаказа.Дата, "ДФ=yy"), 2, ТД.Ссылка, Результат, ТекстОшибки);		
	КонецЕсли;
	
	Если Результат = Истина Тогда 
		ОбновитьЗаказыПосылкиНаСервере();
		ОбновитьЗаголовокСтраницыЗаказыПосылки();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИгрушкиРазрешитьОтгрузку(Команда)

	ТД = Элементы.ЗаказыИгрушки.ТекущиеДанные;
	
	Результат = Ложь;
	ТекстОшибки = "";
	
	ДанныеЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТД.Ссылка, "Номер, Дата");
	Если ТД <> Неопределено Тогда
		РазрешитьОтгрузкуНаСервере(ДанныеЗаказа.Номер + "_" + Формат(ДанныеЗаказа.Дата, "ДФ=yy"), 1, ТД.Ссылка, Результат, ТекстОшибки);		
	КонецЕсли;
	
	Если Результат = Истина Тогда
		ОбновитьЗаказыПосылкиНаСервере();
		ОбновитьЗаголовокСтраницыЗаказыПосылки();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РазрешитьОтгрузкуНаСервере(НомерДокумента, Отгрузка, ДокументСсылка, Результат, ТекстОшибки)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.РазрешитьОтгрузкуНаСервере(НомерДокумента, Отгрузка, ДокументСсылка, Результат, ТекстОшибки);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИгрушкиДатаНачалаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ОтборИгрушкиДатаНачала) Тогда
		ОтборИгрушкиДатаНачала = ДобавитьМесяц(ТекущаяДата(), -2);
	КонецЕсли;
	
	НоваяДатаОкончания = ДобавитьМесяц(ОтборИгрушкиДатаНачала, 2) + 2 * 24 *3600;
	Если НоваяДатаОкончания < ОтборИгрушкиДатаОкончания Тогда
		ОтборИгрушкиДатаОкончания = НоваяДатаОкончания;
	КонецЕсли;
	
	ОбновитьЗаказыПосылкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборИгрушкиДатаОкончанияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ОтборИгрушкиДатаОкончания) Тогда
        ОтборИгрушкиДатаОкончания = ТекущаяДата() + 2*24*3600;
	КонецЕсли;
	
	НоваяДатаНачала = ДобавитьМесяц(ОтборИгрушкиДатаОкончания - 2*24*3600, -2);
	Если НоваяДатаНачала > ОтборИгрушкиДатаНачала Тогда
		ОтборИгрушкиДатаНачала = НоваяДатаНачала;
	КонецЕсли;
	
	ОбновитьЗаказыПосылкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказыПосылки(Команда)
	ОбновитьЗаказыПосылкиНаСервере();
	ОбновитьЗаголовокСтраницыЗаказыПосылки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаказыПосылкиНаСервере()

	МассивСтатусов = ПолучитьМассивСтатусовЗаказовПосылки();
	ТекстЗапроса = ТекстЗапросаЗаказыПосылки();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ОтборИгрушкиДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ОтборИгрушкиДатаОкончания));
	Запрос.УстановитьПараметр("СтатусПроверки", 2);
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	РезультатЗапроса = Запрос.Выполнить();
	ОбновитьТаблицуЗаказыПосылкиНаСервере(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗаказыПосылкиНаСервере(РезультатЗапроса)
	
	ЗаказыИгрушки.Очистить();
	
	РезультатВыборка = РезультатЗапроса.Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		НС = ЗаказыИгрушки.Добавить();
		ЗаполнитьЗначенияСвойств(НС, РезультатВыборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыЗаказыПосылки()
	КоличествоСтрокРезультата = ЗаказыИгрушки.Количество();
	Если КоличествоСтрокРезультата = 0 Тогда
		Элементы.ГруппаИгрушки.Заголовок = "Посылки"; 
		Элементы.ГруппаИгрушки.Картинка = Новый Картинка;
	Иначе
		Элементы.ГруппаИгрушки.Заголовок = "Посылки (" + КоличествоСтрокРезультата + ")";
		Элементы.ГруппаИгрушки.Картинка = БиблиотекаКартинок.Внимание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыИгрушкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЗаказ = Элемент.ТекущиеДанные.Ссылка;
	
	ОткрытьФормуЗаказаПосылки(ТекущийЗаказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрЗаказаИгрушки(Команда)
	
	Если Элементы.ЗаказыИгрушки.ВыделенныеСтроки.Количество()<>1 Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ЗаказыИгрушки.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийЗаказ = Элементы.ЗаказыИгрушки.ТекущиеДанные.Ссылка;
	
	ОткрытьФормуЗаказаПосылки(ТекущийЗаказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаказаПосылки(ТекущийЗаказ)
	
	Если ТекущийЗаказ = Неопределено ИЛИ ТекущийЗаказ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("Заказ", ТекущийЗаказ);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаЗаказаПосылки", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыИгрушкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыИгрушкиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыИгрушкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область КурьерыИКомплектовщики

&НаКлиенте
Процедура ИзменитьДанныеКурьера(Команда)
	
	Если Элементы.Заказы.ВыделенныеСтроки.Количество()<>1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКурьер = Элементы.Заказы.ТекущиеДанные.Курьер;
	
	Если ТекущийКурьер = Неопределено ИЛИ ТекущийКурьер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("ТекущийКурьер", ТекущийКурьер);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаИзмененияДанныхКурьера", П);
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьТаблицуКК()
	
	КурьерыИКомплектовщики.Очистить();
	
	ГруппаВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Физические лица""");
	ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Телефон", , ГруппаВидКИ);
	СвойствоИМ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("ИнтернетМагазин");

	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка КАК ФизическоеЛицоСсылка,
	               |	ФизическиеЛица.ПометкаУдаления КАК ПометкаУдаления,
	               |	ФизическиеЛица.Наименование КАК ФИО,
	               |	ФизическиеЛица.РольИМ КАК РольИМ,
	               |	ЕСТЬNULL(ФизическиеЛицаКонтактнаяИнформация.НомерТелефона, """") КАК Телефон,
	               |	ЕСТЬNULL(ФизическиеЛицаДополнительныеРеквизиты.Значение, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК Магазин
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.ДополнительныеРеквизиты КАК ФизическиеЛицаДополнительныеРеквизиты
	               |		ПО ФизическиеЛица.Ссылка = ФизическиеЛицаДополнительныеРеквизиты.Ссылка
	               |			И (ФизическиеЛицаДополнительныеРеквизиты.Свойство = &СвойствоИМ)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	               |		ПО ФизическиеЛица.Ссылка = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	               |			И (ФизическиеЛицаКонтактнаяИнформация.Тип = &ТипКИ)
	               |			И (ФизическиеЛицаКонтактнаяИнформация.Вид = &ВидКИ)
	               |ГДЕ
	               |	ФизическиеЛица.РольИМ <> ЗНАЧЕНИЕ(Перечисление.РолиСотрудниковИМ.ПустаяСсылка)
	               |	И ВЫБОР
	               |			КОГДА &СкрытьПомеченныеНаУдаление = ИСТИНА
	               |				ТОГДА НЕ ФизическиеЛица.ПометкаУдаления
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &РольСотрудникаИМ = ЗНАЧЕНИЕ(Перечисление.РолиСотрудниковИМ.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ФизическиеЛица.РольИМ = &РольСотрудникаИМ
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("СвойствоИМ", СвойствоИМ);
	Запрос.УстановитьПараметр("ТипКИ", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидКИ", ВидКИ);
	Запрос.УстановитьПараметр("СкрытьПомеченныеНаУдаление", КурьерыИКомплектовщикиСкрытьПомеченныеНаУдаление);
	Запрос.УстановитьПараметр("РольСотрудникаИМ", РольСотрудникаИМ);
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультата.Следующий() Цикл
		Если XMLСтрока(ВыборкаРезультата.ФизическоеЛицоСсылка) = "7c4920c2-0f67-11eb-8125-005056a95b82" Тогда
			//исключаем показ курьера Курьер аутсорс ИМ
			Продолжить;
		КонецЕсли;
		НС = КурьерыИКомплектовщики.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВыборкаРезультата);
		НС.ГУИД = XMLСтрока(НС.ФизическоеЛицоСсылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерыИКомплектовщикиДобавить(Команда)
	
	Если Не ЗначениеЗаполнено(РольСотрудникаИМ) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '""Роль"" не выбрана'"));
		Возврат;
	КонецЕсли;
	
	П = Новый Структура;
	П.Вставить("РольСотрудникаИМ", РольСотрудникаИМ);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаИзмененияДанныхКурьера", П);
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерыИКомплектовщикиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ИзменитьКурьераКомплектовщика();
КонецПроцедуры

&НаКлиенте
Процедура КурьерыИКомплектовщикиИзменить(Команда)
	ИзменитьКурьераКомплектовщика();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьКурьераКомплектовщика()
	
	Если Элементы.КурьерыИКомплектовщики.ВыделенныеСтроки.Количество()<>1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКурьер = Элементы.КурьерыИКомплектовщики.ТекущиеДанные.ФизическоеЛицоСсылка;
	
	Если ТекущийКурьер = Неопределено ИЛИ ТекущийКурьер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("ТекущийКурьер", ТекущийКурьер);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаИзмененияДанныхКурьера", П);
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерыиКомплектовщикиПеречитать(Команда)
	ПеречитатьТаблицуКК();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КурьерыИКомплектовщикиУдалитьНаСервере(ТекущийКурьер);
	
	Если ТекущийКурьер = Неопределено ИЛИ ТекущийКурьер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяПометкаУдаления = ТекущийКурьер.ПометкаУдаления;
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		ТекущийКурьерОбъект = ТекущийКурьер.ПолучитьОбъект();
		ТекущийКурьерОбъект.УстановитьПометкуУдаления(?(ТекущаяПометкаУдаления, Ложь, Истина));
	Исключение
		ШаблонТекстаСообщения = НСтр("ru='Ошибка изменения пометки удаления ""%Курьер%"": %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Курьер%", СокрЛП(ТекущийКурьер.Наименование));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура КурьерыИКомплектовщикиУдалить(Команда)
	
	Если Элементы.КурьерыИКомплектовщики.ВыделенныеСтроки.Количество()<>1 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКурьер = Элементы.КурьерыИКомплектовщики.ТекущиеДанные.ФизическоеЛицоСсылка;
	
	Если ТекущийКурьер = Неопределено ИЛИ ТекущийКурьер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	КурьерыИКомплектовщикиУдалитьНаСервере(ТекущийКурьер);
	ПеречитатьТаблицуКК();

КонецПроцедуры

&НаКлиенте
Процедура КурьерыИКомплектовщикиСкрытьПомеченныеНаУдалениеПриИзменении(Элемент)
	ПеречитатьТаблицуКК();
КонецПроцедуры

&НаКлиенте
Процедура РольСотрудникаИМПриИзменении(Элемент)
	ПеречитатьТаблицуКК();
КонецПроцедуры

&НаКлиенте
Процедура ВывестиВТабличныйДокумент(Команда)
	ТабличныйДокумент = ПолучитьТабличныйДокументКурьеровИКомплектовщиковНаСервере();
	ТабличныйДокумент.Показать("Список курьеров и комплектовщиков");
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокументКурьеровИКомплектовщиковНаСервере()
	
	ТЗ = КурьерыИКомплектовщики.Выгрузить(,"ФИО, Телефон, РольИМ, ГУИД, Магазин");
	
	ТабличныйДокумент = ДанныеТаблицыЗначенийВТабличныйДокумент(ТЗ);
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеТаблицыЗначенийВТабличныйДокумент(Знач ТЗ)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТЗ);
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.ВыводитьПодвалОтчета = Ложь;
	Построитель.ВыводитьПодвалТаблицы = Ложь;
	Построитель.Вывести(ТабличныйДокумент);
	
	ОбластьТабличногоДокумента = ТабличныйДокумент.Область(,1,1,1);
	ТабличныйДокумент.УдалитьОбласть(ОбластьТабличногоДокумента, ТипСмещенияТабличногоДокумента.ПоВертикали);
	Возврат ТабличныйДокумент;
	
КонецФункции // ДанныеТаблицыЗначенийВТабличныйДокумент()

#КонецОбласти

#Область Магазины

&НаКлиенте
Процедура МагазиныСкладПриИзменении(Элемент)
	МагазиныСкладПриИзмененииНаКлиенте();				
КонецПроцедуры

&НаКлиенте
Процедура МагазиныСкладПриИзмененииНаКлиенте()
	
	Если МагазиныСклад.Пустая() Тогда
		Элементы.ИзменитьПризнакИМ.Заголовок = "Изменить признак интернет-магазин";
		Элементы.ИзменитьПризнакИМ.Доступность = Ложь;
	Иначе
		Элементы.ИзменитьПризнакИМ.Доступность = Истина;		
		ПризнакИнтернетМагазин = ПолучитьПризнакИнтернетМагазин(МагазиныСклад);
		Если ПризнакИнтернетМагазин Тогда 
			Элементы.ИзменитьПризнакИМ.Заголовок = "Снять признак интернет-магазин";
		Иначе
			Элементы.ИзменитьПризнакИМ.Заголовок = "Установить признак интернет-магазин";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПризнакИнтернетМагазин(СкладСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкладыДополнительныеРеквизиты.Значение КАК ИнтернетМагазин
		|ИЗ
		|	Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
		|ГДЕ
		|	СкладыДополнительныеРеквизиты.Свойство.Наименование = ""Склад интернет магазина""
		|	И СкладыДополнительныеРеквизиты.Ссылка = &Склад";
	Запрос.УстановитьПараметр("Склад", СкладСсылка);	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИнтернетМагазин;	
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ИзменитьПризнакИМ(Команда)
	ИзменитьПризнакИМНаСервере(МагазиныСклад);
	МагазиныСкладПриИзмененииНаКлиенте();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПризнакИМНаСервере(СкладСсылка)
	
	УстановитьПривилегированныйРежим(Истина);
	СвойствоИнтернетМагазин = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Склад интернет магазина");
	
	Если СкладСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		СкладОбъект = СкладСсылка.ПолучитьОбъект();
	Исключение
		ШаблонТекстаСообщения = НСтр("ru='Ошибка доступа к ""%Склад%"": %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Склад%", СокрЛП(СкладСсылка));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	СкладПодключен = Ложь;
	НайденныеСтроки = СкладОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоИнтернетМагазин));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Для Каждого НайденнаяСтроки Из НайденныеСтроки Цикл
			НайденнаяСтроки.Значение 	= НЕ НайденнаяСтроки.Значение;
			СкладПодключен 				= НайденнаяСтроки.Значение;
		КонецЦикла;
	Иначе
		НДр								= СкладОбъект.ДополнительныеРеквизиты.Добавить();
		НДр.Свойство					= СвойствоИнтернетМагазин;
		НДр.Значение					= Истина;
		СкладПодключен					= Истина;
	КонецЕсли;
	
	Попытка
		СкладОбъект.Записать();
	Исключение
		ШаблонТекстаСообщения = НСтр("ru='Ошибка записи ""%Склад%"": %ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ШаблонТекстаСообщения, "%Склад%", СокрЛП(СкладСсылка));
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	//Корректируем расписание узлов обмена
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменССайтом.Ссылка,
		|	ВЫБОР
		|		КОГДА ОбменССайтом.ОбменЗаказами = ИСТИНА
		|			ТОГДА ""Заказы""
		|		КОГДА ОбменССайтом.ОбменТоварами = ИСТИНА
		|			ТОГДА ""Товары""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ТипУзла
		|ИЗ
		|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
		|ГДЕ
		|	ОбменССайтом.Склад = &Склад";

	Запрос.УстановитьПараметр("Склад", СкладСсылка);

	ВыборкаУзлыОбмена = Запрос.Выполнить().Выбрать();
	Пока ВыборкаУзлыОбмена.Следующий() Цикл
		
		УзелОбменаОбъект = ВыборкаУзлыОбмена.Ссылка.ПолучитьОбъект();
		
		Если СкладПодключен Тогда //включили ИМ
			
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("ОбменССайтом");
			Задание.Использование = Истина;
			Задание.Ключ = Строка(Новый УникальныйИдентификатор);
			Задание.Наименование = УзелОбменаОбъект.Наименование;
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(УзелОбменаОбъект.Код);
			Задание.Параметры = ПараметрыЗадания;
			Задание.Расписание = РасписаниеРегламентногоЗадания(ВыборкаУзлыОбмена.ТипУзла);
			Задание.ИмяПользователя = "ОбменСайт";
			Задание.Записать();
			
			УзелОбменаОбъект.ИспользоватьРегламентныеЗадания = Истина;
			УзелОбменаОбъект.ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
		
		Иначе //выключили ИМ
			
			Если ВыборкаУзлыОбмена.ТипУзла = "Товары" Тогда
				ДополнительныеОтчетыИОбработки.УдалитьРегламентноеЗадание(УзелОбменаОбъект.ИдентификаторРегламентногоЗадания);
				УзелОбменаОбъект.ИспользоватьРегламентныеЗадания = Ложь;
				УзелОбменаОбъект.ИдентификаторРегламентногоЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
			Иначе
				Задание = ДополнительныеОтчетыИОбработки.НайтиРегламентноеЗадание(УзелОбменаОбъект.ИдентификаторРегламентногоЗадания);
				Если Задание <> Неопределено Тогда
					РасписаниеЗадания = Задание.Расписание;
					РасписаниеЗадания.ДатаКонца = НачалоДня(ТекущаяДатаСеанса()) + 2 * 86400;
					Задание.Расписание = РасписаниеЗадания;
					Задание.Записать();
				Иначе
					УзелОбменаОбъект.ИспользоватьРегламентныеЗадания = Ложь;
					УзелОбменаОбъект.ИдентификаторРегламентногоЗадания = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		УзелОбменаОбъект.Записать();
		
		//очистка логов обмена по узлу
		НЗРС = РегистрыСведений.СостоянияОбменовССайтом.СоздатьНаборЗаписей();
		НЗРС.Отбор.НастройкаОбменаССайтом.Установить(ВыборкаУзлыОбмена.Ссылка);
		НЗРС.Записать();
		
		НЗРС = РегистрыСведений.УспешныеОбменыССайтом.СоздатьНаборЗаписей();
		НЗРС.Отбор.НастройкаОбменаССайтом.Установить(ВыборкаУзлыОбмена.Ссылка);
		НЗРС.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РасписаниеРегламентногоЗадания(ТипУзла)
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);

	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	Расписание = Новый РасписаниеРегламентногоЗадания;
	Расписание.Месяцы					= Месяцы;
	Расписание.ДниНедели				= ДниНедели;
	
	Расписание.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	
	Если ТипУзла = "Товары" Тогда
		Расписание.ВремяНачала = Дата(1,1,1,6,0,0);
		Расписание.ВремяКонца = Дата(1,1,1,2,0,0);
		ПериодПовтораВТечениеДня = 300;
	ИначеЕсли ТипУзла = "Заказы" Тогда
		ПериодПовтораВТечениеДня = 120;
	Иначе
		ПериодПовтораВТечениеДня = 0;
	КонецЕсли;
	
	Расписание.ПериодПовтораВТечениеДня = ПериодПовтораВТечениеДня; // секунды
	Расписание.ПериодПовтораДней		= 1; // каждый день
	
	Возврат Расписание;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаИнтернетМагазиныСортировкаПоДатеЗаказаПриИзменении(Элемент)
	
	ТекДан = Элементы.ТаблицаИнтернетМагазины.ТекущиеДанные;
	Если Не УстановитьСортировкуПриВыдаче(ТекДан.Магазин, ТекДан.СортировкаПоДатеЗаказа) Тогда 
		ТекДан.СортировкаПоДатеЗаказа = Не ТеКДан.СортировкаПоДатеЗаказа;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьСортировкуПриВыдаче(Склад, Значение)
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СортировкаПоДатеЗаказаИМ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |ГДЕ
	               |	Склады.Ссылка = &Склад
	               |	И Склады.ДополнительныеРеквизиты.Свойство = &Свойство";
	Запрос.УстановитьПараметр("Свойство", Свойство);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	СкладОбъект = Склад.ПолучитьОбъект();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Для Каждого Стр Из СкладОбъект.ДополнительныеРеквизиты Цикл
			Если Стр.Свойство = Свойство Тогда
				Стр.Значение = Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаполнитьЗначенияСвойств(СкладОбъект.ДополнительныеРеквизиты.Добавить(), Новый Структура("Свойство, Значение", Свойство, Значение));
	КонецЕсли;
	
	Попытка
		СкладОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область Отчеты

&НаКлиенте
Процедура ОткрытьДополнительныйОтчет(НаименованиеОтчета)
	
	СтруктураОбработкиОтчета = ПолучитьДополнительныйОтчет(НаименованиеОтчета);
	Если СтруктураОбработкиОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отчет не доступен в этой базе");
		Возврат;
	КонецЕсли;
	ОткрытьФорму(СтруктураОбработкиОтчета.ВнешняяОбработка, , , , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//ФормаВнешнегоОтчета = ПолучитьФорму(СтруктураОбработкиОтчета.ВнешняяОбработка);
	//ФормаВнешнегоОтчета.Открыть();
	
КонецПроцедуры

Функция ПолучитьДополнительныйОтчет(НаименованиеОтчета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВнешняяОбработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(НаименованиеОтчета);
	Если НЕ ЗначениеЗаполнено(ВнешняяОбработка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДвоичныеДанныеОбработки = ВнешняяОбработка.ПолучитьОбъект().ХранилищеОбработки.Получить();
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанныеОбработки);
	
	Если ВнешняяОбработка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет
		ИЛИ ВнешняяОбработка.Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет Тогда
		ИмяОбработки = ВнешниеОтчеты.Подключить(АдресВоВременномХранилище,, Ложь);
	Иначе
		ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, Ложь);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ВнешняяОбработка","ВнешнийОтчет."+ИмяОбработки+".Форма");
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчетКонтрольВремениИсполненияЗаказовИМ(Команда)
	ОткрытьДополнительныйОтчет("Контроль времени исполнения заказов ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВозвратыПокупателей(Команда)
	ОткрытьДополнительныйОтчет("Возвраты покупателей ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВремяПолученияЗаказаССайта(Команда)
	ОткрытьДополнительныйОтчет("Время получения заказа с сайта ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОтменныеЗаказы(Команда)
	ОткрытьДополнительныйОтчет("Отмененные заказы ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПрайсИМ(Команда)
	ОткрытьДополнительныйОтчет("Прайс ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПросроченныеЗаказыИМ(Команда)
	ОткрытьДополнительныйОтчет("Просроченные заказы ИМ");
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущийЗаказ = Элемент.ТекущиеДанные.Заказ;
	Если ТекущийЗаказ = Неопределено ИЛИ ТекущийЗаказ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("Ключ", ТекущийЗаказ);
	ФормаДокумента = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента", П);
	Если ПолныеПрава = Ложь Тогда
		ФормаДокумента.ТолькоПросмотр = Истина;
	КонецЕсли;
	ФормаДокумента.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетИнформацияОСкладах(Команда)
	ОткрытьДополнительныйОтчет("Информация о складах");
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетСкладыИМБезЗаказов(Команда)
	ОткрытьДополнительныйОтчет("Склады ИМ без заказов");
КонецПроцедуры

#КонецОбласти

#Область Отчет

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	СформироватьОтчетСервер();
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСервер()
	
	ОтчетРезультат.Очистить();
	О = РеквизитФормыВЗначение("Объект");
	Схема = О.ПОлучитьМакет("ДанныеНоменклатуры");
	ЗначениеВРеквизитФормы(О, "Объект");
	
	Настройки = Схема.НастройкиПОУмолчанию;
	ПараметрыДанных = Настройки.ПараметрыДанных;
	ПараметрыДанных.УстановитьЗначениеПараметра("СписокНоменклатуры", ОтборСписокНоменклатуры);
	ПараметрыДанных.УстановитьЗначениеПараметра("Склад", ОтборСклад);
	ПараметрыДанных.УстановитьЗначениеПараметра("СвойствоСтатусАктивности", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СтатусАктивности"));
	
	СКДСерверВызовСервера.СкомпоноватьРезультатОтчета(ОтчетРезультат, Схема, Настройки);
	
КонецФункции

&НаКлиенте
Процедура ОтборНомерЗаказаПриИзменении(Элемент)
	
	ОтборСписокНоменклатуры.Очистить();
	ОтборСписокНоменклатуры.ЗагрузитьЗначения(НоменклатураЗаказа(ОтборНомерЗаказа));
	ОтборСклад = СкладПоЗаказу(ОтборНомерЗаказа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НоменклатураЗаказа(НомерЗаказаОтбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Т.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК Т
	               |ГДЕ
	               |	Т.Ссылка.НомерЗаказаНаСайте = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказаОтбор);
	
	Рез = Запрос.Выполнить().Выгрузить();
	Возврат Рез.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервереБезКонтекста
Функция СкладПоЗаказу(НомерЗаказаОтбор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Склад КАК Склад
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК Т
	               |ГДЕ
	               |	Т.НомерЗаказаНаСайте = &НомерЗаказа";
	Запрос.УстановитьПараметр("НомерЗаказа", НомерЗаказаОтбор);
	
	Рез = Запрос.Выполнить().Выбрать();
	Рез.Следующий();
	Возврат Рез.Склад;
	
КонецФункции

&НаКлиенте
Процедура ОтборШКПриИзменении(Элемент)
	НоменклатураШК();
КонецПроцедуры

&НаСервере
Процедура НоменклатураШК()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Штрихкод", ОтборШК);
	Запрос.Текст = "ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Рез = Запрос.Выполнить().Выбрать();
	ОтборСписокНоменклатуры.Очистить();
	Пока Рез.Следующий() Цикл
		ОтборСписокНоменклатуры.Добавить(Рез.Номенклатура);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьОтборОстатки(Команда)
	
	Видимость = Элементы.ОстаткиКомпоновщикНастроек.Видимость;
	Если Видимость Тогда
		Видимость = Ложь;
		НазваниеКнопки = "Показать отбор";
	Иначе
		Видимость = Истина;
		НазваниеКнопки = "Скрыть отбор";
	КонецЕсли;
	Элементы.ОстаткиКомпоновщикНастроек.Видимость = Видимость;
	Элементы.ОстаткиКомпоновщикНастроек.Видимость = Видимость;
	Элементы.ОстаткиКомпоновщикНастроек.Видимость = Видимость;
	Элементы.СкрытьОтборОстатки.Заголовок = НазваниеКнопки;
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиМагазина

&НаКлиенте
Процедура СформироватьОтчетОстатки(Команда)
	СформироватьОтчетОстаткиСервер();	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетОстаткиСервер()
	
	ОстаткиРезультат.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СКД = ОбработкаОбъект.ПолучитьМакет("ОстаткиМагазина");
	
	ПроцентУменьшенияОстаткаНаСайт = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ПроцентУменьшенияОстаткаНаСайт");
	ПроцентУменьшенияОстаткаНаСайт = ?(ПроцентУменьшенияОстаткаНаСайт = Неопределено, 0, ПроцентУменьшенияОстаткаНаСайт);
	ПараметрСКД = ОстаткиКомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПроцентУменьшенияОстаткаНаСайт");
	ПараметрСКД.Использование = Истина;
	ПараметрСКД.Значение = ПроцентУменьшенияОстаткаНаСайт;
	
	НастройкаКомпоновки = ОстаткиКомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкаКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультата.УстановитьДокумент(ОстаткиРезультат);
	ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

#КонецОбласти

#Область СервисныеФункции

&НаКлиенте
Процедура ВыгрузкаОстатковНоменклатураПриИзменении(Элемент)
	ВыгрузкаОстатковПеречитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковМагазинПриИзменении(Элемент)
	ВыгрузкаОстатковПеречитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковПеречитатьОстаток(Команда)
	ВыгрузкаОстатковПеречитатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковПеречитатьДанные()
	
	Если НЕ ЗначениеЗаполнено(ВыгрузкаОстатковМагазин) Тогда
		ВыгрузкаОстатковОстаток = 0;
		ВыгрузкаОстатковНКЗ = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыгрузкаОстатковНоменклатура) Тогда
		ВыгрузкаОстатковОстаток = 0;
		ВыгрузкаОстатковНКЗ = 0;
		ВыгрузкаОстатковСтатусАктивности = 0;
	КонецЕсли;
	
	ВыгрузкаОстатковПеречитатьДанныеНаСервере(ВыгрузкаОстатковМагазин, ВыгрузкаОстатковНоменклатура, ВыгрузкаОстатковОстаток, ВыгрузкаОстатковНКЗ, ВыгрузкаОстатковСтатусАктивности);
	
	СменаСегментаТекущийСегмент = ПолучитьСегментУзлаОбмена(СменаСегментаУзел);
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаОстатковПеречитатьДанныеНаСервере(ПараметрМагазин, ПараметрНоменклатура, ВыходОстаток, ВыходНКЗ, ВыходСтатусАктивности)
	
	Если НЕ ЗначениеЗаполнено(ПараметрМагазин) Тогда
		Возврат;
	КонецЕсли;
	
	ПолучатьОстатки = Истина;
	ПолучатьСменаСегмента = Истина;
	
	Если НЕ ЗначениеЗаполнено(ПараметрНоменклатура) Тогда
		ПолучатьОстатки = Ложь;
	КонецЕсли;
	
	Если ПолучатьОстатки Тогда
		
		ТЗРезультатКомпоновщика = Новый ТаблицаЗначений;
		
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		СКД = ОбработкаОбъект.ПолучитьМакет("ОстаткиМагазина");
		
		КомпоновщикНастроекТекущий = Новый КомпоновщикНастроекКомпоновкиДанных;
		АдресВХ = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
		ИсточникНастроекТекущий = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВХ);
		КомпоновщикНастроекТекущий.Инициализировать(ИсточникНастроекТекущий);
		КомпоновщикНастроекТекущий.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		КомпоновщикНастроекТекущий.Настройки.Отбор.Элементы.Очистить();
		
		//номенклатура
		НовыйЭлементОтбора = КомпоновщикНастроекТекущий.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЛевоеЗначениеОтбора = Новый ПолеКомпоновкиДанных("Номенклатура");
		НовыйЭлементОтбора.ЛевоеЗначение = ЛевоеЗначениеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ПараметрНоменклатура;
		
		//Склад
		НовыйЭлементОтбора = КомпоновщикНастроекТекущий.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЛевоеЗначениеОтбора = Новый ПолеКомпоновкиДанных("Склад");
		НовыйЭлементОтбора.ЛевоеЗначение = ЛевоеЗначениеОтбора;
		НовыйЭлементОтбора.Использование = Истина;
		НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовыйЭлементОтбора.ПравоеЗначение = ПараметрМагазин;
		
		ПроцентУменьшенияОстаткаНаСайт = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ПроцентУменьшенияОстаткаНаСайт");
		ПроцентУменьшенияОстаткаНаСайт = ?(ПроцентУменьшенияОстаткаНаСайт = Неопределено, 0, ПроцентУменьшенияОстаткаНаСайт);
		ПараметрСКД = КомпоновщикНастроекТекущий.Настройки.ПараметрыДанных.Элементы.Найти("ПроцентУменьшенияОстаткаНаСайт");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = ПроцентУменьшенияОстаткаНаСайт;
		
		ПараметрСКД = КомпоновщикНастроекТекущий.Настройки.ПараметрыДанных.Элементы.Найти("ТекущаяДата");
		ПараметрСКД.Использование = Истина;
		ПараметрСКД.Значение = ТекущаяДата();
		
		НастройкаКомпоновки = КомпоновщикНастроекТекущий.ПолучитьНастройки();
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, НастройкаКомпоновки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		
		ПроцессорВыводаРезультата = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВыводаРезультата.УстановитьОбъект(ТЗРезультатКомпоновщика);
		ПроцессорВыводаРезультата.Вывести(ПроцессорКомпоновки);
		
		Для Каждого СтрокаТаблицы Из ТЗРезультатКомпоновщика Цикл
			Если СтрокаТаблицы.Номенклатура = ПараметрНоменклатура И СтрокаТаблицы.Склад = ПараметрМагазин Тогда
				ВыходОстаток = СтрокаТаблицы.ДоступныйОстаток;
				ВыходНКЗ = СтрокаТаблицы.НормативноеКоличествоЗапаса;
				ВыходСтатусАктивности = СтрокаТаблицы.СтатусАктивности;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	////получение координат склада
	Если НЕ ЗначениеЗаполнено(КоординатыМагазин) Тогда
		КоординатыМагазин = ПараметрМагазин;
		КоординатыПеречитатьДанные(КоординатыМагазин);
	КонецЕсли;
	
	//смена сегмента
	Если ПолучатьСменаСегмента Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбменССайтом.Ссылка КАК Ссылка
		               |ИЗ
		               |	ПланОбмена.ОбменССайтом КАК ОбменССайтом
		               |ГДЕ
		               |	НЕ ОбменССайтом.ПометкаУдаления
		               |	И ОбменССайтом.ОбменТоварами
		               |	И ОбменССайтом.ВыгружатьНаСайт
		               |	И ОбменССайтом.Склад = &Склад
		               |	И ОбменССайтом.Витрина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.ЯрчеПлюс)
		               |	И ОбменССайтом.ИспользоватьРегламентныеЗадания";
		Запрос.УстановитьПараметр("Склад", ПараметрМагазин);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			СменаСегментаУзел = ПланыОбмена.ОбменССайтом.ПустаяСсылка();
		Иначе
			РезультатВыборка = РезультатЗапроса.Выбрать();
			РезультатВыборка.Следующий();
			СменаСегментаУзел = РезультатВыборка.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыгрузкаОстатковПроверкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатковМагазинОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВыгрузкаОстатковПроверкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ВыгрузкаОстатковПроверкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Если ВыбранноеЗначение.ЭтоГруппа Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбор групп запрещен");
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОстатовВыгрузитьНаСайт(Команда)
	
	Если НЕ ЗначениеЗаполнено(ВыгрузкаОстатковМагазин) Тогда
		ВыгрузкаОстатковОстаток = 0;
		ВыгрузкаОстатковНКЗ = 0;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВыгрузкаОстатковНоменклатура) Тогда
		ВыгрузкаОстатковОстаток = 0;
		ВыгрузкаОстатковНКЗ = 0;
		ВыгрузкаОстатковСтатусАктивности = 0;
		Возврат;
	КонецЕсли;
	
	ОписаниеРезультатаВыполнения = "";
	
	РезультатВыполнения = ВыгрузкаОстатковВыгрузитьНаСайтНаСервере(ВыгрузкаОстатковМагазин, ВыгрузкаОстатковНоменклатура, ВыгрузкаОстатковОстаток, ВыгрузкаОстатковНКЗ, ВыгрузкаОстатковСтатусАктивности, ОписаниеРезультатаВыполнения);
	
	Если РезультатВыполнения = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка!");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеРезультатаВыполнения);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузкаОстатковВыгрузитьНаСайтНаСервере(ПараметрМагазин, ПараметрНоменклатура, ПараметрОстаток, ПараметрНКЗ, ПараметрСтатусАктивности, ВыходОписаниеРезультата)
	
	Если НЕ ЗначениеЗаполнено(ПараметрМагазин) Тогда
		ВыходОписаниеРезультата = "Магазин не заполнено";
		Возврат Ложь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПараметрНоменклатура) Тогда
		ВыходОписаниеРезультата = "Номенклатура не заполнено";
		Возврат Ложь;
	КонецЕсли;
	
	ТЗ_ИсходныеДанные = Новый ТаблицаЗначений;
	ТЗ_ИсходныеДанные.Колонки.Добавить("СкладУзла"						, Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТЗ_ИсходныеДанные.Колонки.Добавить("Номенклатура"					, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_ИсходныеДанные.Колонки.Добавить("НормативноеКоличествоЗапаса"	, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	ТЗ_ИсходныеДанные.Колонки.Добавить("СтатусАктивности"				, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
	ТЗ_ИсходныеДанные.Колонки.Добавить("ОстатокНаСкладе"				, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
	
	ТекущийУзелСайта = ПланыОбмена.ОбменССайтом.ПустаяСсылка();
	
	РезультатВыполнения = Истина;
	
	ВнешнийМодуль	= Неопределено;
	ИмяФайла		= Неопределено;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВнешнийМодульНаименование",		"ИМ выгрузка произвольных пакетов предложений");
	СтруктураПараметров.Вставить("Метод",							"ВыгрузкаПроизвольногоПакетаПредложений");

	ВнешнийМодульРаботаСWebПолучениеДанных.ВыполнитьМетодВнешнейОбработки(ВнешнийМодуль, "МетодыВнешнегоМодуля", СтруктураПараметров, ИмяФайла); 
			
	Если СтруктураПараметров.Результат = Ложь Тогда
		ВыходОписаниеРезультата = "Ошибка подключаемого модуля";
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбменССайтом.Ссылка
		|ИЗ
		|	ПланОбмена.ОбменССайтом КАК ОбменССайтом
		|ГДЕ
		|	ОбменССайтом.Склад = &Склад
		|	И ОбменССайтом.ОбменТоварами = ИСТИНА";
	Запрос.УстановитьПараметр("Склад", ПараметрМагазин);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ВыходОписаниеРезультата = "Для магазина не определен узел сайта";
		Возврат Ложь;
	КонецЕсли;
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущийУзелСайта = ВыборкаДетальныеЗаписи.Ссылка;		
		
		Если НЕ ЗначениеЗаполнено(ТекущийУзелСайта) Тогда
			ВыходОписаниеРезультата = ВыходОписаниеРезультата + ?(ПустаяСтрока(ВыходОписаниеРезультата), "", Символы.ПС) + "Ошибка получения узла сайта";
			Продолжить;
		КонецЕсли;	

		ТЗ_ИсходныеДанные.Очистить();
		
		НС = ТЗ_ИсходныеДанные.Добавить();
		НС.СкладУзла = ПараметрМагазин;
		НС.Номенклатура = ПараметрНоменклатура;
		НС.НормативноеКоличествоЗапаса = ПараметрНКЗ;
		НС.СтатусАктивности = ПараметрСтатусАктивности;
		НС.ОстатокНаСкладе = ПараметрОстаток;
	
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТЗИсходныеДанные", 				ТЗ_ИсходныеДанные);
		СтруктураПараметров.Вставить("ТекущийУзел", 					ТекущийУзелСайта);
		СтруктураПараметров.Вставить("Метод",							"ВыгрузкаПроизвольногоПакетаПредложений");
		СтруктураПараметров.Вставить("ВнешнийМодульНаименование",		"ИМ выгрузка произвольных пакетов предложений");
			
		ВнешнийМодульРаботаСWebПолучениеДанных.ВыполнитьМетодВнешнейОбработки(ВнешнийМодуль, СтруктураПараметров.Метод, СтруктураПараметров);
		РезультатВыполнения = ?(РезультатВыполнения = Ложь, Ложь, СтруктураПараметров.Результат);
		ВыходОписаниеРезультата = ВыходОписаниеРезультата + ?(ПустаяСтрока(ВыходОписаниеРезультата), "", Символы.ПС) + СтруктураПараметров.ОписаниеОшибки;
		
	КонецЦикла;
	
	ВнешнийМодульРаботаСWebПолучениеДанных.УдалитьФайлПодключенногоМодуля(ИмяФайла);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузкаОстатковПодобратьПоШтрихкоду(Команда)
	
	ВведенноеЗначениеШК = "";
	МассивНоменклатур = Новый Массив;
	
	Если ВвестиСтроку(ВведенноеЗначениеШК, "Штрихкод номенклатуры:", 25, Ложь) Тогда
		МассивНоменклатур = ПолучитьНоменклатуруПоШтрихкоду(ВведенноеЗначениеШК);
		КоличествоНоменклатур = МассивНоменклатур.Количество();
		Если КоличествоНоменклатур = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура с штрихкодом "+ВведенноеЗначениеШК+" не найдена");
		ИначеЕсли КоличествоНоменклатур = 1 Тогда
			ВыгрузкаОстатковНоменклатура = МассивНоменклатур[0];
		Иначе
			СписокНоменклатур = Новый СписокЗначений;
			СписокНоменклатур.ЗагрузитьЗначения(МассивНоменклатур);
			ВыбранныйЭлемент = СписокНоменклатур.ВыбратьЭлемент("Выберите номенклатуру:");
			Если ВыбранныйЭлемент = Неопределено Тогда
				Возврат;
			КонецЕсли;
			ВыгрузкаОстатковНоменклатура = ВыбранныйЭлемент.Значение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПоШтрихкоду(ВведенноеЗначениеШК)
	
	МассивНоменклатур = новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод", ВведенноеЗначениеШК);
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
    МассивНоменклатур = ТЗ_Результат.ВыгрузитьКолонку("Номенклатура");

	Возврат МассивНоменклатур;
		
КонецФункции

&НаКлиенте
Процедура ПерезаполнитьТаблицуИнтернетМагазины(Команда)
	ПерезаполнитьТаблицуИнтернетМагазиныНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьКоординатыСклада(Команда)
	
	Если ПустаяСтрока(Широта) ИЛИ ПустаяСтрока(Долгота) Тогда
		Возврат;
	КонецЕсли;
	
	Широта = СокрЛП(Широта);
	Долгота = СокрЛП(Долгота);
	
	ОшибкаШирота = Ложь;
	Попытка
		ШиротаЧисло = Число(Широта);
	Исключение  
		ОшибкаШирота = Истина;
	КонецПопытки;
	
	ДобавочнаяСтрока = "";
	Для Сч = 1 По СтрДлина(Широта) - СтрДлина(Формат(ШиротаЧисло, "ЧРД=.; ЧГ=0")) Цикл
		ДобавочнаяСтрока = ДобавочнаяСтрока + "0";
	КонецЦикла;
	
	Если Формат(ШиротаЧисло, "ЧРД=.; ЧГ=0")+ДобавочнаяСтрока <> Широта Тогда
		ОшибкаШирота = Истина;
	КонецЕсли;
	
	Если ОшибкаШирота Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат поля Широта");
	КонецЕсли;
	
	ОшибкаДолгота = Ложь;
	Попытка
		ДолготаЧисло = Число(Долгота);
	Исключение
		ОшибкаДолгота = Истина;
	КонецПопытки;
	
	ДобавочнаяСтрока = "";
	Для Сч = 1 По СтрДлина(Долгота) - СтрДлина(Формат(ДолготаЧисло, "ЧРД=.; ЧГ=0")) Цикл
		ДобавочнаяСтрока = ДобавочнаяСтрока + "0";
	КонецЦикла;
	
	Если Формат(ДолготаЧисло, "ЧРД=.; ЧГ=0")+ДобавочнаяСтрока <> Долгота Тогда
		ОшибкаДолгота = Истина;
	КонецЕсли;
	
	Если ОшибкаДолгота Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный формат поля Долгота");
	КонецЕсли;
	
	Если Не ОшибкаШирота И Не ОшибкаДолгота Тогда
		ЗаписатьКоординатыСкладаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКоординатыСкладаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		СкладОбъект = КоординатыМагазин.ПолучитьОбъект();
		//Широта
		НайденныеСвойства = СкладОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоШиротаСклада));
		Если НайденныеСвойства.Количество() = 0 Тогда
			НС = СкладОбъект.ДополнительныеРеквизиты.Добавить();
			НС.Свойство = СвойствоШиротаСклада;
			НС.Значение = Широта; 
		Иначе
			Для Каждого НайденноеСвойство Из НайденныеСвойства Цикл
				НайденноеСвойство.Значение = Широта;
			КонецЦикла;
		КонецЕсли;
		//Долгота
		НайденныеСвойства = СкладОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоДолготаСклада));
		Если НайденныеСвойства.Количество() = 0 Тогда
			НС = СкладОбъект.ДополнительныеРеквизиты.Добавить();
			НС.Свойство = СвойствоДолготаСклада;
			НС.Значение = Долгота; 
		Иначе
			Для Каждого НайденноеСвойство Из НайденныеСвойства Цикл
				НайденноеСвойство.Значение = Долгота;
			КонецЦикла;
		КонецЕсли;
		//Координаты
		НайденныеСвойства = СкладОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоКоординатыГугл));
		Если НайденныеСвойства.Количество() = 0 Тогда
			НС = СкладОбъект.ДополнительныеРеквизиты.Добавить();
			НС.Свойство = СвойствоКоординатыГугл;
			НС.Значение = Широта + "," + Долгота; 
		Иначе
			Для Каждого НайденноеСвойство Из НайденныеСвойства Цикл
				НайденноеСвойство.Значение = Широта + "," + Долгота; 
			КонецЦикла;
		КонецЕсли;
		СкладОбъект.Записать();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Координаты склада успешно записаны");
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка записи координат склада" + ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Ошибка записи координат склада" + Символы.пс + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьСегментТоваровУзла(Команда)
	
	ТекстОшибки = "";
	Если НЕ ЗначениеЗаполнено(СменаСегментаУзел) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Узел обмена не заполнен";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СменаСегментаТекущийСегмент) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Текущий сегмент не заполнен";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СменаСегментаЦелевойСегмент) Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Целевой сегмент не выбран";
	КонецЕсли;
	Если ЗначениеЗаполнено(СменаСегментаТекущийСегмент)
		И ЗначениеЗаполнено(СменаСегментаЦелевойСегмент)
		И СменаСегментаТекущийСегмент = СменаСегментаЦелевойСегмент Тогда
		ТекстОшибки = ТекстОшибки + ?(ПустаяСтрока(ТекстОшибки), "", Символы.ПС) + "Текущий сегмент равен Целевому сегменту";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Результат = СменитьСегментТоваровУзлаНаСервере();
	
	Если Результат Тогда
		СменаСегментаТекущийСегмент = ПолучитьСегментУзлаОбмена(СменаСегментаУзел); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Смена сегмента выполнена успешно!");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ОШИБКА: Попробуйте еще раз");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СменитьСегментТоваровУзлаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ЗаписатьВУзелОбменаОтборПоСегменту(СменаСегментаЦелевойСегмент, СменаСегментаУзел);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка смены сегмента:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Смена сегмента" + Символы.ПС + "Ошибка смены сегмента:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Ложь;
	КонецПопытки;
	
	//Сравниваем сегменты
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НоменклатураСегмента.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_сегмент1
	               |ИЗ
	               |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	               |ГДЕ
	               |	НоменклатураСегмента.Сегмент = &Сегмент1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураСегмента.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_сегмент2
	               |ИЗ
	               |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	               |ГДЕ
	               |	НоменклатураСегмента.Сегмент = &Сегмент2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_сегмент1.Номенклатура КАК Номенклатура,
	               |	ЕСТЬNULL(ДополнительныеСведения.Значение, 0) КАК СтатусАктивности,
	               |	ЕСТЬNULL(ТоварныеОграничения.НормативноеКоличествоЗапаса, 0) КАК Норма
	               |ИЗ
	               |	ВТ_сегмент1 КАК ВТ_сегмент1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_сегмент2 КАК ВТ_сегмент2
	               |		ПО ВТ_сегмент1.Номенклатура = ВТ_сегмент2.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО ВТ_сегмент1.Номенклатура = ДополнительныеСведения.Объект
	               |			И (ДополнительныеСведения.Свойство = &СвойствоСтатусАктивности)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварныеОграничения КАК ТоварныеОграничения
	               |		ПО ВТ_сегмент1.Номенклатура = ТоварныеОграничения.Номенклатура
	               |			И (ТоварныеОграничения.Склад = &Склад)
	               |ГДЕ
	               |	ВТ_сегмент2.Номенклатура ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_сегмент2.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	ВТ_сегмент2 КАК ВТ_сегмент2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_сегмент1 КАК ВТ_сегмент1
	               |		ПО (ВТ_сегмент1.Номенклатура = ВТ_сегмент2.Номенклатура)
	               |ГДЕ
	               |	ВТ_сегмент1.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Сегмент1", СменаСегментаТекущийСегмент);
	Запрос.УстановитьПараметр("Сегмент2", СменаСегментаЦелевойСегмент);
	Запрос.УстановитьПараметр("СвойствоСтатусАктивности", СвойствоСтатусАктивности);
	Запрос.УстановитьПараметр("Склад", ВыгрузкаОстатковМагазин);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаТоваровКЗанулению = РезультатЗапроса[2].Выгрузить();
	ТаблицаТоваровКРегистрации = РезультатЗапроса[3].Выгрузить();
	
	//Регистрируем номенклаутры в узел
	Если ТаблицаТоваровКРегистрации.Количество() > 0 Тогда
		Попытка
			Для Каждого СтрокаТаблицы Из ТаблицаТоваровКРегистрации Цикл
				ПланыОбмена.ЗарегистрироватьИзменения(СменаСегментаУзел, СтрокаТаблицы.Номенклатура);
			КонецЦикла;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка регистрации номенклатур в обмен: " + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Смена сегмента" + Символы.ПС + "Ошибка регистрации номенклатур в обмен:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат Ложь;
		КонецПопытки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Зарегистрировано в обмен: " + ТаблицаТоваровКРегистрации.Количество());
	КонецЕсли;
	
	//Зануляем номенклатуры
	Если ТаблицаТоваровКЗанулению.Количество() > 0 Тогда
		
		ТЗ_ИсходныеДанные = Новый ТаблицаЗначений;
		ТЗ_ИсходныеДанные.Колонки.Добавить("СкладУзла"						, Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТЗ_ИсходныеДанные.Колонки.Добавить("Номенклатура"					, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ_ИсходныеДанные.Колонки.Добавить("НормативноеКоличествоЗапаса"	, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
		ТЗ_ИсходныеДанные.Колонки.Добавить("СтатусАктивности"				, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
		ТЗ_ИсходныеДанные.Колонки.Добавить("ОстатокНаСкладе"				, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,3)));
		
		РезультатВыполнения = Истина;
		ВнешнийМодуль	= Неопределено;
		ИмяФайла		= Неопределено;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВнешнийМодульНаименование",		"ИМ выгрузка произвольных пакетов предложений");
		СтруктураПараметров.Вставить("Метод",							"ВыгрузкаПроизвольногоПакетаПредложений");
		
		ВнешнийМодульРаботаСWebПолучениеДанных.ВыполнитьМетодВнешнейОбработки(ВнешнийМодуль, "МетодыВнешнегоМодуля", СтруктураПараметров, ИмяФайла);
		
		Если СтруктураПараметров.Результат = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка зануления номенклатур: Ошибка подключаемого модуля");
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Смена сегмента" + Символы.ПС + "Ошибка зануления номенклатур: Ошибка подключаемого модуля");
			Возврат Ложь;
		КонецЕсли;
		
		ТЗ_ИсходныеДанные.Очистить();
		
		Для Каждого СтрокаТаблицы Из ТаблицаТоваровКЗанулению Цикл
			
			НС = ТЗ_ИсходныеДанные.Добавить();
			НС.СкладУзла = ВыгрузкаОстатковМагазин;
			НС.Номенклатура = СтрокаТаблицы.Номенклатура;
			НС.НормативноеКоличествоЗапаса = СтрокаТаблицы.Норма;
			НС.СтатусАктивности = СтрокаТаблицы.СтатусАктивности;
			НС.ОстатокНаСкладе = 0;
			
		КонецЦикла;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТЗИсходныеДанные", 				ТЗ_ИсходныеДанные);
		СтруктураПараметров.Вставить("ТекущийУзел", 					СменаСегментаУзел);
		СтруктураПараметров.Вставить("Метод",							"ВыгрузкаПроизвольногоПакетаПредложений");
		СтруктураПараметров.Вставить("ВнешнийМодульНаименование",		"ИМ выгрузка произвольных пакетов предложений");
			
		ВнешнийМодульРаботаСWebПолучениеДанных.ВыполнитьМетодВнешнейОбработки(ВнешнийМодуль, СтруктураПараметров.Метод, СтруктураПараметров);
		Если НЕ СтруктураПараметров.Результат Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка зануления номенклатур: " + Символы.ПС + СтруктураПараметров.ОписаниеОшибки);
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Смена сегмента" + Символы.ПС + "Ошибка зануления номенклатур: " + Символы.ПС + СтруктураПараметров.ОписаниеОшибки);
			Возврат Ложь;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Занулено номенклатур: " + ТаблицаТоваровКЗанулению.Количество());
		
		ВнешнийМодульРаботаСWebПолучениеДанных.УдалитьФайлПодключенногоМодуля(ИмяФайла);
		
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСегментУзлаОбмена(УзелОбмена)
	
	Если ЗначениеЗаполнено(УзелОбмена) = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Узел обмена не определен");
		Возврат Справочники.СегментыНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		РеквизитыУзла = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(УзелОбмена, "СохраненнаяТаблицаКаталогов, РежимВыгрузки");
		ТаблицаКаталогов = РеквизитыУзла.СохраненнаяТаблицаКаталогов.Получить();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения текущего сегмента узла" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,"Смена сегмента" + Символы.ПС + "Ошибка получения текущего сегмента узла" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Справочники.СегментыНоменклатуры.ПустаяСсылка();
	КонецПопытки;
	
	Для Каждого ТекущаяСтрокаТаблицыКаталогов Из ТаблицаКаталогов Цикл
		
		Если ТекущаяСтрокаТаблицыКаталогов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыУзла.РежимВыгрузки = 2 Тогда
			ЗначениеХранилищеНастроекПакетПредложений = ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекПакетПредложений.Получить();
		ИначеЕсли РеквизитыУзла.РежимВыгрузки = 0 Тогда
			ЗначениеХранилищеНастроекПакетПредложений = ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекКаталогПакет.Получить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеХранилищеНастроекПакетПредложений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьНеобходимыйЭлементВОтборе = Ложь;
		ПКДСегмент = новый ПолеКомпоновкиДанных("СегментНоменклатуры");
		Для Каждого ЭлементОтбораСтрокиКаталога Из ЗначениеХранилищеНастроекПакетПредложений.Отбор.Элементы Цикл
			
			Если ЭлементОтбораСтрокиКаталога.ЛевоеЗначение = ПКДСегмент 
				И ЭлементОтбораСтрокиКаталога.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
				И ЭлементОтбораСтрокиКаталога.Использование = Истина Тогда
				
				Возврат ЭлементОтбораСтрокиКаталога.ПравоеЗначение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Справочники.СегментыНоменклатуры.ПустаяСсылка();
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьВУзелОбменаОтборПоСегменту(Сегмент, УзелОбмена)
	
	Если ЗначениеЗаполнено(Сегмент) = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сегмент не выбран");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УзелОбмена) = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Узел обмена не определен");
		Возврат;
	КонецЕсли;
	
	УзелОбменаОбъект = УзелОбмена.ПолучитьОбъект();
	
	ТаблицаКаталогов = УзелОбменаОбъект.СохраненнаяТаблицаКаталогов.Получить();
	Для Каждого ТекущаяСтрокаТаблицыКаталогов Из ТаблицаКаталогов Цикл
		
		Если ТекущаяСтрокаТаблицыКаталогов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если УзелОбменаОбъект.РежимВыгрузки = 2 Тогда
			ЗначениеХранилищеНастроекПакетПредложений = ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекПакетПредложений.Получить();
		ИначеЕсли УзелОбменаОбъект.РежимВыгрузки = 0 Тогда
			ЗначениеХранилищеНастроекПакетПредложений = ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекКаталогПакет.Получить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеХранилищеНастроекПакетПредложений = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьНеобходимыйЭлементВОтборе = Ложь;
		ПКДСегмент = новый ПолеКомпоновкиДанных("СегментНоменклатуры");
		Для Каждого ЭлементОтбораСтрокиКаталога Из ЗначениеХранилищеНастроекПакетПредложений.Отбор.Элементы Цикл
			
			Если ЭлементОтбораСтрокиКаталога.ЛевоеЗначение = ПКДСегмент 
				И ЭлементОтбораСтрокиКаталога.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
				И ЭлементОтбораСтрокиКаталога.Использование = Истина Тогда
				
				ЕстьНеобходимыйЭлементВОтборе = Истина;
				ЭлементОтбораСтрокиКаталога.ПравоеЗначение = Сегмент;
				
			КонецЕсли;
			
			Если ЕстьНеобходимыйЭлементВОтборе Тогда
				Прервать;  //уже добавили в одно из условий, остальные не смотрим
			КонецЕсли;
				
		КонецЦикла;
		
		Если УзелОбменаОбъект.РежимВыгрузки = 2 Тогда
			ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекПакетПредложений = Новый ХранилищеЗначения(ЗначениеХранилищеНастроекПакетПредложений);
		ИначеЕсли УзелОбменаОбъект.РежимВыгрузки = 0 Тогда
			ТекущаяСтрокаТаблицыКаталогов.ХранилищеНастроекКаталогПакет = Новый ХранилищеЗначения(ЗначениеХранилищеНастроекПакетПредложений);	
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	УзелОбменаОбъект.СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ТаблицаКаталогов);
	УзелОбменаОбъект.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура КоординатыМагазинПриИзменении(Элемент)
	КоординатыПеречитатьДанные(КоординатыМагазин);
КонецПроцедуры

&НаСервере
Процедура КоординатыПеречитатьДанные(ПараметрМагазин)
	
	Если НЕ ЗначениеЗаполнено(ПараметрМагазин) Тогда
		Широта = "";
		Долгота = "";
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	МАКСИМУМ(ЕСТЬNULL(ДР_Долгота.Значение, """")) КАК Долгота,
	               |	МАКСИМУМ(ЕСТЬNULL(ДР_Широта.Значение, """")) КАК Широта
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК ДР_Широта
	               |		ПО Склады.Ссылка = ДР_Широта.Ссылка
	               |			И (ДР_Широта.Свойство = &СвойствоШирота)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК ДР_Долгота
	               |		ПО Склады.Ссылка = ДР_Долгота.Ссылка
	               |			И (ДР_Долгота.Свойство = &СвойствоДолгота)
	               |ГДЕ
	               |	Склады.Ссылка = &Склад
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Склады.Ссылка";
	
	Запрос.УстановитьПараметр("СвойствоДолгота", СвойствоДолготаСклада);
	Запрос.УстановитьПараметр("СвойствоШирота", СвойствоШиротаСклада);
	Запрос.УстановитьПараметр("Склад", ПараметрМагазин);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Широта = СокрЛП(ВыборкаДетальныеЗаписи.Широта);
		Долгота = СокрЛП(ВыборкаДетальныеЗаписи.Долгота);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекущуюДатуЗапускаРоботаОтменыЗаказов()
	
	Если НЕ ПустаяСтрока(УИДРоботаОтменыЗаказов) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			РегламентноеЗаданиеGUID = Новый УникальныйИдентификатор(УИДРоботаОтменыЗаказов);
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
			Если НЕ РЗ = Неопределено Тогда
				РасписаниеРЗ = РЗ.Расписание;
				Если ЗначениеЗаполнено(РасписаниеРЗ.ДатаНачала) Тогда 
					Элементы.ДекорацияТекущееСостояниеРоботаОтменыЗаказов.Заголовок = НСтр("ru = 'Робот выполняется с '") + Формат(РасписаниеРЗ.ДатаНачала, "ДФ=dd.MM.yyyy");
				Иначе
					Элементы.ДекорацияТекущееСостояниеРоботаОтменыЗаказов.Заголовок = НСтр("ru = 'Робот выполняется с '") + Формат(Дата(2025,1,1), "ДФ=dd.MM.yyyy");
				КонецЕсли;
			Иначе
				Элементы.ДекорацияТекущееСостояниеРоботаОтменыЗаказов.Заголовок = НСтр("ru = 'Расписание не установлено'");
			КонецЕсли;
		Исключение
			Элементы.ДекорацияТекущееСостояниеРоботаОтменыЗаказов.Заголовок = НСтр("ru = 'Расписание не установлено'");
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СтрШаблон(НСтр("ru = 'Ошибка получения расписания робота отмены заказов: 
                                                                                              |%1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));

		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		Элементы.ДекорацияТекущееСостояниеРоботаОтменыЗаказов.Заголовок = НСтр("ru = 'Расписание не установлено'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДатуСЗапускаРоботаОтменыЗаказов(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаЗапускаРоботаОтменыЗаказовС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указана дата начала выполнения'"));
		Возврат;
	КонецЕсли;
	
	ИзменитьДатуСЗапускаРоботаОтменыЗаказовНаСервере(ДатаЗапускаРоботаОтменыЗаказовС, УИДРоботаОтменыЗаказов);
	ПолучитьТекущуюДатуЗапускаРоботаОтменыЗаказов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьДатуСЗапускаРоботаОтменыЗаказовНаСервере(ДатаЗапускаРоботаОтменыЗаказовС, УИДРоботаОтменыЗаказов)
	
	Если НЕ ПустаяСтрока(УИДРоботаОтменыЗаказов) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			РегламентноеЗаданиеGUID = Новый УникальныйИдентификатор(УИДРоботаОтменыЗаказов);
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗаданиеGUID);
			Если НЕ РЗ = Неопределено Тогда
				РасписаниеРЗ = РЗ.Расписание;
				РасписаниеРЗ.ДатаНачала = ДатаЗапускаРоботаОтменыЗаказовС;
				РегламентныеЗаданияСервер.УстановитьРасписаниеРегламентногоЗаданияИзСтруктуры(РегламентноеЗаданиеGUID, РасписаниеРЗ);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка изменения расписания: регламеное задание не найдено'"));
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка изменения расписания: 
                                                                                              |%1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СтрШаблон(НСтр("ru = 'Ошибка изменения расписания: 
                                                                                              |%1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка изменения расписания: регламеное задание не найдено'"));
	КонецЕсли;


КонецПроцедуры

#КонецОбласти



 #Область ИзменитьПриложениеСборщика

&НаКлиенте
Процедура УстановитьСборку1С(Команда)
	ОтветПользователя = Вопрос(НСтр("ru = 'Вы действительно хотите изменить приложение для сборки выделенных заказов на 1С?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		Для Каждого Стр Из Элементы.Заказы.ВыделенныеСтроки Цикл
			УстановитьПриложениеСборщикаНаСервере(Стр, 0);
		КонецЦикла;
	КонецЕсли;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСборкуМП(Команда)
	ОтветПользователя = Вопрос(НСтр("ru = 'Вы действительно хотите изменить приложение для сборки выделенных заказов на МП Сборщик?'"), РежимДиалогаВопрос.ДаНет);
	Если ОтветПользователя = КодВозвратаДиалога.Да Тогда
		Для Каждого Стр Из Элементы.Заказы.ВыделенныеСтроки Цикл
			УстановитьПриложениеСборщикаНаСервере(Стр, 1);
		КонецЦикла;
	КонецЕсли;
	ОбновитьОтображение();
КонецПроцедуры

&НаСервере
Процедура УстановитьПриложениеСборщикаНаСервере(ЗаказСсылка, ПриложениеСборщика)
	
	НаименованиеПриложениеСборщика = ?(ПриложениеСборщика = 0, "1С", "МП Сборщик");
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ЗаказСсылка, "НомерЗаказаНаСайте, ВитринаИнтернетМагазина, ПриложениеСборщика, Статус");
	
	Если Не РеквизитыЗаказа.ВитринаИнтернетМагазина = Справочники.ВитриныИнтернетМагазина.ЯрчеПлюс Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + РеквизитыЗаказа.НомерЗаказаНаСайте + " не является заказом ЯрчеПлюс" + Символы.ПС + "Изменение приложения для сборки невозможно");
		Возврат;
	КонецЕсли;
	
	Если ПриложениеСборщика = 1 Тогда
		Если Не РеквизитыЗаказа.Статус = Перечисления.СтатусыЗаказовКлиентов.Согласован Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заказ " + РеквизитыЗаказа.НомерЗаказаНаСайте + " не в статусе ""Новый""" + Символы.ПС + "Изменение приложения для сборки невозможно");
			Возврат;
		КонецЕсли;
	ИначеЕсли ПриложениеСборщика = 0 Тогда
		//проверку на состояние заказа не делаю, на 1С можно переключить в любом состоянии	
	КонецЕсли;
	
	Если РеквизитыЗаказа.ПриложениеСборщика = ПриложениеСборщика Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Заказ = ЗаказСсылка.ПолучитьОбъект();
		Заказ.ПриложениеСборщика = ПриложениеСборщика;
		Заказ.Комментарий = Заказ.Комментарий + ?(ЗначениеЗаполнено(Заказ.Комментарий), Символы.ПС, "") 
												+ СтрШаблон(НСтр("ru = 'Передан на сборку ""%1"" - %2 %3'"), НаименованиеПриложениеСборщика, Строка(ПараметрыСеанса.ТекущийПользователь), Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy HH:mm'"));
		Заказ.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);
		Заказ.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
		Заказ.ДополнительныеСвойства.Вставить("НеПроверятьДатыЗапретаИзмененияДанных", Истина);
		Заказ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка изменения приложения для сборки заказа %1 на ""%2"" через АРМ ИМ: %3'"), РеквизитыЗаказа.НомерЗаказаНаСайте, НаименованиеПриложениеСборщика, Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СообщениеОбОшибке);
		СообщениеОбОшибке = СтрШаблон(НСтр("ru = 'Ошибка изменения приложения для сборки заказа %1 на ""%2"" через АРМ ИМ: %3'"), РеквизитыЗаказа.НомерЗаказаНаСайте, НаименованиеПриложениеСборщика, Символы.ПС + ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		Возврат;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область Aliexpress

&НаСервереБезКонтекста
Функция ТекстЗапросаЗаказыАли()
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка,
		|	ЗаказКлиента.НомерЗаказаНаСайте,
		|	ЗаказКлиента.ДатаЗаказаНаСайте,
		|	ЗаказКлиента.Склад,
		|	ЗаказКлиента.СуммаДокумента,
		|	ЗаказКлиента.ЖелаемаяДатаОтгрузки,
		|	ЗаказКлиента.Статус,
		|	ЗаказКлиента.СтатусПроверки,
		|	ЗаказКлиента.АдресДоставки,
		|	ЗаказКлиента.ПокупательФИО,
		|	ЗаказКлиента.ПокупательТелефон,
		|	ЗаказКлиента.ПокупательEmail,
		|	ЗаказКлиента.Комментарий
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ЗаказКлиента.ВитринаИнтернетМагазина = ЗНАЧЕНИЕ(Справочник.ВитриныИнтернетМагазина.Алиэкспресс)
		|	И ЗаказКлиента.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.НеСогласован)
		|";
		
	Возврат ТекстЗапроса;
	
КонецФункции

&НаКлиенте
Процедура ОтборЗаказыАлиДатаНачалаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ОтборЗаказыАлиДатаНачала) Тогда
		ОтборЗаказыАлиДатаНачала = ТекущаяДата() - 15*86400;
	КонецЕсли;
	
	НоваяДатаОкончания = ОтборЗаказыАлиДатаНачала + 15*86400 + 2*86400;
	Если НоваяДатаОкончания < ОтборЗаказыАлиДатаОкончания Тогда
		ОтборЗаказыАлиДатаОкончания = НоваяДатаОкончания;
	КонецЕсли;
	
	ОбновитьЗаказыАлиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗаказыАлиДатаОкончанияПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ОтборЗаказыАлиДатаОкончания) Тогда
        ОтборЗаказыАлиДатаОкончания = ТекущаяДата() + 2*86400;
	КонецЕсли;
	
	НоваяДатаНачала = ОтборЗаказыАлиДатаОкончания - 2*86400 - 15*86400;
	Если НоваяДатаНачала > ОтборЗаказыАлиДатаНачала Тогда
		ОтборЗаказыАлиДатаНачала = НоваяДатаНачала;
	КонецЕсли;
	
	ОбновитьЗаказыАлиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаказыАли(Команда)
	
	ОбновитьЗаказыАлиНаСервере();
	ОбновитьЗаголовокСтраницыЗаказыАли();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаказыАлиНаСервере()
	
	ТекстЗапроса = ТекстЗапросаЗаказыАли();
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ОтборЗаказыАлиДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ОтборЗаказыАлиДатаОкончания));
	РезультатЗапроса = Запрос.Выполнить();
	ОбновитьТаблицуЗаказыАлиНаСервере(РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗаказыАлиНаСервере(РезультатЗапроса)
	
	ЗаказыАли.Очистить();
	
	РезультатВыборка = РезультатЗапроса.Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		НС = ЗаказыАли.Добавить();
		ЗаполнитьЗначенияСвойств(НС, РезультатВыборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокСтраницыЗаказыАли()
	КоличествоСтрокРезультата = ЗаказыАли.Количество();
	Если КоличествоСтрокРезультата = 0 Тогда
		Элементы.ГруппаАлиекспресс.Заголовок = "Aliexpress"; 
		Элементы.ГруппаАлиекспресс.Картинка = Новый Картинка;
	Иначе
		Элементы.ГруппаАлиекспресс.Заголовок = "Aliexpress (" + КоличествоСтрокРезультата + ")";
		Элементы.ГруппаАлиекспресс.Картинка = БиблиотекаКартинок.Внимание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыАлиЗапуститьФоновоеЗадание()
	
	ИмяМетода = "ДлительныеОперации.ВыполнитьЗапросВФоне";
	ТекстЗапроса = ТекстЗапросаЗаказыАли();
	МассивПараметровМетода = Новый Массив;                                                                                                                                                                                            
	МассивПараметровМетода.Добавить(ТекстЗапроса);
	МассивПараметровМетода.Добавить(Новый Структура("ДатаНачала, ДатаОкончания", НачалоДня(ОтборЗаказыАлиДатаНачала), КонецДня(ОтборЗаказыАлиДатаОкончания)));
	КлючНаименование = "ПолучениеПризнакаНаличиеЗаказовАли";
	
	ЗаказыАлиКлючФЗ = ЗапуститьФоновоеЗадание(ИмяМетода, МассивПараметровМетода, КлючНаименование);
	
	//ЭтаФорма.ПодключитьОбработчикОжидания("ЗаказыАлиРезультатФоновогоЗаданияНаКлиенте", 300);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыАлиРезультатФоновогоЗаданияНаКлиенте()
	
	ЗаданиеВыполнено = Ложь;
	ЗаказыАлиРезультатФоновогоЗадания(ЗаказыАлиКлючФЗ, ЗаданиеВыполнено);
	Если ЗаданиеВыполнено Тогда 
		ЭтаФорма.ОтключитьОбработчикОжидания("ЗаказыАлиРезультатФоновогоЗаданияНаКлиенте");
		ОбновитьЗаголовокСтраницыЗаказыАли();
		//ЗаказыАлиЗапуститьФоновоеЗадание();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаказыАлиРезультатФоновогоЗадания(ИдЗадания, ЗаданиеВыполнено = Ложь)
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдЗадания);
	Если ТипЗнч(Задание) = Тип("ФоновоеЗадание") Тогда
		Если Задание.Состояние = СостояниеФоновогоЗадания.Завершено Тогда
			Сообщения = Задание.ПолучитьСообщенияПользователю();
			ЗаданиеВыполнено = Истина;
			Если Сообщения.Количество() > 0 Тогда 
				Рез = ЗначениеИзСтрокиВнутр(Сообщения[0].Текст);
				Если ТипЗнч(Рез) = Тип("РезультатЗапроса") Тогда
					ОбновитьТаблицуЗаказыАлиНаСервере(Рез);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ЗаданиеВыполнено = Истина;	
	КонецЕсли;

КонецПроцедуры                                       

&НаКлиенте
Процедура ЗаказыАлиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийЗаказ = Элемент.ТекущиеДанные.Ссылка;
	ОткрытьФормуЗаказаАли(ТекущийЗаказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаказАли(Команда)
	
	Если Элементы.ЗаказыАли.ВыделенныеСтроки.Количество()<>1 Тогда
		Возврат;
	КонецЕсли;
	Если Элементы.ЗаказыАли.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущийЗаказ = Элементы.ЗаказыАли.ТекущиеДанные.Ссылка;
	ОткрытьФормуЗаказаАли(ТекущийЗаказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаказаАли(ТекущийЗаказ)
	
	Если ТекущийЗаказ = Неопределено ИЛИ ТекущийЗаказ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	П = Новый Структура("Заказ", ТекущийЗаказ);
	ОткрытьФорму("ВнешняяОбработка.АРМИнтернетМагазин.Форма.ФормаЗаказаАли", П);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыАлиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыАлиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыАлиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область Сбермаркет

&НаКлиенте
Процедура СбермаркетЗаполнитьМагазины(Команда)
	СбермаркетЗаполнитьМагазиныНаСервере();
КонецПроцедуры

&НаСервере
Процедура СбермаркетЗаполнитьМагазиныНаСервере()

	МассивГруппМагазинов = Новый Массив;
	МассивГруппМагазинов.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины работающие"));
	МассивГруппМагазинов.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины готовы к открытию"));
	
	МагазиныСбермаркет.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Склады.Ссылка КАК Склад,
	               |	КИ.ЗначенияПолей,
	               |	КИ.Представление,
	               |	ЕСТЬNULL(СкладыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК Сбермаркет
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.КонтактнаяИнформация КАК КИ
	               |		ПО Склады.Ссылка = КИ.Ссылка
	               |			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	               |		ПО Склады.Ссылка = СкладыДополнительныеРеквизиты.Ссылка
	               |			И (СкладыДополнительныеРеквизиты.Свойство = &СвойствоСбермаркет)
	               |ГДЕ
	               |	Склады.Ссылка В ИЕРАРХИИ(&МассивГруппСкладов)
	               |	И Склады.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад
	               |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("МассивГруппСкладов", МассивГруппМагазинов);
	Запрос.УстановитьПараметр("СвойствоСбермаркет", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сбермаркет"));
	
	РезультатЗапрос = Запрос.Выполнить();
	Если РезультатЗапрос.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыборка = РезультатЗапрос.Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		
		НС = МагазиныСбермаркет.Добавить();
		НС.Магазин = РезультатВыборка.Склад;
		НС.Подключен = РезультатВыборка.Сбермаркет;
		НС.address = РезультатВыборка.Представление;
		НС.shop_id = Сбермаркет.ПолучитьЦифровойКодСклада(Лев(Строка(РезультатВыборка.Склад),4));
		НС.city = ПолучитьНазваниеГорода(РезультатВыборка.ЗначенияПолей);
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСписокМагазиновНаСервере()

&НаСервере
Функция ПолучитьНазваниеГорода(ЗначенияПолей)
	
	СЗ = ПолучитьСписокЗначенийИзСтрокиАдреса(ЗначенияПолей);
	Регион = "";
	Город = "";
	Префикс = "";
	
	Для Каждого ЗначениеАдреса Из СЗ Цикл
		Если ЗначениеАдреса.Представление = "Регион" Тогда 
			Регион = ЗначениеАдреса.Значение;
		КонецЕсли;
		Если ЗначениеАдреса.Представление = "Город" Тогда
			Если Префикс = "" Тогда
				Город = ЗначениеАдреса.Значение;				
				Префикс = "г";
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеАдреса.Представление = "НаселенныйПункт" Тогда 
			Город = ЗначениеАдреса.Значение;				
			Префикс = "п";
		КонецЕсли;
	КонецЦикла;
	
	//ФИКС: Москва не город, а регион в КЛАДР
	Если Город = "" И Префикс = "" И НЕ Регион = "" Тогда
		Город = Регион;
		Префикс = "г";
	КонецЕсли;

	ИсходноеНазвание = СтрЗаменить(Город, " ", Символы.ПС);
	Город = "";
		
	Для Сч = 1 По СтрЧислоСтрок(ИсходноеНазвание) Цикл
		Стр = СтрПолучитьСтроку(ИсходноеНазвание, Сч);
		Стр = УбратьЗнаки(Стр);
		Если СтрДлина(Стр) = 0 Тогда 
			Продолжить;
		КонецЕсли;
		Если НРег(Стр) = "пгт" ИЛИ НРег(Стр) = "п" ИЛИ НРег(Стр) = "с" ИЛИ НРег(Стр) = "д" ИЛИ НРег(Стр) = "дп" ИЛИ НРег(Стр) = "рп" ИЛИ НРег(Стр) = "гп" Тогда
			Продолжить;
		КонецЕсли;
		Если НРег(Стр) = "г" Тогда 
			Продолжить;
		КонецЕсли;
		Если НРег(Стр) = "мкр" Тогда 
			Продолжить;
		КонецЕсли;	
		Город = Город + ?(ПустаяСтрока(Город),""," ") + СокрЛП(Стр);
	КонецЦикла;
	
	Возврат Город;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокЗначенийИзСтрокиАдреса(СтрокаАдреса)
	СЗАдреса = Новый СписокЗначений;
	ПоследнийЭлемент = Неопределено;
	
	Для Сч = 1 По СтрЧислоСтрок(СтрокаАдреса) Цикл
		Стр = СтрПолучитьСтроку(СтрокаАдреса, Сч);
		Если Лев(Стр, 1) = Символы.Таб Тогда
			Если ПоследнийЭлемент <> Неопределено Тогда
				ПоследнийЭлемент.Значение = ПоследнийЭлемент.Значение + Символы.ПС + Сред(Стр, 2);
			КонецЕсли;
		Иначе
			Поз = Найти(Стр, "=");
			Если Поз <> 0 Тогда
				ПоследнийЭлемент = СЗАдреса.Добавить(Сред(Стр, Поз+1), Лев(Стр, Поз-1));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СЗАдреса;
КонецФункции

&НаСервере
Функция УбратьЗнаки(Вход)
	ТолькоРусскиеБуквыИЦифры = ",.;";
    Выход = "";
	Для К=1 по СтрДлина(Вход) Цикл
		Бкв = Сред(Вход,К,1);
		Если НЕ Найти(ТолькоРусскиеБуквыИЦифры, Бкв) = 0 Тогда
			Продолжить;
		Иначе
			Выход = Выход + Бкв;
		КонецЕсли;
    КонецЦикла;
    Возврат Выход;
КонецФункции

&НаКлиенте
Процедура СбермаркетВыбратьПоГруппеСкладов(Команда)
	
	Элементы.МагазиныСбермаркет.ВыделенныеСтроки.Очистить();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Склады"));
	ТипыДанных = Новый ОписаниеТипов(МассивТипов);
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("РежимВыбора", Истина);
	ПараметрыВыбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Группы);
	ПараметрыВыбора.Вставить("РазрешитьВыборКорня", Ложь);
	ПараметрыВыбора.Вставить("ТекущаяСтрока", СбермаркетГруппаМагазиновДляВыделения);
	ПараметрыВыбора.Вставить("ЗакрыватьПослеВыбора", Истина);
	ОткрытьФорму("Справочник.Склады.ФормаВыбора", ПараметрыВыбора, ЭтаФорма);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СкладыПустаяСсылка()
	Возврат Справочники.Склады.ПустаяСсылка();
КонецФункции

&НаСервере
Функция ПолучитьМассивМагазиновПоГруппеМагазинов(ГруппаМагазинов = Неопределено)
	
	МассивМагазинов = Новый Массив;
	
	Если НЕ ТипЗнч(ГруппаМагазинов) = Тип("СправочникСсылка.Склады") Тогда
		Возврат МассивМагазинов;
	КонецЕсли;
	
	Если ГруппаМагазинов = Справочники.Склады.ПустаяСсылка() И НЕ ГруппаМагазинов.ЭтоГруппа Тогда
		Возврат МассивМагазинов;	
	КонецЕсли;
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка В ИЕРАРХИИ(&ГруппаМагазинов)
		|	И НЕ Склады.ЭтоГруппа
		|";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ГруппаМагазинов", ГруппаМагазинов);
	РезультатЗапроса = Запрос.Выполнить();
	МассивМагазинов = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивМагазинов;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.Склады.Форма.ФормаВыбора" Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Склады") Тогда
			
			СбермаркетГруппаМагазиновДляВыделения = ВыбранноеЗначение;
			МассивМагазинов = ПолучитьМассивМагазиновПоГруппеМагазинов(СбермаркетГруппаМагазиновДляВыделения);
			Если МассивМагазинов.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			Для Каждого СтрокаТаблицы Из МагазиныСбермаркет Цикл
				
				Если МассивМагазинов.Найти(СтрокаТаблицы.Магазин) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если Элементы.МагазиныСбермаркет.ВыделенныеСтроки.Количество()=0 Тогда
					Элементы.МагазиныСбермаркет.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
				КонецЕсли;
				
				Элементы.МагазиныСбермаркет.ВыделенныеСтроки.Добавить(СтрокаТаблицы.ПолучитьИдентификатор());
				
			КонецЦикла;
			
		Иначе
			
			СбермаркетГруппаМагазиновДляВыделения = СкладыПустаяСсылка();
			
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СбермаркетОтметитьВсе(Команда)
	Для Каждого СтрокаТЗ Из Элементы.МагазиныСбермаркет.ВыделенныеСтроки Цикл
		СтрокаТаблицы = МагазиныСбермаркет.НайтиПоИдентификатору(СтрокаТЗ);
		СтрокаТаблицы.Подключен = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СбермаркетСнятьВсе(Команда)
	Для Каждого СтрокаТЗ Из Элементы.МагазиныСбермаркет.ВыделенныеСтроки Цикл
		СтрокаТаблицы = МагазиныСбермаркет.НайтиПоИдентификатору(СтрокаТЗ);
		СтрокаТаблицы.Подключен = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СбермаркетЗаписатьМагазины(Команда)
	СбермаркетЗаписатьМагазиныНаСервере();
КонецПроцедуры

&НаСервере
Процедура СбермаркетЗаписатьМагазиныНаСервере()
	
	МассивГруппМагазинов = Новый Массив;
	МассивГруппМагазинов.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины работающие"));
	МассивГруппМагазинов.Добавить(Справочники.Склады.НайтиПоНаименованию("Магазины готовы к открытию"));
    СвойствоСбермаркет = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сбермаркет");
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ДанныеФормы.Магазин,
	               |	ДанныеФормы.Подключен
	               |ПОМЕСТИТЬ ВТ_ДанныеФормы
	               |ИЗ
	               |	&ДанныеФормы КАК ДанныеФормы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Склады.Ссылка КАК Магазин,
	               |	ЕСТЬNULL(СкладыДополнительныеРеквизиты.Значение, ЛОЖЬ) КАК Подключен
	               |ПОМЕСТИТЬ ВТ_ДанныеБД
	               |ИЗ
	               |	Справочник.Склады КАК Склады
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады.ДополнительныеРеквизиты КАК СкладыДополнительныеРеквизиты
	               |		ПО Склады.Ссылка = СкладыДополнительныеРеквизиты.Ссылка
	               |			И (СкладыДополнительныеРеквизиты.Свойство = &СвойствоСберкмаркет)
	               |ГДЕ
	               |	Склады.Ссылка В ИЕРАРХИИ(&МассивГруппСкладов)
	               |	И Склады.ЭтоГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеФормы.Магазин,
	               |	ВТ_ДанныеФормы.Подключен
	               |ИЗ
	               |	ВТ_ДанныеФормы КАК ВТ_ДанныеФормы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДанныеБД КАК ВТ_ДанныеБД
	               |		ПО ВТ_ДанныеФормы.Магазин = ВТ_ДанныеБД.Магазин
	               |			И ВТ_ДанныеФормы.Подключен <> ВТ_ДанныеБД.Подключен";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивГруппСкладов", МассивГруппМагазинов);
	Запрос.УстановитьПараметр("ДанныеФормы", МагазиныСбермаркет.Выгрузить(, "Магазин, Подключен"));
	Запрос.УстановитьПараметр("СвойствоСберкмаркет", СвойствоСбермаркет);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыборка = РезультатЗапроса.Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		
		СкладОбъект = РезультатВыборка.Магазин.ПолучитьОбъект();
		
		ЕстьРеквизит = Ложь;
		МассивРеквизитовСбермаркет = СкладОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", СвойствоСбермаркет));
		Для Каждого РеквизитСбермаркет Из МассивРеквизитовСбермаркет Цикл
			РеквизитСбермаркет.Значение = РезультатВыборка.Подключен;
			ЕстьРеквизит = Истина;
		КонецЦикла;
		
		Если НЕ ЕстьРеквизит Тогда
			НС = СкладОбъект.ДополнительныеРеквизиты.Добавить();
			НС.Свойство = СвойствоСбермаркет;
			НС.Значение = РезультатВыборка.Подключен;
		КонецЕсли;
		
		СкладОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МагазиныСбермаркетПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура МагазиныСбермаркетПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти



