&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НомерВерсииПриНачалеРедактирования", НомерВерсииПриНачалеРедактирования) Тогда
		НомерВерсииПриНачалеРедактирования = 0;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ВариантВозврата", ВариантВозврата) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, ЭквайринговаяОперация");
	ЗаказНомер 				= СтруктураРеквизитов.НомерЗаказаНаСайте;
	ЭквайринговаяОперация 	= СтруктураРеквизитов.ЭквайринговаяОперация;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Номенклатура,
	               |	ЕСТЬNULL(ЗаказКлиентаАкцизныеМарки.Количество, ЗаказКлиентаТовары.КоличествоУпаковок) КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаАкцизныеМарки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЗаказКлиентаТовары.КоличествоШтук
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК КоличествоШтук,
	               |	ЗаказКлиентаТовары.ПричинаОтмены,
	               |	ЗаказКлиентаТовары.Цена,
	               |	ВЫБОР
	               |		КОГДА ЗаказКлиентаАкцизныеМарки.Ссылка ЕСТЬ NULL
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК МаркируемаяПродукция,
	               |	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	               |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
	               |	ЕСТЬNULL(ЗаказКлиентаАкцизныеМарки.Марка, """") КАК Марка
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.АкцизныеМарки КАК ЗаказКлиентаАкцизныеМарки
	               |		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиентаАкцизныеМарки.Ссылка
	               |			И ЗаказКлиентаТовары.КодСтроки = ЗаказКлиентаАкцизныеМарки.КлючСвязи
	               |			И (НЕ ЗаказКлиентаАкцизныеМарки.Отменено)
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка = &Заказ
	               |	И НЕ ЗаказКлиентаТовары.Отменено
	               |	И ЗаказКлиентаТовары.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка)";

	Запрос.УстановитьПараметр("Заказ", Заказ);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
	ПричинаОтменыПустаяСсылка 	= Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();
	ПричинаОтменыКомплектация	= Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Недостача");
	ПричинаОтменыОтказ			= Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Отказ");
	ТипНоменклатурыУслуга		= Перечисления.ТипыНоменклатуры.Услуга;
	
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Очистить();
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыПустаяСсылка, " ");
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыКомплектация, "Недостача");
	Элементы.ТоварыПричинаОтмены.СписокВыбора.Добавить(ПричинаОтменыОтказ, "Отказ");
	
	ИспользуемКорРТУ = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПоказателиКВозврату();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокументыНаВозврат(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Заказ", Заказ);
	СтруктураПараметров.Вставить("Результат", Истина);
	СтруктураПараметров.Вставить("ОписаниеРезультата", "");
	
	СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров);
	
	Если НЕ СтруктураПараметров.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
	Иначе
		Предупреждение("Документы успешно созданы");
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаВозвратНаСервере(СтруктураПараметров)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаВозврата = ТекущаяДата();
	
	СообщениеОбОшибке = "";
	Если НЕ СтруктураПараметров.Свойство("Заказ") Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + ?(СтрДлина(СообщениеОбОшибке)>0, ", ", "") + "Заказ";
	КонецЕсли;
			
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		СообщениеОбОшибке = "Ошибка входных данных, отсутствуют параметры: " + СообщениеОбОшибке;
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		Возврат;
	КонецЕсли;
		
	ТЗ_Возврат = Товары.Выгрузить();
	ТЗ_Возврат.Очистить();
	
	Для Каждого СтрокаТЗ Из Товары Цикл
		Если СтрокаТЗ.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		НС = ТЗ_Возврат.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаТЗ);
	КонецЦикла;
	
	Если ТЗ_Возврат.Количество() = 0 Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Нет данных для формирования документов на возврат");
		Возврат;
	КонецЕсли;
	
	//МассивДокументовДляПроведения = Новый Массив;
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	//корректируем заказ
	ЗаказОбъект = СтруктураПараметров.Заказ.ПолучитьОбъект();
	СуммаЗаказаДоИзменения = ЗаказОбъект.СуммаДокумента;
	Результат = ОбработкаОбъект.СкорректироватьТоварыЗаказа(ЗаказОбъект, ТЗ_Возврат, СообщениеОбОшибке);
	Если Не Результат Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
		Возврат;
	КонецЕсли;		                                    
	СуммаЗаказаПослеИзменения = ЗаказОбъект.СуммаДокумента;
	СуммаВозврата = Окр(СуммаЗаказаДоИзменения - СуммаЗаказаПослеИзменения, 2);
	
	ПроданныеТовары = ИнтернетМагазинСлужебный.ИнициализацияТаблицыТоваров();
	Для Каждого СтрокаТовар Из ЗаказОбъект.Товары Цикл
		Если СтрокаТовар.Отменено Тогда
			Продолжить;
		КонецЕсли;
		НС = ПроданныеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС, СтрокаТовар);
	КонецЦикла;
	
	Реализация = ИнтернетМагазинСлужебный.РеализацияПоЗаказу(СтруктураПараметров.Заказ);
	РеализацияОбъект = Неопределено;
	ВозвратОбъект = Неопределено;
	КорректировкаРегистровОбъект = Неопределено;
    КорректировкаРеализацииОбъект = Неопределено;

	Если Реализация <> Неопределено Тогда
		
		Если ИспользуемКорРТУ Тогда
			
			ОснованиеКорректировки = ИнтернетМагазинСлужебный.ДокументаОснованиеДляКорректировкиРеализации(Реализация);	
			КорректировкаРеализацииОбъект = ИнтернетМагазинСлужебный.СоздатьКорректировкуРеализации(ОснованиеКорректировки, ДатаВозврата, ПроданныеТовары); 
			ВозвратОбъект = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
			ОбработкаОбъект.СформироватьВозвратОтКлиентаПоРеализации(ВозвратОбъект, СтруктураПараметров.Заказ, Реализация, ТЗ_Возврат, ДатаВозврата);
			
		Иначе 

			//РТУ
			РеализацияОбъект = Реализация.ПолучитьОбъект();
			ОбработкаОбъект.СкорректироватьТоварыРТУ(РеализацияОбъект, ТЗ_Возврат, Истина, ""); 
			РеализацияОбъект.ДополнительныеСвойства.Вставить("ПроверкаДатыЗапретаИзменения", Ложь);
			РеализацияОбъект.ДополнительныеСвойства.Вставить("НеКонтролироватьРезультатыПроведения", Истина);
			РеализацияОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмБлокировкиОтгруженныхДокументов", Истина);	
			
			//Возврат
			ВозвратОбъект = Документы.ВозвратТоваровОтКлиента.СоздатьДокумент();
			ОбработкаОбъект.СформироватьВозвратОтКлиентаПоРеализации(ВозвратОбъект, СтруктураПараметров.Заказ, Реализация, ТЗ_Возврат, ДатаВозврата);  
			
			//Корректировка регистров
			КорректировкаРегистровОбъект = ИнтернетМагазинСлужебный.СформироватьКорректировкуРегистров_ОтменаЗаказа(Реализация, ТЗ_Возврат, ДатаВозврата, " # Закрыто роботом # Возврат по заказу клиенту, формирование резерва по свободным остаткам");
			
		КонецЕсли;

	КонецЕсли;
	
	//Эквайринговая операция
	ЭО = Неопределено;
	Если ЗначениеЗаполнено(ЗаказОбъект.ЭквайринговаяОперация) Тогда
		ЭО = ЗаказОбъект.ЭквайринговаяОперация.Скопировать(); 
		ЭО.Дата = ДатаВозврата;
		ЭО.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
		ЭО.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Возврат денежных средств покупателю");
		ЭО.СуммаДокумента = СуммаВозврата;
		Для Каждого Стр Из ЭО.РасшифровкаПлатежа Цикл
			Стр.Сумма = СуммаВозврата;
			Стр.СуммаВзаиморасчетов = СуммаВозврата;
		КонецЦикла;
	КонецЕсли;
		
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(СтруктураПараметров.Заказ);
	Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Если РеализацияОбъект <>  Неопределено Тогда
			РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;			
		Если КорректировкаРеализацииОбъект <> Неопределено Тогда
			КорректировкаРеализацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СФОбъект = ИнтернетМагазинСлужебный.СоздатьСФПоРТУ(КорректировкаРеализацииОбъект.Ссылка, ДатаВозврата, ЗаказОбъект.Организация);
			СФОбъект.Записать();
		КонецЕсли;
		Если ВозвратОбъект <> Неопределено Тогда
			ВозвратОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;  
		Если КорректировкаРегистровОбъект <> Неопределено Тогда
			КорректировкаРегистровОбъект.Записать();
		КонецЕсли;
		Если ЭО <> Неопределено Тогда
			ЭО.Записать(РежимЗаписиДокумента.Проведение);
			НС = ЗаказОбъект.Оплаты.Добавить();
			НС.Документ = ЭО.Ссылка;
			НС.Дата = ТекущаяДата();
			НС.СуммаДокумента = СуммаВозврата;
		КонецЕсли;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);  
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("АРМ ИМ", УровеньЖурналаРегистрации.Ошибка, , ,СообщениеОбОшибке);
		СообщениеОбОшибке = "Ошибка формирования документов на возврат через АРМ ИМ:" + Символы.ПС + ОписаниеОшибки();
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", СообщениеОбОшибке);
	КонецПопытки;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПричинаОтменыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеЗаказ.ТекущиеДанные;
	
	Если ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка Тогда
		СвернутьТовары();
	Иначе
		Если ТекущиеДанные.ТипНоменклатуры = ТипНоменклатурыУслуга Тогда
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыКомплектация;
		КонецЕсли;
		АлгоритмВозврата(ТекущиеДанные);
	КонецЕсли;
	
	ОбновитьПоказателиКВозврату();
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмВозврата(ТекущиеДанные)
	
	Если ТекущиеДанные.МаркируемаяПродукция Тогда 
		//ничего не делаем просто меняем причину
	Иначе

		КоличествоДляВозврата = ТекущиеДанные.Количество;
		ТекстВопроса = "Сколько вернуть?";
		ОтветПользователя = "";
		
		Если ТекущиеДанные.КоличествоШтук > 0 Тогда
			СЗ_Кнопки = новый СписокЗначений;
			СЗ_Кнопки.Добавить("Штуки", "Штуки");
			СЗ_Кнопки.Добавить("Вес", "Вес");
			ОтветПользователя = Вопрос("Возвращаем штуки или вес?", СЗ_Кнопки);
			Если ОтветПользователя = "Штуки" Тогда
				КоличествоДляВозврата = ТекущиеДанные.КоличествоШтук;
				ТекстВопроса = "Сколько штук вернуть?";
			Иначе
				КоличествоДляВозврата = ТекущиеДанные.Количество;
				ТекстВопроса = "Какой вес вернуть?";
			КонецЕсли;
		КонецЕсли;
		ИсходноеКоличество = КоличествоДляВозврата;
	
		Если ВвестиЧисло(КоличествоДляВозврата, ТекстВопроса) Тогда
			
			Если КоличествоДляВозврата > ИсходноеКоличество Тогда
				Предупреждение("Нельзя вернуть больше чем продано!");
				ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				СвернутьТовары();
				Возврат;
			КонецЕсли;
		
			Если КоличествоДляВозврата < 0 Тогда
				Предупреждение("Нельзя вернуть отрицательное количество!");
				ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				СвернутьТовары();
				Возврат;
			КонецЕсли;
			
			Если ОтветПользователя = "Штуки" Тогда
				КолШтукВозврат = КоличествоДляВозврата;
				КолВозврат = Окр(ТекущиеДанные.Количество * КоличествоДляВозврата / ТекущиеДанные.КоличествоШтук, 3);
			Иначе
				КолШтукВозврат = Окр(КоличествоДляВозврата * ТекущиеДанные.КоличествоШтук / ТекущиеДанные.Количество, 0);
				КолШтукВозврат = ?(КолШтукВозврат = 0 И ТекущиеДанные.КоличествоШтук > 0, 1, КолШтукВозврат);
				КолВозврат = КоличествоДляВозврата;
			КонецЕсли;	
			
			Если КолВозврат < ТекущиеДанные.Количество Тогда
				
				НС = Товары.Добавить();
				НС.Номенклатура = ТекущиеДанные.Номенклатура;
				НС.Количество = ТекущиеДанные.Количество - КолВозврат;
				НС.КоличествоШтук = ТекущиеДанные.КоличествоШтук - КолШтукВозврат;
				НС.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
				НС.Цена = ТекущиеДанные.Цена;
				НС.МаркируемаяПродукция = ТекущиеДанные.МаркируемаяПродукция;
				НС.ТипНоменклатуры = ТекущиеДанные.ТипНоменклатуры;
				НС.Склад = ТекущиеДанные.Склад;
				
				ТекущиеДанные.Количество = КолВозврат;
				ТекущиеДанные.КоличествоШтук = КолШтукВозврат;
				
			КонецЕсли;
		
		Иначе
		
			ТекущиеДанные.ПричинаОтмены = ПричинаОтменыПустаяСсылка;
		
		КонецЕсли;
		
	КонецЕсли;
		
	Если ТекущиеДанные.МаркируемаяПродукция И ТекущиеДанные.ПричинаОтмены <> ПричинаОтменыОтказ ТОгда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для маркируемой продукции возврат возможен только с причиной ""Отказ""");
		ТекущиеДанные.ПричинаОтмены = ПричинаОтменыОтказ;
	КонецЕсли;
	
	СвернутьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьТовары()
	
	НоменклатураСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.Номенклатура;
	ПричинаОтменыСтроки = Элементы.ДанныеЗаказ.ТекущиеДанные.ПричинаОтмены;
	СвернутьТоварыНаСервере();
	Для Каждого СтрокаТаблицы Из Товары Цикл
		Если СтрокаТаблицы.Номенклатура = НоменклатураСтроки 
			И СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыСтроки Тогда
			Элементы.ДанныеЗаказ.ТекущаяСтрока = СтрокаТаблицы.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТоварыНаСервере()
	
	ТЗ_Товары = Товары.Выгрузить();
	ТЗ_Товары.Свернуть("Номенклатура, ПричинаОтмены, МаркируемаяПродукция, Марка, Цена, ТипНоменклатуры, Склад", "Количество, КоличествоШтук");
	Товары.Загрузить(ТЗ_Товары);
	Товары.Сортировать("Номенклатура, ПричинаОтмены");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоказателиКВозврату()
	
	КоличествоПозицийКВозвратуОтказ = 0;
	ОбщееКоличествоКВозвратуОтказ = 0;
	ОбщаяСуммаКВозвратуОтказ = 0;
	КоличествоПозицийКВозвратуКомплектация = 0;
	ОбщееКоличествоКВозвратуКомплектация = 0;
	ОбщаяСуммаКВозвратуКомплектация = 0;
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыОтказ Тогда
			КоличествоПозицийКВозвратуОтказ = КоличествоПозицийКВозвратуОтказ + 1;
			ОбщееКоличествоКВозвратуОтказ = ОбщееКоличествоКВозвратуОтказ + СтрокаТаблицы.Количество;
			ОбщаяСуммаКВозвратуОтказ = ОбщаяСуммаКВозвратуОтказ + Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена,2);
		ИначеЕсли СтрокаТаблицы.ПричинаОтмены = ПричинаОтменыКомплектация Тогда
			КоличествоПозицийКВозвратуКомплектация = КоличествоПозицийКВозвратуКомплектация + 1;
			ОбщееКоличествоКВозвратуКомплектация = ОбщееКоличествоКВозвратуКомплектация + СтрокаТаблицы.Количество;
			ОбщаяСуммаКВозвратуКомплектация = ОбщаяСуммаКВозвратуКомплектация + Окр(СтрокаТаблицы.Количество * СтрокаТаблицы.Цена,2);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.нПоказателиВозвратаОтказ.Заголовок = "К возврату позиций (количество) отказ: " + КоличествоПозицийКВозвратуОтказ + " (" + ОбщееКоличествоКВозвратуОтказ + "), на сумму " + Формат(ОбщаяСуммаКВозвратуОтказ,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	Элементы.нПоказателиВозвратаКомплектация.Заголовок = "К возврату позиций (количество) комплектация: " + КоличествоПозицийКВозвратуКомплектация + " (" + ОбщееКоличествоКВозвратуКомплектация + "), на сумму " + Формат(ОбщаяСуммаКВозвратуКомплектация,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	ИтогоКоличествоПозицийКВозврату = КоличествоПозицийКВозвратуОтказ + КоличествоПозицийКВозвратуКомплектация;
	ИтогоОбщееКоличествоКВозврату =  ОбщееКоличествоКВозвратуОтказ + ОбщееКоличествоКВозвратуКомплектация;
	ИтогоОбщаяСуммаКВозврату = ОбщаяСуммаКВозвратуОтказ + ОбщаяСуммаКВозвратуКомплектация;
	Элементы.нПоказателиВозвратаИтоги.Заголовок = "Итого к возврату позиций (количество): " + ИтогоКоличествоПозицийКВозврату + " (" + ИтогоОбщееКоличествоКВозврату + "), на сумму " + Формат(ИтогоОбщаяСуммаКВозврату,"ЧДЦ=2; ЧРД=.; ЧГ=0") + " руб.";
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
