&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НомерВерсииПриНачалеРедактирования", НомерВерсииПриНачалеРедактирования) Тогда
		НомерВерсииПриНачалеРедактирования = 0;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	ЗаказНомер = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "НомерЗаказаНаСайте");
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заказ, "ДатаОкончанияКомплектовки") > Дата(1,1,1) Тогда
    	ЗаказСобран = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Количество,
		|	ЗаказКлиентаТовары.КоличествоШтук,
		|	ЗаказКлиентаТовары.Количество КАК КоличествоВЗаказе,
		|	ЗаказКлиентаТовары.КоличествоШтук КАК КоличествоШтукВЗаказе,
		|	ЗаказКлиентаТовары.Отменено,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.ТипМаркируемойПродукции = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК МаркируемаяПродукция
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ";

	Запрос.УстановитьПараметр("Заказ", Заказ);

	Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Элементы.ФормаОбновитьСостав.Заголовок = "Закрыть";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостав(Команда)
	
	СтруктураПараметров = Новый Структура("Результат, ОписаниеРезультата", Истина, "");
	
	Если ЕстьИзменения Тогда
		Если ЕстьИзмененияМаркруемыхТоваров И ЗаказСобран Тогда
			Если Вопрос("Есть изменения маркируемых товаров, после принятия изменений информация о считанных марках по этим товарам будет удалена, восстановить можно будет только вернув заказ." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ОбновитьНаСервере(СтруктураПараметров);
		Если СтруктураПараметров.Результат = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

Процедура ОбновитьНаСервере(СтруктураПараметров)
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	СкорректироватьТоварыДокумента(ЗаказОбъект, Товары.Выгрузить());
	
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(Заказ);
	Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		Возврат;
	КонецЕсли;
	
	Попытка
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ЗаписьЖурналаРегистрации("ИМ.АРМИзменениеСостава", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка записи документа
                                                                         |%1
                                                                         |%2'"), Строка(Заказ), ОписаниеОшибки()));
	КонецПопытки;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

Процедура СкорректироватьТоварыДокумента(ДокументОбъект, Товары, ЭтоЗаказ = Истина)
	
	Если ЭтоЗаказ Тогда
		ПричинаОтказКлиента = ОбщегоНазначенияСерверПовтИсп.ЗначениеКонстанты("ПричинаОтказКлиентаИМ");
		
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 3, ДопустимыйЗнак.Любой)));
		ТЗ.Колонки.Добавить("КоличествоШтук", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой)));
		
		Для Каждого Стр Из Товары Цикл
			Если Не Стр.Отменено Тогда
				ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Стр);
			КонецЕсли; 
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЗ.Номенклатура,
		               |	ТЗ.Количество,
		               |	ТЗ.КоличествоШтук
		               |ПОМЕСТИТЬ НоваяТЧ
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НоваяТЧ.Номенклатура,
		               |	НоваяТЧ.Количество,
		               |	НоваяТЧ.КоличествоШтук,
		               |	ЗаказКлиентаТовары.Количество КАК КоличествоЗаказ,
		               |	ЗаказКлиентаТовары.Количество - НоваяТЧ.Количество КАК КоличествоОтмена,
		               |	ЗаказКлиентаТовары.КоличествоШтук КАК КоличествоШтукЗаказ,
		               |	ЗаказКлиентаТовары.КоличествоШтук - НоваяТЧ.КоличествоШтук КАК КоличествоШтукОтмена,
		               |	ВЫБОР
		               |		КОГДА НоваяТЧ.Количество = 0
		               |			ТОГДА ИСТИНА
		               |		ИНАЧЕ ЛОЖЬ
		               |	КОНЕЦ КАК ОтменитьСтроку
		               |ИЗ
		               |	НоваяТЧ КАК НоваяТЧ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |		ПО (ЗаказКлиентаТовары.Номенклатура = НоваяТЧ.Номенклатура)
		               |			И (НЕ ЗаказКлиентаТовары.Отменено)
		               |ГДЕ
		               |	ЗаказКлиентаТовары.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ЗаказКлиентаТовары.Номенклатура,
		               |	НоваяТЧ.Количество,
		               |	НоваяТЧ.КоличествоШтук,
		               |	ЗаказКлиентаТовары.Количество,
		               |	0,
		               |	ЗаказКлиентаТовары.КоличествоШтук,
		               |	0,
		               |	ИСТИНА
		               |ИЗ
		               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ НоваяТЧ КАК НоваяТЧ
		               |		ПО ЗаказКлиентаТовары.Номенклатура = НоваяТЧ.Номенклатура
		               |ГДЕ
		               |	ЗаказКлиентаТовары.Ссылка = &Ссылка
		               |	И НоваяТЧ.Номенклатура ЕСТЬ NULL ";
		
		Рез = Запрос.Выполнить().Выбрать();
		
		Пока Рез.Следующий() Цикл
			Если Рез.ОтменитьСтроку Или Рез.КоличествоОтмена Тогда
				СтрокиПоиск = ДокументОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Количество, Отменено", Рез.Номенклатура, Рез.КоличествоЗаказ, Ложь));
				Если СтрокиПоиск.Количество() Тогда
					СтрокаТЧ = СтрокиПоиск[0];
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Рез.ОтменитьСтроку Тогда
					СтрокаТЧ.Отменено = Истина;
					СтрокаТЧ.ПричинаОтмены = ПричинаОтказКлиента;
				Иначе	
					СтрокаТЧ.Количество = Рез.Количество;
					СтрокаТЧ.КоличествоУпаковок = Рез.Количество;
					СтрокаТЧ.КоличествоШтук = Рез.КоличествоШтук;
					СтрокаТЧ.Сумма = СтрокаТЧ.Цена * СтрокаТЧ.КоличествоУпаковок;
					СтрокаТЧ.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(СтрокаТЧ.Сумма, СтрокаТЧ.СтавкаНДС, Истина);
					
					Если Рез.КоличествоОтмена > 0 Тогда
						НоваяСтрока = ДокументОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
						НоваяСтрока.Отменено = Истина;
						НоваяСтрока.ПричинаОтмены = ПричинаОтказКлиента;
						НоваяСтрока.Количество = Рез.КоличествоОтмена;
						НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
						НоваяСтрока.КоличествоШтук = Рез.КоличествоШтукОтмена;
						НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.КоличествоУпаковок;
						НоваяСтрока.СуммаНДС = Ценообразование.РассчитатьСуммуНДС(НоваяСтрока.Сумма, НоваяСтрока.СтавкаНДС, Истина);
					КонецЕсли;
					
				КонецЕсли; 
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Если Не ЭтоЗаказ Тогда 		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура,
		|	ЗаказКлиентаТовары.Упаковка,
		|	ЗаказКлиентаТовары.КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Количество,
		|	ЗаказКлиентаТовары.ВидЦены,
		|	ЗаказКлиентаТовары.Цена,
		|	ЗаказКлиентаТовары.Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС,
		|	ЗаказКлиентаТовары.СуммаНДС
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|	И НЕ ЗаказКлиентаТовары.Отменено";
		
		Запрос.УстановитьПараметр("Заказ", Товары);
		
		ДокументОбъект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		
		Сумма = ДокументОбъект.Товары.Итог("Сумма");
		ДокументОбъект.СуммаДокумента = Сумма;
		Если Не ДокументОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
			ДокументОбъект.ОплатаПлатежнымиКартами[0].Сумма = Сумма;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказКоличествоПриИзменении(Элемент)
	ЕстьИзменения = ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 1);
	Если ЕстьИзменения Тогда
		Элементы.ФормаОбновитьСостав.Заголовок = "Обновить состав";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказКоличествоШтукПриИзменении(Элемент)
	ЕстьИзменения = ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 2);
	Если ЕстьИзменения Тогда
		Элементы.ФормаОбновитьСостав.Заголовок = "Обновить состав";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказОтмененоПриИзменении(Элемент)
	ЕстьИзменения = ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 3);
	Если ЕстьИзменения Тогда
		Элементы.ФормаОбновитьСостав.Заголовок = "Обновить состав";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	//ТекущиеДанные = Элементы.ДанныеЗаказ.ТекущиеДанные;
	//ТекущиеДанные.Отменено = Истина;
	
КонецПроцедуры

//НомерИзмененнойКолонки:
//1 - количество
//2 - количество штук
//3 - отменено
&НаКлиенте
Функция ПересчитатьСтрокуТовары(ТекущиеДанные, НомерИзмененнойКолонки)
	
	//маркированная продукция
	Если ТекущиеДанные.МаркируемаяПродукция Тогда
		Если НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Истина Тогда
			ТекущиеДанные.Количество = 0;
			ТекущиеДанные.КоличествоШтук = 0;
			ЕстьИзмененияМаркруемыхТоваров = Истина;
		ИначеЕсли НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Ложь Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоВЗаказе;
			ТекущиеДанные.КоличествоШтук = ТекущиеДанные.КоличествоШтукВЗаказе;
			ЕстьИзмененияМаркруемыхТоваров = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменения количества маркируемой продукции запрещены. Возможен только полный вычерк строки.");
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	//немаркированная продукция
	Если НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Истина Тогда
		ТекущиеДанные.Количество = 0;
		ТекущиеДанные.КоличествоШтук = 0;
	ИначеЕсли НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Ложь Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоВЗаказе;
		ТекущиеДанные.КоличествоШтук = ТекущиеДанные.КоличествоШтукВЗаказе;
	ИначеЕсли НомерИзмененнойКолонки = 1 Тогда
		ТекущиеДанные.Отменено = ТекущиеДанные.Количество = 0;
		НовоеКоличествоШтук = ?(ТекущиеДанные.КоличествоВЗаказе > 0, ТекущиеДанные.Количество * ТекущиеДанные.КоличествоШтукВЗаказе / ТекущиеДанные.КоличествоВЗаказе, 0);
		Если НовоеКоличествоШтук <> ТекущиеДанные.КоличествоШтук Тогда
			Если Вопрос("Пересчитать количество штук?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ТекущиеДанные.КоличествоШтук = НовоеКоличествоШтук;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли НомерИзмененнойКолонки = 2 Тогда
		Если ТекущиеДанные.КоличествоШтукВЗаказе > 0 Тогда
			ТекущиеДанные.Отменено = ТекущиеДанные.КоличествоШтук = 0;
			НовоеКоличество = ТекущиеДанные.КоличествоВЗаказе * ТекущиеДанные.КоличествоШтук / ТекущиеДанные.КоличествоШтукВЗаказе;
			Если ТекущиеДанные.Количество <> НовоеКоличество Тогда
				Если Вопрос("Пересчитать количество?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ТекущиеДанные.Количество = НовоеКоличество;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
		
КонецФункции
