
#Область ОсновныеМетоды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заказ", Заказ) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	НаименованиеКнопкиЗакрыть = "Закрыть";
	НаименованиеКнопкиЗаписать = "Обновить состав";
	
	Если НЕ Параметры.Свойство("НомерВерсииПриНачалеРедактирования", НомерВерсииПриНачалеРедактирования) Тогда
		НомерВерсииПриНачалеРедактирования = 0;
	КонецЕсли;
	
	О = РеквизитФормыВЗначение("Объект");
	Заголовок = О.Метаданные().Комментарий + ": " + О.Метаданные().Синоним + ": " + ЭтаФорма.Заголовок;
	ЭтаФорма.Заголовок = Заголовок;
	
	РеквизитыЗаказа = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Заказ, "НомерЗаказаНаСайте, Соглашение, ДатаОкончанияКомплектовки, СуммаДокумента, СуммаДокументаИсходная, Склад");
	СуммаЗаказаОплаченная = РеквизитыЗаказа.СуммаДокументаИсходная;
	ЗаказНомер = РеквизитыЗаказа.НомерЗаказаНаСайте;
	ЗаказСобран = ЗначениеЗаполнено(РеквизитыЗаказа.ДатаОкончанияКомплектовки);
	СуммаЗаказа = РеквизитыЗаказа.СуммаДокумента;
	Если СуммаЗаказаОплаченная <> 0 Тогда
		СуммаЗаказа = СуммаЗаказаОплаченная;
	КонецЕсли;
	
	Соглашение = РеквизитыЗаказа.Соглашение;
	Если ЗначениеЗаполнено(Соглашение) Тогда
		РеквизитыСоглашения = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Соглашение, "ВидЦен");
		ВидЦены = РеквизитыСоглашения.ВидЦен;
	КонецЕсли;
	СкладЗаказа = РеквизитыЗаказа.Склад;
	
	СегментНоменклатурыДаркКитчен = Справочники.СегментыНоменклатуры.НайтиПоНаименованию("Дарк китчен");
	
	СписокЦеховСПоваром.ЗагрузитьЗначения(ДаркКитченСерверПовтИсп.ПолучитьМассивЦеховГотовкиБлюд());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыПроизводстваДК.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА СтатусыПроизводстваДК.Цех В (&ЦехСПоваром)
		|				ТОГДА СтатусыПроизводстваДК.ФактическоеКоличество
		|			КОГДА СтатусыПроизводстваДК.ТребуетсяОбработка
		|				ТОГДА СтатусыПроизводстваДК.КоличествоСобрано
		|			ИНАЧЕ СтатусыПроизводстваДК.Количество
		|		КОНЕЦ) КАК ФактическоеКоличество,
		|	МАКСИМУМ(СтатусыПроизводстваДК.ТребуетсяОбработка) КАК ТребуетсяОбработка
		|ПОМЕСТИТЬ ВТ_Производство
		|ИЗ
		|	РегистрСведений.СтатусыПроизводстваДК КАК СтатусыПроизводстваДК
		|ГДЕ
		|	СтатусыПроизводстваДК.Документ = &Заказ
		|	И СтатусыПроизводстваДК.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	СтатусыПроизводстваДК.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.ТипМаркируемойПродукции = 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК МаркируемаяПродукция,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоВЗаказе,
		|	ЗаказКлиентаТовары.КоличествоШтук КАК КоличествоШтукВЗаказе,
		|	ВТ_Производство.ФактическоеКоличество КАК КоличествоПриготовлено,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК Количество,
		|	ЗаказКлиентаТовары.КоличествоШтук КАК КоличествоШтук,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено,
		|	ВТ_Производство.ТребуетсяОбработка КАК ТребуетсяОбработка,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказКлиентаТовары.Номенклатура.АссортиментДК КАК Цех
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Производство КАК ВТ_Производство
		|		ПО ЗаказКлиентаТовары.Номенклатура = ВТ_Производство.Номенклатура
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Заказ
		|	И НЕ ЗаказКлиентаТовары.Отменено";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Склад", СкладЗаказа);
	Запрос.УстановитьПараметр("ЦехСПоваром", СписокЦеховСПоваром.ВыгрузитьЗначения());
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаПроизводство, "Документ", Заказ, ВидСравненияКомпоновкиДанных.Равно);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТаблицаПроизводство, "Склад", РеквизитыЗаказа.Склад, ВидСравненияКомпоновкиДанных.Равно);
	
	//НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("ТребуетсяОбработка", Истина));
	//Элементы.ФормаСнятьПризнакТребуетсяОбработка.Видимость = НайденныеСтроки.Количество() <> 0;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийНомерВерсии(Заказ)
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьТекущийНомерВерсии(Заказ);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПересчитатьСуммы();
КонецПроцедуры

#КонецОбласти


#Область МетодыИнтерфейсаОбщие

&НаКлиенте
Процедура ПересчитатьСуммы()
	СуммаТекущая = Товары.Итог("Сумма");
	СуммаДляПодбора = СуммаЗаказа - СуммаТекущая;
	Если СуммаДляПодбора < 0 Тогда
		Элементы.ДекорацияВнимание.Заголовок = "Внимание! Сумма превысила сумму оплаты клиента!";
		Элементы.ФормаОбновитьСостав.Заголовок = НаименованиеКнопкиЗакрыть;
	Иначе
		Элементы.ДекорацияВнимание.Заголовок = "";
		Если ЕстьИзменения Тогда
			Элементы.ФормаОбновитьСостав.Заголовок = НаименованиеКнопкиЗаписать;
		Иначе
			Элементы.ФормаОбновитьСостав.Заголовок = НаименованиеКнопкиЗакрыть;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНажатие(Элемент, СтандартнаяОбработка)
	ОткрытьЗначение(Заказ);
КонецПроцедуры

#КонецОбласти


#Область ДействияФормы

&НаКлиенте
Процедура ОбновитьСостав(Команда)
	
	СтруктураПараметров = Новый Структура("Результат, ОписаниеРезультата", Истина, "");
	
	Если СуммаДляПодбора < 0 И Элементы.ФормаОбновитьСостав.Заголовок <> НаименованиеКнопкиЗакрыть Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Внимание! Сумма превысила сумму оплаты клиента!'"));
		Возврат;
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		
		Если Элементы.ФормаОбновитьСостав.Заголовок = НаименованиеКнопкиЗакрыть Тогда
			Если Вопрос("Есть не сохраненные изменения." + Символы.ПС + "Все равно закрыть форму?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ЭтаФорма.Закрыть();
				Возврат;
			Иначе
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьИзмененияМаркруемыхТоваров И ЗаказСобран Тогда
			Если Вопрос("Есть изменения маркируемых товаров, после принятия изменений информация о считанных марках по этим товарам будет удалена, восстановить можно будет только вернув заказ." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ОбновитьНаСервере(СтруктураПараметров);
		
		Если СтруктураПараметров.Результат = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(СтруктураПараметров)
	
	//изменение заказа
	ТаблицаТоваровНовая = ИнтернетМагазинСлужебный.ИнициализацияТаблицыТоваров();
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.Отменено Тогда
			Продолжить;
		КонецЕсли;
		Если СтрокаТаблицы.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НС = ТаблицаТоваровНовая.Добавить();
		НС.Номенклатура = СтрокаТаблицы.Номенклатура;
		НС.Количество = СтрокаТаблицы.Количество;
		НС.СтавкаНДС = ОбменССайтамиУТ.ПредставлениеСтавкиНДСПриВыгрузке(СтрокаТаблицы.СтавкаНДС);
		НС.Сумма = СтрокаТаблицы.Сумма;
		НС.Цена = СтрокаТаблицы.Цена;
		НС.КоличествоШтук = СтрокаТаблицы.КоличествоШтук
		
	КонецЦикла;
	
	ПараметрыОбновленияЗаказа = Новый Структура;
	ПараметрыОбновленияЗаказа.Вставить("ПричинаОтменыКомплектация", Справочники.ПричиныОтменыЗаказовКлиентов.НайтиПоНаименованию("Отказ"));
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	ИнтернетМагазинСлужебный.СкорректироватьТабличнуюЧастьТоварыЗаказа(ЗаказОбъект, ТаблицаТоваровНовая, ПараметрыОбновленияЗаказа);
	
	//изменение регистров
	Склад = ЗаказОбъект.Склад;
	
	Отказ = Ложь;
	ТаблицаСоставаЗаказа = Товары.Выгрузить();
	
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(Заказ);
	Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		ДаркКитченСервер.ОтразитьИзменениеСоставаЗаказПоРегистрам(ТаблицаСоставаЗаказа, Заказ, Склад, ЗаказОбъект.ВремяДоставкиС, Отказ);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Ошибка записи" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		ЗаписьЖурналаРегистрации("ИМ.ИзменениеСоставаЗаказаДаркКитчен", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	//временно делаем отправку изменений заказов ДаркКитчен в телегу
	//ТекстСообщения = Строка(Заказ) + Символы.ПС + Строка(ЗаказОбъект.НомерЗаказаНаСайте) + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + "<b>Изменен состав заказа ДаркКитчен</b>";
	//Telegram_Admin.SendMessage(Строка(ОбщегоНазначенияПовтИсп.ПолучитьАббревиатуруТекущейБазы()) + Символы.ПС + ТекстСообщения,, "-728074965", "HTML");
	
	Возврат;
	
	НаборЗРСПроизводство = РегистрыСведений.СтатусыПроизводстваДК.СоздатьНаборЗаписей();
	НаборЗРСПроизводство.Отбор.Документ.Установить(Заказ);
	НаборЗРСПроизводство.Отбор.Склад.Установить(Склад);
	НаборЗРСПроизводство.Прочитать();
	ТаблицаЗаписейПроизводства = НаборЗРСПроизводство.Выгрузить();
	
	Для Каждого СтрокаТаблицы Из Товары Цикл
		
		Если СтрокаТаблицы.Количество = СтрокаТаблицы.КоличествоВЗаказе Тогда
			//ничего не изменилось
			Продолжить;
		КонецЕсли;
		
		ТоварНеТребуетГотовки = СписокЦеховСПоваром.НайтиПоЗначению(СтрокаТаблицы.Цех) = Неопределено;
		
		НайденныеСтроки = ТаблицаЗаписейПроизводства.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТаблицы.Номенклатура));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			//Добавили новый товар в заказ
			// добавляем строку с добавляемым количеством в регистр в статусе Новый (нужно готовить) или ВСборке (не нужно готовить)
			
			НС = ТаблицаЗаписейПроизводства.Добавить();
			НС.Склад = Склад;
			НС.Цех = СтрокаТаблицы.Цех;
			НС.Номенклатура = СтрокаТаблицы.Номенклатура;
			НС.Документ = Заказ;
			НС.ДатаНовый = ТекущаяДата();
			НС.ЖДВ = ЗаказОбъект.ВремяДоставкиС;
			НС.Количество = СтрокаТаблицы.Количество;
			НС.КоличествоВЗаказе = СтрокаТаблицы.Количество;
			НС.ТекущийСтатус = ?(ТоварНеТребуетГотовки, Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке, Перечисления.СтатусыПроизводственныхЗаказовДК.Новый);
			Продолжить;
			
		КонецЕсли;
		
		Если СтрокаТаблицы.Количество = 0 И СтрокаТаблицы.КоличествоВЗаказе <> 0 Тогда
			
			//убрали товар из заказа полностью
			// всем строкам с этим товаром ставим КоличествоВЗаказе = 0, меняем все статусы кроме ВПроизводстве на Отменен
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока.КоличествоВЗаказе = 0;
				НайденнаяСтрока.ТребуетсяОбработка = Ложь;
				Если НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.ВПроизводстве Тогда
					//ничего не делать
				Иначе
					НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.Отменен;
				КонецЕсли;
			КонецЦикла;
			
		ИначеЕсли СтрокаТаблицы.Количество <> 0 И СтрокаТаблицы.КоличествоВЗаказе = 0 Тогда
			
			//Добавили новый товар в заказ
			// добавляем строку с добавляемым количеством в регистр в статусе Новый (нужно готовить) или ВСборке (не нужно готовить)
			НС = ТаблицаЗаписейПроизводства.Добавить();
			НС.Склад = Склад;
			НС.Цех = СтрокаТаблицы.Цех;
			НС.Номенклатура = СтрокаТаблицы.Номенклатура;
			НС.Документ = Заказ;
			НС.ДатаНовый = ТекущаяДата();
			НС.ЖДВ = ЗаказОбъект.ВремяДоставкиС;
			НС.Количество = СтрокаТаблицы.Количество;
			НС.КоличествоВЗаказе = СтрокаТаблицы.Количество;
			НС.ТекущийСтатус = ?(ТоварНеТребуетГотовки, Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке, Перечисления.СтатусыПроизводственныхЗаказовДК.Новый);
			
		ИначеЕсли СтрокаТаблицы.Количество < СтрокаТаблицы.КоличествоВЗаказе Тогда
			
			//уменьшили количество
			// КоличествоВЗаказе во все строки пишем новое количество в заказе
			// Товар не требует готовки: приводим суммарное Количество в строках со статусом ВСборке к количеству в заказе
			// Товар требует готовки: приводим суммарное Количество с строках со статусом Новый к количеству в заказе (насколько это возможно)
			// Если количество стало <= 0 - ставим статус Отменен
			
			КоличествоКУменьшению = СтрокаТаблицы.КоличествоВЗаказе - СтрокаТаблицы.Количество;
			
			Если ТоварНеТребуетГотовки Тогда
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.КоличествоВЗаказе = СтрокаТаблицы.Количество;
					НайденнаяСтрока.ТребуетсяОбработка = Ложь;
					Если НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке Тогда
						Если НайденнаяСтрока.Количество <= КоличествоКУменьшению Тогда
							КоличествоКУменьшению = КоличествоКУменьшению - НайденнаяСтрока.Количество;
							НайденнаяСтрока.Количество = 0;
							НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.Отменен;
						Иначе
							НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КоличествоКУменьшению;
							КоличествоКУменьшению = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.КоличествоВЗаказе = СтрокаТаблицы.Количество;
					НайденнаяСтрока.ТребуетсяОбработка = Ложь;
					Если НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.Новый Тогда
						Если НайденнаяСтрока.Количество <= КоличествоКУменьшению Тогда
							КоличествоКУменьшению = КоличествоКУменьшению - НайденнаяСтрока.Количество;
							НайденнаяСтрока.Количество = 0;
							НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.Отменен;
						Иначе
							НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КоличествоКУменьшению;
							КоличествоКУменьшению = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли СтрокаТаблицы.Количество > СтрокаТаблицы.КоличествоВЗаказе Тогда
			
			//увеличили количество
			// КоличествоВЗаказе во все строки пишем новое количество в заказе
			// Товар не требует готовки: приводим суммарное Количество в строках со статусом ВСборке к количеству в заказе, если нет таких строк - добавляем (хз как такое может быть)
			// Товар требует готовки: 
			//	1. Проходим по строкам в статусе новый и приводим суммарное Количество к количеству в заказе
			//	2. Если строк в статусе Новый нет - создаем новую в статусе Новый
			
			КоличествоКДобавлению = СтрокаТаблицы.Количество - СтрокаТаблицы.КоличествоВЗаказе;
			
			Если ТоварНеТребуетГотовки Тогда
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.КоличествоВЗаказе = СтрокаТаблицы.Количество;
					НайденнаяСтрока.ТребуетсяОбработка = Ложь;
					Если НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке Тогда
						НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + КоличествоКДобавлению;
						КоличествоКДобавлению = 0;
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					НайденнаяСтрока.КоличествоВЗаказе = СтрокаТаблицы.Количество;
					НайденнаяСтрока.ТребуетсяОбработка = Ложь;
					Если НайденнаяСтрока.ТекущийСтатус = Перечисления.СтатусыПроизводственныхЗаказовДК.Новый Тогда
						НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + КоличествоКДобавлению;
						КоличествоКДобавлению = 0;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если КоличествоКДобавлению > 0 Тогда
				НС = ТаблицаЗаписейПроизводства.Добавить();
				НС.Склад = Склад;
				НС.Цех = СтрокаТаблицы.Цех;
				НС.Номенклатура = СтрокаТаблицы.Номенклатура;
				НС.Документ = Заказ;
				НС.ДатаНовый = ТекущаяДата();
				НС.ЖДВ = ЗаказОбъект.ВремяДоставкиС;
				НС.Количество = КоличествоКДобавлению;
				НС.КоличествоВЗаказе = СтрокаТаблицы.Количество;
				НС.ТекущийСтатус = ?(ТоварНеТребуетГотовки, Перечисления.СтатусыПроизводственныхЗаказовДК.ВСборке, Перечисления.СтатусыПроизводственныхЗаказовДК.Новый);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТекущийНомерВерсии = ПолучитьТекущийНомерВерсии(Заказ);
	Если НомерВерсииПриНачалеРедактирования <> ТекущийНомерВерсии Тогда
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Заказ был изменен другим пользователем, сохранение невозможно" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		Возврат;
	КонецЕсли;
	
	НаборЗРСПроизводство.Загрузить(ТаблицаЗаписейПроизводства);
	НаборЗРСПроизводство.ДополнительныеСвойства.Вставить("НЕПишемРСДК", Истина);
	
	НачатьТранзакцию();
	Попытка
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		НаборЗРСПроизводство.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Ошибка записи" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		ЗаписьЖурналаРегистрации("ИМ.ИзменениеСоставаЗаказаДаркКитчен", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА СтатусыПроизводстваДК.Цех В (&ЦехаГотовки)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ТребуетсяГотовка,
	               |	СтатусыПроизводстваДК.ТекущийСтатус КАК ТекущийСтатус,
	               |	СтатусыПроизводстваДК.ТребуетсяОбработка КАК ТребуетсяОбработка
	               |ИЗ
	               |	РегистрСведений.СтатусыПроизводстваДК КАК СтатусыПроизводстваДК
	               |ГДЕ
	               |	СтатусыПроизводстваДК.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Заказ);
	Запрос.УстановитьПараметр("ЦехаГотовки", СписокЦеховСПоваром.ВыгрузитьЗначения());
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаДанных = РезультатЗапроса.Выгрузить();
	СтатусДК = ДаркКитченСервер.ПолучитьСтатусЗаказаПоСтатусамПроизводства(ТаблицаДанных);
	
	ДаркКитченСервер.ОбновитьРССтатусЗаказаДК(Заказ, Ложь, , , СтатусДК, Ложь);
	
	//временно делаем отправку изменений заказов ДаркКитчен в телегу
	ТекстСообщения = Строка(Заказ) + Символы.ПС + Строка(ЗаказОбъект.НомерЗаказаНаСайте) + Символы.ПС + Строка(ПараметрыСеанса.ТекущийПользователь) + Символы.ПС + "<b>Изменен состав заказа ДаркКитчен</b>";
	Telegram_Admin.SendMessage(Строка(ОбщегоНазначенияПовтИсп.ПолучитьАббревиатуруТекущейБазы()) + Символы.ПС + ТекстСообщения,, "-728074965", "HTML");
	
КонецПроцедуры


#КонецОбласти


#Область ДанныеЗаказ

&НаКлиенте
Процедура ДанныеЗаказПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

//НомерИзмененнойКолонки
//1 - Количество
//2 - КоличествоШтук
//3 - Отменено
&НаКлиенте
Функция ПересчитатьСтрокуТовары(ТекущиеДанные, НомерИзмененнойКолонки)
	
	//маркированная продукция
	Если ТекущиеДанные.МаркируемаяПродукция И ЗаказСобран Тогда
		
		//маркированная продукция
		Если НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Истина Тогда
			ТекущиеДанные.Количество = 0;
			ТекущиеДанные.КоличествоШтук = 0;
			ТекущиеДанные.Сумма = 0;
			ЕстьИзмененияМаркруемыхТоваров = Истина;
		ИначеЕсли НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Ложь Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоВЗаказе;
			ТекущиеДанные.КоличествоШтук = ТекущиеДанные.КоличествоШтукВЗаказе;
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Количество * ТекущиеДанные.Цена, 2);
			ЕстьИзмененияМаркруемыхТоваров = Истина;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменения количества маркируемой продукции запрещены. Возможен только полный вычерк строки.");
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоВЗаказе;
			Возврат Ложь;
		КонецЕсли;
		
	Иначе
		
		//немаркированная продукция
		Если НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Истина Тогда
			ТекущиеДанные.Количество = 0;
			ТекущиеДанные.КоличествоШтук = 0;
			ТекущиеДанные.Сумма = 0;
		ИначеЕсли НомерИзмененнойКолонки = 3 И ТекущиеДанные.Отменено = Ложь Тогда
			ТекущиеДанные.Количество = ТекущиеДанные.КоличествоВЗаказе;
			ТекущиеДанные.КоличествоШтук = ТекущиеДанные.КоличествоШтукВЗаказе;
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Количество * ТекущиеДанные.Цена, 2);
		ИначеЕсли НомерИзмененнойКолонки = 1 Тогда
			ТекущиеДанные.Отменено = ТекущиеДанные.Количество = 0;
			НовоеКоличествоШтук = ?(ТекущиеДанные.КоличествоВЗаказе > 0, ТекущиеДанные.Количество * ТекущиеДанные.КоличествоШтукВЗаказе / ТекущиеДанные.КоличествоВЗаказе, 0);
			Если НовоеКоличествоШтук <> ТекущиеДанные.КоличествоШтук Тогда
				//Если Вопрос("Пересчитать количество штук?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ТекущиеДанные.КоличествоШтук = НовоеКоличествоШтук;
				//КонецЕсли;
			КонецЕсли;
			ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Количество * ТекущиеДанные.Цена, 2);
		ИначеЕсли НомерИзмененнойКолонки = 2 Тогда
			Если ТекущиеДанные.КоличествоШтукВЗаказе > 0 Тогда
				ТекущиеДанные.Отменено = ТекущиеДанные.КоличествоШтук = 0;
				НовоеКоличество = ТекущиеДанные.КоличествоВЗаказе * ТекущиеДанные.КоличествоШтук / ТекущиеДанные.КоличествоШтукВЗаказе;
				Если ТекущиеДанные.Количество <> НовоеКоличество Тогда
					//Если Вопрос("Пересчитать количество?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
						ТекущиеДанные.Количество = НовоеКоличество;
					//КонецЕсли;
				КонецЕсли;
				ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Количество * ТекущиеДанные.Цена, 2);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ДанныеЗаказПриАктивизацииСтроки(Элемент)

КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказКоличествоПриИзменении(Элемент)
	Если ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 1) Тогда
		Если НЕ ЕстьИзменения Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
		ПересчитатьСуммы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказОтмененоПриИзменении(Элемент)
	Если ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 3) Тогда
		Если НЕ ЕстьИзменения Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
		ПересчитатьСуммы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗаказКоличествоШтукПриИзменении(Элемент)
	Если ПересчитатьСтрокуТовары(Элементы.ДанныеЗаказ.ТекущиеДанные, 2) Тогда
		Если НЕ ЕстьИзменения Тогда
			ЕстьИзменения = Истина;
		КонецЕсли;
		ПересчитатьСуммы();
	КонецЕсли;
КонецПроцедуры


#КонецОбласти


#Область ДобавитьНоменклатуру

&НаКлиенте
Процедура ДобавитьНоменклатуру(Команда)
	ОткрытьФормуВыбораНоменклатуры(Ложь, Истина, Элементы.ДанныеЗаказНоменклатура, "ПриЗакрытииФормыВыбораНоменклатуры");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораНоменклатуры(МножественныйВыбор, ЗакрыватьПриВыборе, Владелец, ПроцедураПриЗакрытии = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФиксированныеНастройки",	ПолучитьНастройкиКомпоновкиДляФормыВыбораНоменклатуры());
	ПараметрыФормы.Вставить("РежимВыбора",				Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",		МножественныйВыбор);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",		ЗакрыватьПриВыборе);
	ПараметрыФормы.Вставить("ОтображениеТаблицы",		ОтображениеТаблицы.Список);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Владелец
		, , , , ?(ПроцедураПриЗакрытии = Неопределено, Неопределено, Новый ОписаниеОповещения(ПроцедураПриЗакрытии, ЭтаФорма)));
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНастройкиКомпоновкиДляФормыВыбораНоменклатуры()
	
	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	
	СписокДоступнойНоменклатуры = Новый СписокЗначений;
	СписокДоступнойНоменклатуры.ЗагрузитьЗначения(ПолучитьМассивДоступныхНоменклатурНаСервере());
	
	ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ПравоеЗначение = СписокДоступнойНоменклатуры;
	
	Возврат НастройкиКомпоновки;
	
КонецФункции

&НаСервере
Функция ПолучитьМассивДоступныхНоменклатурНаСервере()
	
	ТаблицаНоменклатурДляДобавления.Очистить();
	МассивНоменклатур = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	сНоменклатура.Ссылка КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	ВЫБОР
	               |		КОГДА сНоменклатура.ТипМаркируемойПродукции = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК МаркируемаяПродукция,
	               |	сНоменклатура.СтавкаНДС КАК СтавкаНДС,
	               |	сНоменклатура.АссортиментДК КАК Цех
	               |ИЗ
	               |	Справочник.Номенклатура КАК сНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО сНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоступностьТоваровКЗаказуДК КАК ДоступностьТоваровКЗаказуДК
	               |		ПО сНоменклатура.Ссылка = ДоступностьТоваровКЗаказуДК.Номенклатура
	               |			И (ДоступностьТоваровКЗаказуДК.Склад = &Склад)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	               |		ПО сНоменклатура.Ссылка = НоменклатураСегмента.Номенклатура
	               |			И (НоменклатураСегмента.Сегмент = &СегментДаркКитчен)
	               |ГДЕ
	               |	НЕ сНоменклатура.ПометкаУдаления
	               |	И НЕ сНоменклатура.ЭтоГруппа
	               |	И сНоменклатура.АссортиментДК <> &АссортиментДКПустаяСсылка
	               |	И ЦеныНоменклатурыСрезПоследних.Цена <= &ПорогЦены
	               |	И ВЫБОР
	               |			КОГДА ДоступностьТоваровКЗаказуДК.Доступен ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			КОГДА ДоступностьТоваровКЗаказуДК.Доступен
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	сНоменклатура.Ссылка,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА сНоменклатура.ТипМаркируемойПродукции = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ,
	               |	сНоменклатура.СтавкаНДС,
	               |	сНоменклатура.АссортиментДК
	               |ИЗ
	               |	Справочник.Номенклатура КАК сНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаСреза, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО сНоменклатура.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоступностьТоваровКЗаказуДК КАК ДоступностьТоваровКЗаказуДК
	               |		ПО сНоменклатура.Ссылка = ДоступностьТоваровКЗаказуДК.Номенклатура
	               |			И (ДоступностьТоваровКЗаказуДК.Склад = &Склад)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
	               |		ПО сНоменклатура.Ссылка = НоменклатураСегмента.Номенклатура
	               |			И (НоменклатураСегмента.Сегмент = &СегментДаркКитчен)
	               |ГДЕ
	               |	НЕ сНоменклатура.ПометкаУдаления
	               |	И НЕ сНоменклатура.ЭтоГруппа
	               |	И сНоменклатура.АссортиментДК = &АссортиментДКСопутствующиеТовары
	               |	И ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) = 0
	               |	И ВЫБОР
	               |			КОГДА ДоступностьТоваровКЗаказуДК.Доступен ЕСТЬ NULL
	               |				ТОГДА ИСТИНА
	               |			КОГДА ДоступностьТоваровКЗаказуДК.Доступен
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СегментДаркКитчен", СегментНоменклатурыДаркКитчен);
	Запрос.УстановитьПараметр("АссортиментДКПустаяСсылка", Справочники.ЦехДК.ПустаяСсылка());
	Запрос.УстановитьПараметр("АссортиментДКСопутствующиеТовары", Справочники.ЦехДК.НайтиПоКоду("000000006"));
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	Запрос.УстановитьПараметр("Склад", СкладЗаказа);
	Запрос.УстановитьПараметр("ПорогЦены", СуммаДляПодбора);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивНоменклатур;
	КонецЕсли;
	
	РезультатВыборка = РезультатЗапроса.Выбрать();
	Пока РезультатВыборка.Следующий() Цикл
		НС = ТаблицаНоменклатурДляДобавления.Добавить();
		ЗаполнитьЗначенияСвойств(НС, РезультатВыборка);
		МассивНоменклатур.Добавить(РезультатВыборка.Номенклатура);
	КонецЦикла;
	
	Возврат МассивНоменклатур;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораНоменклатуры(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Номенклатура", Результат));
	Если НайденныеСтроки.Количество() <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Строка(Результат) + " - уже есть в заказе, ");
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = ТаблицаНоменклатурДляДобавления.НайтиСтроки(Новый Структура("Номенклатура", Результат));
	Если НайденныеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавление " + Строка(Результат) + " запрещено");
		Возврат;
	КонецЕсли;
	
	НС = Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НС, НайденныеСтроки[0]);
	НС.Количество = 1;
	НС.КоличествоШтук = 1;
	НС.Сумма = Окр(НС.Цена * НС.Количество, 2);
	
	ЕстьИзменения = Истина;
	ПересчитатьСуммы();
	
КонецПроцедуры


#КонецОбласти


#Область ТаблицаПроизводство

&НаКлиенте
Процедура ТаблицаПроизводствоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти


#Область СнятьПризнакТребуетсяОбработка

&НаКлиенте
Процедура СнятьПризнакТребуетсяОбработка(Команда)
	СтруктураПараметров = Новый Структура("Результат, ОписаниеРезультата", Истина, "");
	СнятьПризнакТребуетсяОбработкаНаСервере(СтруктураПараметров);
	Если СтруктураПараметров.Результат = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураПараметров.ОписаниеРезультата);
		Возврат;
	КонецЕсли;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакТребуетсяОбработкаНаСервере(СтруктураПараметров)
	
	НЗРС = РегистрыСведений.СтатусыПроизводстваДК.СоздатьНаборЗаписей();
	НЗРС.Отбор.Документ.Установить(Заказ);
	НЗРС.Прочитать();
	ТребуетсяЗаписьСтатусыПроизводства = Ложь;
	Для Каждого МЗРС Из НЗРС Цикл
		Если МЗРС.ТребуетсяОбработка Тогда
			МЗРС.ТребуетсяОбработка = Ложь;
			ТребуетсяЗаписьСтатусыПроизводства = Истина;
		КонецЕсли;
	КонецЦикла;
	НЗРС.ДополнительныеСвойства.Вставить("НЕПишемРСДК", Истина);
	
	НачатьТранзакцию();
	Попытка
		Если ТребуетсяЗаписьСтатусыПроизводства Тогда
			НЗРС.Записать();
		КонецЕсли;
		ДаркКитченСервер.ОбновитьРССтатусЗаказаДК(Заказ, Ложь, , , , Ложь);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		СтруктураПараметров.Вставить("Результат", Ложь);
		СтруктураПараметров.Вставить("ОписаниеРезультата", "Ошибка снятия ""Требуется обработка""" + Символы.ПС + "Закройте форму и выполните операцию еще раз");
		ЗаписьЖурналаРегистрации("ИМ.СнятиеТребуетсяОбработка", УровеньЖурналаРегистрации.Ошибка, Заказ.Метаданные(), Заказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


